#############################################################################
##
#W  extreme/pairs.tst
#Y  Copyright (C) 2014-15                                   Michael Torpey
##                                                          Wilfred Wilson
##
##  Licensing information can be found in the README file of this package.
##
#############################################################################
##
gap> START_TEST("Semigroups package: extreme/pairs.tst");
gap> LoadPackage("semigroups", false);;

# Set info levels and user preferences
gap> SEMIGROUPS.StartTest();

#T# PairsCongTest1
gap> s := Semigroup([Transformation([1, 3, 4, 1, 3, 5]),
>    Transformation([2, 4, 6, 1, 6, 5]),
>    Transformation([4, 1, 2, 6, 2, 1]),
>    Transformation([4, 6, 4, 3, 3, 3]),
>    Transformation([5, 1, 6, 1, 6, 3]),
>    Transformation([5, 2, 5, 3, 5, 3])]);;
gap> gens := [
>  [Transformation([5, 5, 2, 4, 2, 4]),
>    Transformation([1, 5, 4, 5, 4, 5])],
>  [Transformation([3, 3, 3, 6, 3, 3]),
>    Transformation([1, 6, 6, 6, 6, 1])]];;
gap> cong := SemigroupCongruence(s, gens);
<semigroup congruence over <transformation semigroup of degree 6 with 6 
 generators> with 2 generating pairs>
gap> gens[2] in cong;
true
gap> x := Transformation([6, 5, 4, 4, 4, 6]);;
gap> y := Transformation([2, 2, 2, 6, 2, 4]);;
gap> z := Transformation([2, 4, 6, 1, 6, 5]);;
gap> [x, y] in cong; [x, z] in cong; [y, z] in cong;
true
false
false
gap> [x, y, z] in cong;
Error, Semigroups: \in (for a congruence): usage,
the first arg <pair> must be a list of length 2,
gap> [x, Transformation([1])] in cong;
Error, Semigroups: \in (for a congruence): usage,
elements of the first arg <pair> must be
in the range of the second arg <cong>,
gap> classes := CongruenceClasses(cong);;
gap> Size(classes) = NrCongruenceClasses(cong);
true
gap> classx := CongruenceClassOfElement(cong, x);;
gap> classy := CongruenceClassOfElement(cong, y);;
gap> classz := CongruenceClassOfElement(cong, z);
<congruence class of Transformation( [ 2, 4, 6, 1, 6, 5 ] )>
gap> classx = classy;
true
gap> classz = classx;
false
gap> x in classx;
true
gap> y in classx;
true
gap> x in classz;
false
gap> classx = classes[4];
true
gap> classz = classes[2];
true
gap> z * y in classz * classy;
true
gap> y * z in classx * classz;
true
gap> Size(classx);
3084
gap> q := s / cong;;
gap> P := [[(), 0, (1, 3), (1, 3), 0, (), 0],
>   [(), (1, 3), 0, 0, (1, 3), (), 0], [(), (1, 3), 0, (), 0, 0, ()],
>   [0, (), (1, 3), (1, 3), (), 0, 0], [0, 0, 0, (), (), (1, 3), ()],
>   [(), 0, (1, 3), 0, (), 0, ()]];;
gap> R := ReesZeroMatrixSemigroup(Group([(1, 3)]), P);;
gap> x := ReesZeroMatrixSemigroupElement(R, 1, (1, 3), 1);;
gap> y := ReesZeroMatrixSemigroupElement(R, 1, (), 1);;
gap> cong := SemigroupCongruenceByGeneratingPairs(R, [[x, y]]);;
gap> c := EquivalenceClasses(cong);;
gap> Size(c) = 43;
true
gap> cong := SemigroupCongruenceByGeneratingPairs(R, []);;
gap> c := EquivalenceClasses(cong);;
gap> Size(c) = 85;
true

#T# PairsCongTest2: Checking robustness against infinite semigroups
gap> s := FreeSemigroup(1);
<free semigroup on the generators [ s1 ]>
gap> x := GeneratorsOfSemigroup(s)[1];
s1
gap> gens := [x ^ 2, x ^ 4];
[ s1^2, s1^4 ]
gap> cong := SemigroupCongruence(s, gens);
<semigroup congruence over <free semigroup on the generators [ s1 ]> with 
1 generating pairs>
gap> gens in cong;
Error, Semigroups: \in (for a congruence): usage,
this function currently only works if <cong> is a congruence of a semigroup
which is known to be finite,
gap> EquivalenceRelationLookup(cong);
Error, Semigroups: EquivalenceRelationLookup: usage,
<cong> must be a congruence of a finite semigroup,
gap> EquivalenceClasses(cong);
Error, Semigroups: EquivalenceClasses: usage,
this function currently only works if <cong> is a congruence of a semigroup
which is known to be finite,
gap> NrCongruenceClasses(cong);
Error, Semigroups: NrCongruenceClasses: usage,
this function currently only works if <cong> is a congruence of a semigroup
which is known to be finite,

#T# PairsCongTest3: \= for two semigroup congruences
gap> gens := [Transformation([2, 6, 7, 2, 6, 9, 9, 1, 1, 5])];;
gap> s := Semigroup(Transformation([1]));;
gap> t := Monoid(gens);;
gap> u := UniversalSemigroupCongruence(s);
<universal semigroup congruence over <trivial transformation group of 
 degree 0 with 1 generator>>
gap> v := SemigroupCongruence(t, [gens[1], gens[1]]);
<semigroup congruence over <commutative transformation monoid of degree 10 
 with 1 generator> with 0 generating pairs>
gap> NrCongruenceClasses(v);
6
gap> Size(t);
6
gap> u = v;
false
gap> u := UniversalSemigroupCongruence(t);
<universal semigroup congruence over <commutative transformation monoid 
 of size 6, degree 10 with 1 generator>>
gap> u = v;
false
gap> gens := List(t, x -> [gens[1], x]);;
gap> v := SemigroupCongruence(t, gens);
<semigroup congruence over <commutative transformation monoid of size 6, 
 degree 10 with 1 generator> with 5 generating pairs>
gap> u = v;
true
gap> NrCongruenceClasses(u);
1

#T# PairsCongTest4: \* for two semigroups congruence classes
gap> gens := [Transformation([2, 6, 7, 2, 6, 9, 9, 1, 1, 5])];;
gap> s := Semigroup(gens);;
gap> gens := List(s, x -> [gens[1], x]);;
gap> u := SemigroupCongruence(s, gens); # universal congruence
<semigroup congruence over <commutative transformation semigroup of degree 10 
 with 1 generator> with 4 generating pairs>
gap> u = UniversalSemigroupCongruence(s);
true
gap> v := SemigroupCongruence(s, [gens[1], gens[1]]); # trivial congruence
<semigroup congruence over <commutative transformation semigroup of size 5, 
 degree 10 with 1 generator> with 0 generating pairs>
gap> classes := Set(CongruenceClasses(v));
[ <congruence class of Transformation( [ 1, 2, 2, 1, 2, 6, 6, 9, 9, 1 ] )>, 
  <congruence class of Transformation( [ 2, 6, 6, 2, 6, 9, 9, 1, 1, 2 ] )>, 
  <congruence class of Transformation( [ 2, 6, 7, 2, 6, 9, 9, 1, 1, 5 ] )>, 
  <congruence class of Transformation( [ 6, 9, 9, 6, 9, 1, 1, 2, 2, 6 ] )>, 
  <congruence class of Transformation( [ 9, 1, 1, 9, 1, 2, 2, 6, 6, 9 ] )> ]
gap> ForAny(CongruenceClasses(u), x -> x in classes);
false
gap> classes[1] * CongruenceClasses(u)[1];
Error, Semigroups: *: usage,
the args must be classes of the same congruence,
gap> CongruenceClasses(u)[1] * classes[1];
Error, Semigroups: *: usage,
the args must be classes of the same congruence,
gap> classes[3] * classes[4];
<congruence class of Transformation( [ 9, 1, 1, 9, 1, 2, 2, 6, 6, 9 ] )>
gap> classes[4] * classes[3];
<congruence class of Transformation( [ 9, 1, 1, 9, 1, 2, 2, 6, 6, 9 ] )>
gap> Representative(classes[5] * classes[2]) =
> Representative(classes[5]) * Representative(classes[2]);
true

#T# LatticeOfCongruences
gap> S := Semigroup([
> Transformation([1, 3, 4, 1]), Transformation([3, 1, 1, 3])]);;
gap> l := LatticeOfCongruences(S);
[ [  ], [ 1, 5, 28, 37 ], 
  [ 1, 2, 5, 6, 7, 8, 9, 10, 12, 13, 14, 16, 21, 22, 23, 24, 25, 26, 27, 28, 
      29, 30, 32, 33, 34, 35, 36, 37, 38, 39, 42, 44, 45, 48, 49, 51, 52 ], 
  [ 1, 2, 5, 6, 9, 10, 11, 12, 14, 17, 20, 22, 23, 26, 28, 30, 32, 35, 37, 46 
     ], [ 1 ], [ 1, 5, 9, 10, 22, 23, 26, 28, 32, 35, 37 ], 
  [ 1, 2, 5, 8, 9, 10, 13, 14, 21, 22, 23, 27, 28, 32, 33, 36, 37, 44 ], 
  [ 1, 10 ], [ 1, 10, 28 ], [ 1 ], 
  [ 1, 5, 6, 9, 10, 22, 23, 26, 28, 32, 35, 37 ], 
  [ 1, 2, 5, 6, 9, 10, 14, 22, 23, 26, 28, 30, 32, 35, 37 ], 
  [ 1, 8, 10, 22, 44 ], [ 1, 2, 5, 9, 10, 22, 23, 28, 32, 37 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 
      22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 
      40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52 ], 
  [ 1, 8, 10, 13, 22, 26, 44, 45, 49 ], [ 1, 2, 5, 28, 37 ], 
  [ 1, 5, 6, 8, 9, 10, 11, 13, 21, 22, 23, 25, 26, 27, 28, 32, 33, 35, 36, 
      37, 38, 43, 44, 45, 49, 51, 52 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 17, 18, 20, 21, 22, 23, 24, 
      25, 26, 27, 28, 30, 32, 33, 35, 36, 37, 38, 40, 41, 42, 43, 44, 45, 46, 
      49, 51, 52 ], 
  [ 1, 2, 5, 9, 10, 14, 17, 22, 23, 26, 28, 30, 32, 35, 37, 46 ], 
  [ 1, 5, 8, 10, 23 ], [ 1, 10 ], [ 1, 5, 10 ], 
  [ 1, 2, 5, 6, 7, 8, 9, 10, 12, 13, 14, 21, 22, 23, 25, 26, 27, 28, 30, 32, 
      33, 35, 36, 37, 38, 42, 44, 45, 49, 51, 52 ], 
  [ 1, 5, 6, 8, 9, 10, 21, 22, 23, 26, 27, 28, 32, 35, 36, 37, 44, 45, 51 ], 
  [ 1, 10, 22 ], [ 1, 8, 9, 10, 28 ], [ 1 ], 
  [ 1, 2, 5, 7, 8, 9, 10, 13, 14, 16, 21, 22, 23, 26, 27, 28, 30, 32, 33, 34, 
      35, 36, 37, 42, 44, 45, 49, 51, 52 ], 
  [ 1, 2, 5, 9, 10, 14, 22, 23, 26, 28, 32, 35, 37 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 22, 
      23, 24, 25, 26, 27, 28, 29, 30, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 
      42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52 ], 
  [ 1, 5, 9, 10, 22, 23, 28, 37 ], 
  [ 1, 5, 8, 9, 10, 13, 21, 22, 23, 27, 28, 32, 36, 37, 44 ], 
  [ 1, 5, 8, 9, 10, 13, 16, 21, 22, 23, 26, 27, 28, 32, 33, 35, 36, 37, 44, 
      45, 49, 51, 52 ], [ 1, 5, 9, 10, 22, 23, 26, 28, 32, 37 ], 
  [ 1, 5, 8, 9, 10, 21, 22, 23, 27, 28, 32, 37, 44 ], [ 1, 5, 28 ], 
  [ 1, 5, 6, 8, 9, 10, 13, 21, 22, 23, 25, 26, 27, 28, 32, 33, 35, 36, 37, 
      44, 45, 49, 51, 52 ], 
  [ 1, 5, 6, 8, 9, 10, 13, 16, 21, 22, 23, 25, 26, 27, 28, 32, 33, 34, 35, 
      36, 37, 38, 44, 45, 49, 51, 52 ], 
  [ 1, 2, 5, 7, 8, 9, 10, 13, 14, 17, 21, 22, 23, 27, 28, 32, 33, 36, 37, 44, 
      46 ], [ 1, 2, 5, 7, 8, 9, 10, 13, 14, 17, 20, 21, 22, 23, 26, 27, 28, 
      30, 32, 33, 35, 36, 37, 40, 42, 44, 45, 46, 49, 51, 52 ], 
  [ 1, 2, 5, 7, 8, 9, 10, 13, 14, 21, 22, 23, 26, 27, 28, 30, 32, 33, 35, 36, 
      37, 44, 45, 49, 51, 52 ], 
  [ 1, 5, 6, 8, 9, 10, 11, 21, 22, 23, 25, 26, 27, 28, 32, 35, 36, 37, 44, 
      45, 51 ], [ 1, 8, 10, 22 ], [ 1, 8, 10, 22, 26, 44 ], 
  [ 1, 2, 5, 9, 10, 14, 17, 22, 23, 28, 32, 37 ], 
  [ 1, 5, 6, 8, 9, 10, 11, 13, 16, 18, 21, 22, 23, 25, 26, 27, 28, 32, 33, 
      34, 35, 36, 37, 38, 39, 43, 44, 45, 49, 51, 52 ], 
  [ 1, 2, 5, 6, 7, 8, 9, 10, 12, 13, 14, 16, 21, 22, 23, 24, 25, 26, 27, 28, 
      29, 30, 32, 33, 34, 35, 36, 37, 38, 39, 42, 44, 45, 49, 51, 52 ], 
  [ 1, 8, 10, 13, 22, 26, 44, 45 ], 
  [ 1, 2, 5, 7, 8, 9, 10, 13, 14, 16, 17, 20, 21, 22, 23, 26, 27, 28, 29, 30, 
      32, 33, 34, 35, 36, 37, 40, 41, 42, 44, 45, 46, 49, 51, 52 ], 
  [ 1, 5, 8, 9, 10, 21, 22, 23, 26, 27, 28, 32, 35, 36, 37, 44, 45 ], 
  [ 1, 5, 8, 9, 10, 13, 21, 22, 23, 26, 27, 28, 32, 33, 35, 36, 37, 44, 45, 
      49, 51 ] ]
gap> S := Semigroup([
> Transformation([1, 4, 3, 1, 4, 2]), Transformation([1, 6, 6, 3, 6, 6])]);;
gap> l := LatticeOfCongruences(S);
[ [  ], [ 1 ], [ 1, 2, 5 ], [ 1, 2, 3, 5 ], [ 1, 2 ] ]
gap> S := Semigroup([
> Transformation([4, 3, 1, 1, 6, 4]), Transformation([4, 3, 6, 4, 2, 3])]);;
gap> l := LatticeOfCongruences(S);
[ [  ], [ 1 ], [ 1, 2, 4, 6, 17, 19, 27, 43, 45, 55, 56, 76, 84, 89, 173, 175 
     ], [ 1, 2, 6, 27 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 27, 28, 30, 36, 38, 57, 58, 59, 73, 86, 87, 
      98, 170, 171 ], [ 1, 2 ], 
  [ 1, 2, 4, 6, 8, 13, 15, 16, 27, 28, 30, 38, 57, 59, 86, 98, 170 ], 
  [ 1, 2, 6, 13, 15, 16, 38, 59 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 10, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24, 
      25, 26, 27, 28, 29, 30, 31, 32, 33, 36, 37, 38, 39, 40, 43, 44, 45, 46, 
      49, 50, 51, 55, 56, 57, 58, 59, 60, 61, 63, 64, 66, 67, 68, 69, 73, 74, 
      76, 77, 78, 79, 83, 84, 85, 86, 87, 89, 90, 91, 95, 96, 97, 98, 99, 
      100, 104, 109, 110, 111, 112, 113, 114, 115, 116, 126, 128, 129, 130, 
      131, 132, 133, 134, 136, 137, 138, 139, 141, 143, 144, 145, 146, 147, 
      148, 150, 151, 155, 157, 162, 163, 165, 166, 168, 169, 170, 171, 172, 
      173, 174, 175, 176, 178, 179, 181, 182, 183, 184, 185, 193, 194, 198, 
      199, 202, 208, 213, 227, 237, 239, 240, 243, 245, 247, 252, 254, 255, 
      257, 258, 263, 265, 266, 272, 273, 278, 279, 280, 281, 283, 284, 286, 
      289, 290, 293, 307, 309, 310, 311, 312, 313, 315, 324, 325 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 38, 39, 44, 45, 51, 55, 56, 59, 89, 100, 104, 
      128, 133, 134, 202, 213 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 12, 13, 14, 15, 16, 17, 19, 20, 21, 22, 23, 24, 
      25, 26, 27, 28, 29, 30, 31, 38, 39, 40, 41, 42, 43, 44, 45, 51, 52, 53, 
      54, 55, 56, 57, 59, 64, 65, 69, 70, 71, 72, 74, 75, 76, 84, 85, 86, 88, 
      89, 91, 92, 93, 94, 95, 96, 97, 98, 100, 101, 102, 103, 104, 109, 110, 
      111, 112, 113, 114, 115, 117, 118, 119, 126, 127, 128, 129, 130, 131, 
      133, 134, 135, 137, 138, 139, 140, 143, 146, 148, 149, 151, 152, 153, 
      154, 155, 156, 158, 159, 160, 163, 164, 166, 167, 170, 172, 173, 174, 
      175, 176, 177, 178, 180, 181, 182, 183, 185, 186, 201, 202, 203, 204, 
      205, 208, 209, 210, 211, 212, 213, 214, 222, 231, 236, 244, 245, 251, 
      252, 253, 255, 256, 257, 258, 262, 264, 265, 267, 268, 269, 270, 271, 
      272, 274, 278, 280, 281, 282, 283, 288, 290, 291, 295, 297, 301, 306, 
      309, 310, 313, 320, 322, 324, 327 ], 
  [ 1, 2, 4, 6, 7, 8, 10, 13, 14, 15, 16, 27, 28, 29, 30, 31, 38, 39, 40, 42, 
      43, 44, 45, 51, 54, 55, 56, 57, 59, 74, 75, 76, 86, 89, 91, 94, 95, 98, 
      100, 103, 104, 113, 114, 115, 119, 128, 129, 130, 131, 133, 134, 135, 
      170, 172, 173, 174, 175, 176, 177, 178, 180, 181, 182, 183, 185, 186, 
      202, 205, 208, 209, 212, 213, 214, 245, 257, 258, 272, 274, 278, 280, 
      281, 282, 283, 309, 310, 313, 324 ], [ 1, 2, 15, 16 ], 
  [ 1, 2, 13, 15, 16, 55, 56, 128 ], [ 1 ], [ 1, 15 ], [ 1, 2, 55, 56 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 
      28, 30, 31, 36, 37, 38, 39, 43, 45, 55, 56, 57, 58, 59, 63, 73, 76, 77, 
      78, 83, 84, 85, 86, 87, 89, 95, 96, 97, 98, 104, 126, 128, 129, 130, 
      131, 132, 133, 136, 137, 143, 145, 165, 168, 170, 171, 173, 175, 178, 
      181, 183, 184, 193, 198, 202, 239, 243, 245, 247, 258, 278, 279, 310, 
      312 ], [ 1, 2, 6, 17, 27, 45, 55, 56, 84, 89, 173, 175 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 28, 38, 39, 45, 55, 56, 59, 84, 89, 96, 
      104, 126, 128, 130, 133, 137, 178, 202 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 24, 25, 26, 27, 28, 30, 
      31, 38, 39, 43, 45, 55, 56, 57, 59, 76, 84, 85, 86, 89, 95, 96, 97, 98, 
      104, 126, 128, 129, 130, 131, 133, 137, 143, 170, 173, 175, 178, 181, 
      183, 202, 245, 258, 278, 310 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 
      28, 29, 30, 31, 38, 39, 40, 43, 44, 45, 51, 55, 56, 57, 59, 64, 69, 74, 
      76, 84, 85, 86, 89, 91, 95, 96, 97, 98, 100, 104, 109, 110, 111, 112, 
      113, 114, 115, 126, 128, 129, 130, 131, 133, 134, 137, 138, 139, 143, 
      146, 148, 151, 155, 163, 166, 170, 172, 173, 174, 175, 176, 178, 181, 
      182, 183, 185, 202, 208, 213, 245, 252, 255, 257, 258, 265, 272, 278, 
      280, 281, 283, 290, 309, 310, 313, 324 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 12, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 
      26, 27, 28, 29, 30, 31, 38, 39, 40, 42, 43, 44, 45, 51, 54, 55, 56, 57, 
      59, 64, 65, 69, 72, 74, 75, 76, 84, 85, 86, 89, 91, 94, 95, 96, 97, 98, 
      100, 103, 104, 109, 110, 111, 112, 113, 114, 115, 119, 126, 128, 129, 
      130, 131, 133, 134, 135, 137, 138, 139, 140, 143, 146, 148, 151, 154, 
      155, 156, 160, 163, 166, 167, 170, 172, 173, 174, 175, 176, 177, 178, 
      180, 181, 182, 183, 185, 186, 202, 205, 208, 209, 212, 213, 214, 231, 
      245, 252, 253, 255, 257, 258, 264, 265, 270, 272, 274, 278, 280, 281, 
      282, 283, 288, 290, 309, 310, 313, 324 ], 
  [ 1, 2, 13, 14, 15, 16, 17, 30, 38, 55, 56, 57, 59, 126, 128, 131, 133, 
      137, 183, 202 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 27, 28, 30, 38, 57, 59, 86, 98, 170 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 25, 27, 28, 30, 38, 56, 57, 59, 76, 86, 89, 
      95, 98, 104, 128, 170, 175, 178, 183, 202, 245, 258, 310 ], 
  [ 1, 2, 6 ], [ 1, 2, 6, 8, 13, 15, 16, 38, 59 ], 
  [ 1, 2, 4, 6, 7, 8, 10, 13, 14, 15, 16, 27, 28, 30, 31, 38, 39, 40, 43, 44, 
      45, 51, 55, 56, 57, 59, 74, 76, 86, 89, 91, 95, 98, 100, 104, 113, 114, 
      115, 128, 129, 130, 131, 133, 134, 170, 172, 173, 174, 175, 176, 178, 
      181, 182, 183, 185, 202, 208, 213, 245, 257, 258, 272, 278, 280, 281, 
      283, 309, 310, 313, 324 ], [ 1, 15, 16, 38 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 14, 15, 16, 27, 28, 30, 38, 39, 43, 45, 55, 56, 57, 
      59, 76, 86, 89, 95, 98, 104, 128, 129, 130, 131, 133, 170, 173, 175, 
      178, 181, 183, 202, 245, 258, 278, 310 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 24, 30, 36, 38, 39, 44, 45, 49, 51, 
      55, 56, 57, 58, 59, 84, 85, 86, 87, 89, 96, 99, 100, 104, 109, 112, 
      115, 116, 126, 128, 131, 132, 133, 134, 136, 137, 138, 139, 162, 163, 
      181, 182, 183, 193, 194, 198, 202, 213, 243, 245, 247, 252, 263, 283, 
      284, 286 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 10, 13, 14, 15, 16, 27, 28, 29, 30, 31, 36, 37, 38, 
      39, 40, 43, 44, 45, 51, 55, 56, 57, 58, 59, 73, 74, 76, 79, 83, 86, 87, 
      89, 91, 95, 98, 100, 104, 113, 114, 115, 116, 128, 129, 130, 131, 132, 
      133, 134, 170, 171, 172, 173, 174, 175, 176, 178, 179, 181, 182, 183, 
      184, 185, 193, 194, 198, 199, 202, 208, 213, 237, 239, 245, 247, 257, 
      258, 272, 273, 278, 279, 280, 281, 283, 284, 309, 310, 311, 312, 313, 
      315, 324, 325 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 
      22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 33, 35, 36, 37, 38, 39, 40, 41, 
      42, 43, 44, 45, 51, 52, 53, 54, 55, 56, 57, 58, 59, 61, 62, 63, 64, 65, 
      69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 
      87, 88, 89, 91, 92, 93, 94, 95, 96, 97, 98, 100, 101, 102, 103, 104, 
      109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 121, 124, 126, 
      127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 
      141, 142, 143, 145, 146, 148, 149, 151, 152, 153, 154, 155, 156, 157, 
      158, 159, 160, 161, 163, 164, 165, 166, 167, 168, 170, 171, 172, 173, 
      174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 190, 
      191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 
      205, 208, 209, 210, 211, 212, 213, 214, 222, 226, 227, 228, 229, 230, 
      231, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 251, 
      252, 253, 255, 256, 257, 258, 262, 263, 264, 265, 266, 267, 268, 269, 
      270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 
      284, 285, 286, 287, 288, 290, 291, 293, 294, 295, 297, 301, 302, 303, 
      304, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 
      320, 321, 322, 323, 324, 325, 327, 328 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 10, 12, 13, 14, 15, 16, 27, 28, 29, 30, 31, 33, 36, 
      37, 38, 39, 40, 42, 43, 44, 45, 51, 54, 55, 56, 57, 58, 59, 73, 74, 75, 
      76, 79, 82, 83, 86, 87, 89, 91, 94, 95, 98, 100, 103, 104, 113, 114, 
      115, 116, 119, 124, 128, 129, 130, 131, 132, 133, 134, 135, 170, 171, 
      172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 
      186, 192, 193, 194, 197, 198, 199, 200, 202, 205, 208, 209, 212, 213, 
      214, 237, 238, 239, 245, 247, 257, 258, 272, 273, 274, 277, 278, 279, 
      280, 281, 282, 283, 284, 285, 309, 310, 311, 312, 313, 314, 315, 316, 
      324, 325 ], [ 1, 15, 16, 30, 38 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 14, 15, 16, 27, 28, 30, 31, 36, 38, 39, 43, 45, 
      55, 56, 57, 58, 59, 73, 76, 83, 86, 87, 89, 95, 98, 104, 128, 129, 130, 
      131, 132, 133, 170, 171, 173, 175, 178, 181, 183, 184, 193, 198, 202, 
      239, 245, 247, 258, 278, 279, 310, 312 ], [ 1, 15, 16 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 38, 45, 55, 56, 59, 89, 104, 128, 133, 202 ], 
  [ 1, 2, 4, 6, 27, 43, 44, 45, 51, 55, 56, 74, 76, 89, 172, 173, 174, 175, 
      208, 213, 313 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 42, 43, 44, 45, 51, 52, 53, 54, 55, 56, 
      64, 65, 69, 70, 71, 72, 74, 75, 76, 84, 88, 89, 138, 139, 140, 146, 
      148, 149, 172, 173, 174, 175, 203, 204, 205, 208, 209, 210, 211, 212, 
      213, 214, 222, 231, 236, 288, 295, 297, 313 ], 
  [ 1, 2, 4, 6, 27, 40, 43, 44, 45, 51, 54, 55, 56, 74, 75, 76, 89, 172, 173, 
      174, 175, 205, 208, 209, 212, 213, 214, 313 ], 
  [ 1, 2, 4, 6, 27, 45, 55, 56, 76, 89, 173, 175 ], 
  [ 1, 2, 6, 45, 51, 55, 56, 89, 213 ], [ 1, 2, 6, 55, 56, 89 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 25, 27, 28, 30, 36, 38, 57, 58, 59, 73, 
      77, 86, 87, 98, 165, 170, 171 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 10, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 
      23, 24, 25, 26, 27, 28, 29, 30, 31, 33, 35, 36, 37, 38, 39, 40, 42, 43, 
      44, 45, 51, 54, 55, 56, 57, 58, 59, 61, 62, 63, 64, 65, 69, 72, 73, 74, 
      75, 76, 77, 78, 79, 82, 83, 84, 85, 86, 87, 89, 91, 94, 95, 96, 97, 98, 
      100, 103, 104, 109, 110, 111, 112, 113, 114, 115, 116, 119, 124, 126, 
      128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 
      142, 143, 145, 146, 148, 151, 154, 155, 156, 157, 160, 161, 163, 165, 
      166, 167, 168, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 
      181, 182, 183, 184, 185, 186, 192, 193, 194, 197, 198, 199, 200, 202, 
      205, 208, 209, 212, 213, 214, 226, 227, 230, 231, 237, 238, 239, 240, 
      241, 243, 245, 247, 252, 253, 255, 257, 258, 263, 264, 265, 266, 270, 
      272, 273, 274, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 
      288, 290, 293, 304, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 
      321, 324, 325 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 
      22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 35, 36, 37, 38, 39, 40, 
      42, 43, 44, 45, 46, 49, 50, 51, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 
      64, 65, 66, 67, 68, 69, 72, 73, 74, 75, 76, 77, 78, 79, 82, 83, 84, 85, 
      86, 87, 89, 90, 91, 94, 95, 96, 97, 98, 99, 100, 103, 104, 108, 109, 
      110, 111, 112, 113, 114, 115, 116, 119, 123, 124, 125, 126, 128, 129, 
      130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 
      144, 145, 146, 147, 148, 150, 151, 154, 155, 156, 157, 160, 161, 162, 
      163, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 
      178, 179, 180, 181, 182, 183, 184, 185, 186, 189, 192, 193, 194, 197, 
      198, 199, 200, 202, 205, 207, 208, 209, 212, 213, 214, 217, 220, 225, 
      226, 227, 230, 231, 232, 235, 237, 238, 239, 240, 241, 243, 245, 247, 
      250, 252, 253, 254, 255, 257, 258, 261, 263, 264, 265, 266, 270, 272, 
      273, 274, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 
      289, 290, 293, 300, 304, 307, 308, 309, 310, 311, 312, 313, 314, 315, 
      316, 321, 324, 325 ], 
  [ 1, 2, 6, 17, 44, 45, 51, 55, 56, 84, 89, 138, 139, 213 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 36, 38, 46, 51, 56, 
      57, 58, 59, 73, 74, 76, 77, 78, 79, 83, 86, 87, 89, 91, 95, 98, 100, 
      104, 128, 165, 166, 168, 169, 170, 171, 174, 175, 176, 178, 182, 183, 
      194, 198, 202, 237, 239, 240, 245, 247, 257, 258, 307, 309, 310, 311, 
      312 ], [ 1, 2, 6, 56, 89 ], [ 1, 2, 17, 55, 56 ], 
  [ 1, 2, 6, 17, 19, 27, 45, 51, 52, 54, 55, 56, 84, 88, 89, 139, 140, 148, 
      149, 173, 174, 175, 213, 214, 222, 297, 313 ], 
  [ 1, 2, 6, 27, 51, 56, 89, 174, 175 ], [ 1, 2, 56 ], [ 1, 2 ], 
  [ 1, 2, 13, 15, 16, 30, 38, 59 ], [ 1, 2, 13, 15, 16, 30, 36, 38, 57, 59 ], 
  [ 1, 2, 13, 15, 16, 38 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 32, 36, 38, 39, 40, 43, 44, 45, 49, 51, 55, 56, 57, 
      58, 59, 63, 64, 67, 69, 73, 74, 76, 84, 85, 86, 87, 89, 90, 91, 95, 96, 
      97, 98, 99, 100, 104, 109, 110, 111, 112, 113, 114, 115, 116, 126, 128, 
      129, 130, 131, 132, 133, 134, 136, 137, 138, 139, 143, 144, 145, 146, 
      147, 148, 150, 151, 155, 157, 162, 163, 165, 166, 168, 170, 171, 172, 
      173, 174, 175, 176, 178, 179, 181, 182, 183, 184, 185, 193, 194, 198, 
      202, 208, 213, 227, 237, 239, 243, 245, 247, 252, 254, 255, 257, 258, 
      263, 265, 266, 272, 273, 278, 279, 280, 281, 283, 284, 286, 289, 290, 
      293, 307, 309, 310, 311, 312, 313, 315, 324, 325 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 10, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24, 
      25, 26, 27, 28, 29, 30, 31, 33, 36, 37, 38, 39, 40, 43, 44, 45, 51, 55, 
      56, 57, 58, 59, 63, 64, 69, 73, 74, 76, 77, 78, 79, 83, 84, 85, 86, 87, 
      89, 91, 95, 96, 97, 98, 100, 104, 109, 110, 111, 112, 113, 114, 115, 
      116, 126, 128, 129, 130, 131, 132, 133, 134, 136, 137, 138, 139, 141, 
      143, 145, 146, 148, 151, 155, 157, 163, 165, 166, 168, 170, 171, 172, 
      173, 174, 175, 176, 178, 179, 181, 182, 183, 184, 185, 193, 194, 198, 
      199, 202, 208, 213, 227, 237, 239, 240, 243, 245, 247, 252, 255, 257, 
      258, 263, 265, 266, 272, 273, 278, 279, 280, 281, 283, 284, 286, 290, 
      293, 307, 309, 310, 311, 312, 313, 315, 324, 325 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 10, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 
      23, 24, 25, 26, 27, 28, 29, 30, 31, 33, 35, 36, 37, 38, 39, 40, 42, 43, 
      44, 45, 51, 54, 55, 56, 57, 58, 59, 61, 63, 64, 65, 69, 72, 73, 74, 75, 
      76, 77, 78, 79, 82, 83, 84, 85, 86, 87, 89, 91, 94, 95, 96, 97, 98, 
      100, 103, 104, 109, 110, 111, 112, 113, 114, 115, 116, 119, 124, 126, 
      128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 
      142, 143, 145, 146, 148, 151, 154, 155, 156, 157, 160, 161, 163, 165, 
      166, 167, 168, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 
      181, 182, 183, 184, 185, 186, 192, 193, 194, 197, 198, 199, 200, 202, 
      205, 208, 209, 212, 213, 214, 226, 227, 230, 231, 237, 238, 239, 240, 
      241, 243, 245, 247, 252, 253, 255, 257, 258, 263, 264, 265, 266, 270, 
      272, 273, 274, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 
      288, 290, 293, 304, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 
      321, 324, 325 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 36, 38, 39, 43, 45, 55, 56, 57, 58, 59, 73, 76, 84, 85, 86, 87, 
      89, 95, 96, 97, 98, 104, 126, 128, 129, 130, 131, 132, 133, 136, 137, 
      143, 145, 165, 168, 170, 171, 173, 175, 178, 181, 183, 184, 193, 198, 
      202, 239, 243, 245, 247, 258, 278, 279, 310, 312 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 43, 44, 45, 51, 55, 56, 69, 74, 76, 84, 
      89, 138, 139, 146, 148, 172, 173, 174, 175, 208, 213, 313 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 42, 43, 44, 45, 51, 54, 55, 56, 64, 69, 
      72, 74, 75, 76, 84, 89, 138, 139, 140, 146, 148, 172, 173, 174, 175, 
      205, 208, 209, 212, 213, 214, 231, 288, 313 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 
      27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 46, 55, 56, 57, 58, 59, 63, 73, 
      76, 77, 78, 83, 84, 85, 86, 87, 89, 95, 96, 97, 98, 104, 126, 128, 129, 
      130, 131, 132, 133, 136, 137, 143, 145, 165, 168, 169, 170, 171, 173, 
      175, 178, 181, 183, 184, 193, 198, 202, 239, 243, 245, 247, 258, 278, 
      279, 310, 312 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 43, 44, 45, 49, 51, 55, 56, 64, 69, 74, 
      76, 84, 89, 138, 139, 146, 147, 148, 172, 173, 174, 175, 208, 213, 313 ]
    , [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 
      26, 27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 46, 50, 51, 55, 56, 57, 58, 
      59, 63, 66, 69, 73, 74, 76, 77, 78, 79, 83, 84, 85, 86, 87, 89, 91, 95, 
      96, 97, 98, 100, 104, 126, 128, 129, 130, 131, 132, 133, 134, 136, 137, 
      139, 141, 143, 145, 148, 151, 155, 163, 165, 166, 168, 169, 170, 171, 
      173, 174, 175, 176, 178, 181, 182, 183, 184, 185, 193, 194, 198, 199, 
      202, 208, 213, 227, 237, 239, 240, 243, 245, 247, 252, 255, 257, 258, 
      278, 279, 280, 281, 283, 284, 286, 290, 293, 307, 309, 310, 311, 312, 
      313, 315, 324, 325 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 43, 45, 51, 55, 56, 74, 76, 84, 89, 139, 148, 
      173, 174, 175, 208, 213, 313 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 43, 45, 52, 55, 56, 76, 84, 88, 89, 149, 173, 
      175 ], [ 1, 2, 3, 4, 6, 17, 19, 27, 43, 45, 51, 52, 53, 54, 55, 56, 69, 
      70, 72, 74, 75, 76, 84, 88, 89, 139, 140, 148, 149, 173, 174, 175, 208, 
      209, 213, 214, 222, 236, 297, 313 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 43, 45, 51, 54, 55, 56, 69, 74, 75, 76, 84, 
      89, 139, 140, 148, 173, 174, 175, 208, 209, 213, 214, 313 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 27, 28, 30, 36, 38, 57, 58, 59, 86, 87, 98, 
      170, 171 ], [ 1, 2, 4, 6, 27, 51, 56, 76, 89, 174, 175 ], 
  [ 1, 2, 4, 6, 27, 51, 54, 56, 74, 76, 89, 174, 175 ], 
  [ 1, 2, 4, 6, 27, 56, 89, 175 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 25, 27, 28, 30, 36, 38, 57, 58, 59, 73, 
      86, 87, 98, 165, 170, 171 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 36, 38, 56, 57, 58, 
      59, 73, 76, 77, 83, 86, 87, 89, 95, 98, 104, 128, 165, 168, 170, 171, 
      175, 178, 183, 198, 202, 239, 245, 247, 258, 310, 312 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 27, 28, 30, 36, 38, 51, 56, 57, 58, 59, 
      73, 74, 76, 83, 86, 87, 89, 91, 95, 98, 100, 104, 128, 170, 171, 174, 
      175, 176, 178, 182, 183, 194, 198, 202, 237, 239, 245, 247, 257, 258, 
      309, 310, 311, 312 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 
      27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 52, 55, 56, 57, 58, 59, 63, 70, 
      73, 76, 77, 78, 83, 84, 85, 86, 87, 88, 89, 92, 95, 96, 97, 98, 101, 
      104, 126, 127, 128, 129, 130, 131, 132, 133, 136, 137, 143, 145, 149, 
      152, 164, 165, 168, 170, 171, 173, 175, 178, 181, 183, 184, 193, 195, 
      198, 201, 202, 228, 239, 243, 244, 245, 246, 247, 256, 258, 278, 279, 
      291, 294, 310, 312 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 
      27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 51, 52, 53, 54, 55, 56, 57, 58, 
      59, 63, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 82, 83, 84, 85, 
      86, 87, 88, 89, 91, 92, 93, 94, 95, 96, 97, 98, 100, 101, 102, 103, 
      104, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 139, 
      140, 141, 142, 143, 145, 148, 149, 151, 152, 153, 154, 155, 156, 163, 
      164, 165, 166, 167, 168, 170, 171, 173, 174, 175, 176, 177, 178, 181, 
      182, 183, 184, 185, 186, 193, 194, 195, 196, 197, 198, 199, 200, 201, 
      202, 208, 209, 213, 214, 222, 227, 228, 229, 230, 236, 237, 238, 239, 
      240, 241, 242, 243, 244, 245, 246, 247, 251, 252, 253, 255, 256, 257, 
      258, 262, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 290, 291, 
      293, 294, 297, 301, 306, 307, 308, 309, 310, 311, 312, 313, 315, 316, 
      317, 318, 320, 324, 325, 327, 328 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 27, 28, 30, 36, 38, 51, 54, 56, 57, 58, 
      59, 73, 74, 75, 76, 79, 83, 86, 87, 89, 91, 94, 95, 98, 100, 103, 104, 
      128, 170, 171, 174, 175, 176, 177, 178, 182, 183, 194, 197, 198, 202, 
      237, 238, 239, 245, 247, 257, 258, 309, 310, 311, 312 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 27, 28, 30, 36, 38, 56, 57, 58, 59, 73, 
      76, 86, 87, 89, 95, 98, 104, 128, 170, 171, 175, 178, 183, 198, 202, 
      239, 245, 247, 258, 310, 312 ], [ 1, 2, 6, 17, 45, 55, 56, 89 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 24, 30, 38, 39, 45, 55, 56, 57, 59, 84, 
      86, 89, 96, 104, 126, 128, 131, 133, 137, 181, 183, 202, 245 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 30, 38, 57, 59 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 30, 36, 38, 57, 58, 59, 86 ], 
  [ 1, 2, 6, 17, 45, 52, 55, 56, 84, 89 ], [ 1, 2, 6, 56 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 38, 39, 40, 43, 44, 45, 49, 51, 55, 56, 57, 59, 64, 
      67, 69, 74, 76, 84, 85, 86, 89, 91, 95, 96, 97, 98, 99, 100, 104, 109, 
      110, 111, 112, 113, 114, 115, 126, 128, 129, 130, 131, 133, 134, 137, 
      138, 139, 143, 146, 147, 148, 150, 151, 155, 162, 163, 166, 170, 172, 
      173, 174, 175, 176, 178, 181, 182, 183, 185, 202, 208, 213, 245, 252, 
      254, 255, 257, 258, 265, 272, 278, 280, 281, 283, 289, 290, 309, 310, 
      313, 324 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 27, 28, 30, 38, 51, 56, 57, 59, 74, 76, 86, 
      89, 95, 98, 100, 104, 128, 170, 174, 175, 176, 178, 182, 183, 202, 245, 
      257, 258, 309, 310 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 38, 39, 43, 45, 52, 55, 56, 57, 59, 70, 76, 84, 85, 86, 88, 89, 
      95, 96, 97, 98, 101, 104, 126, 127, 128, 129, 130, 131, 133, 137, 143, 
      149, 152, 164, 170, 173, 175, 178, 181, 183, 201, 202, 244, 245, 256, 
      258, 278, 291, 310 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 38, 39, 43, 45, 51, 52, 53, 54, 55, 56, 57, 59, 69, 70, 71, 72, 
      74, 75, 76, 84, 85, 86, 88, 89, 91, 92, 94, 95, 96, 97, 98, 100, 101, 
      102, 103, 104, 126, 127, 128, 129, 130, 131, 133, 134, 135, 137, 139, 
      140, 143, 148, 149, 151, 152, 153, 154, 155, 156, 163, 164, 166, 167, 
      170, 173, 174, 175, 176, 177, 178, 181, 182, 183, 185, 186, 201, 202, 
      208, 209, 213, 214, 222, 236, 244, 245, 251, 252, 253, 255, 256, 257, 
      258, 262, 278, 280, 281, 282, 283, 290, 291, 297, 301, 306, 309, 310, 
      313, 320, 324, 327 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 27, 28, 30, 38, 51, 54, 56, 57, 59, 74, 75, 
      76, 86, 89, 91, 95, 98, 100, 103, 104, 128, 170, 174, 175, 176, 177, 
      178, 182, 183, 202, 245, 257, 258, 309, 310 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 27, 28, 30, 38, 56, 57, 59, 76, 86, 89, 98, 
      104, 128, 170, 175, 178, 183, 202, 245, 258, 310 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 38, 39, 45, 55, 56, 59, 84, 89, 104, 126, 
      128, 133, 137, 202 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 27, 38, 39, 45, 55, 56, 59, 84, 89, 
      96, 98, 104, 126, 128, 129, 133, 137, 173, 175, 202, 258 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 38, 59 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 38, 39, 44, 45, 49, 51, 55, 56, 59, 
      84, 89, 96, 100, 104, 109, 126, 128, 133, 134, 137, 138, 139, 202, 213, 
      252 ], [ 1, 2, 6, 8, 13, 15, 16, 38, 51, 56, 59, 89, 104, 128, 202 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 38, 39, 45, 52, 55, 56, 59, 84, 88, 89, 
      96, 104, 126, 127, 128, 133, 137, 201, 202 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 27, 38, 39, 45, 51, 52, 53, 54, 55, 
      56, 59, 84, 88, 89, 96, 97, 98, 100, 101, 103, 104, 126, 127, 128, 129, 
      133, 134, 135, 137, 139, 140, 148, 149, 173, 174, 175, 201, 202, 213, 
      214, 222, 252, 253, 255, 256, 257, 258, 262, 280, 297, 313, 320 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 38, 51, 54, 56, 59, 89, 98, 100, 104, 128, 
      174, 175, 202, 257, 258 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 38, 56, 59, 89, 128, 202 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 
      39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 
      57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 
      75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 
      93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 106, 107, 108, 
      109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 
      123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 
      137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 
      151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 
      165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 
      179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 
      193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 
      207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 
      221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 
      235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 
      249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 
      263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 
      277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 
      291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 
      305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 
      319, 320, 321, 322, 323, 324, 325, 326, 327, 328 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 
      24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 36, 37, 38, 39, 40, 43, 44, 45, 
      46, 49, 50, 51, 52, 55, 56, 57, 58, 59, 60, 61, 63, 64, 66, 67, 68, 69, 
      70, 73, 74, 76, 77, 78, 79, 80, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 
      95, 96, 97, 98, 99, 100, 101, 104, 109, 110, 111, 112, 113, 114, 115, 
      116, 117, 126, 127, 128, 129, 130, 131, 132, 133, 134, 136, 137, 138, 
      139, 141, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 155, 157, 
      158, 162, 163, 164, 165, 166, 168, 169, 170, 171, 172, 173, 174, 175, 
      176, 178, 179, 181, 182, 183, 184, 185, 187, 190, 193, 194, 195, 198, 
      199, 201, 202, 203, 208, 210, 213, 215, 218, 221, 222, 223, 227, 228, 
      233, 236, 237, 239, 240, 242, 243, 244, 245, 246, 247, 248, 251, 252, 
      254, 255, 256, 257, 258, 259, 262, 263, 265, 266, 267, 268, 271, 272, 
      273, 275, 278, 279, 280, 281, 283, 284, 286, 289, 290, 291, 292, 293, 
      294, 295, 296, 297, 298, 301, 302, 305, 306, 307, 309, 310, 311, 312, 
      313, 315, 317, 318, 319, 320, 322, 323, 324, 325, 326, 327, 328 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 
      24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 36, 37, 38, 39, 40, 43, 44, 45, 
      46, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 63, 64, 66, 67, 
      68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 
      86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 
      103, 104, 106, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 
      119, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 
      139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 
      153, 154, 155, 156, 157, 158, 159, 160, 162, 163, 164, 165, 166, 167, 
      168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 
      182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 
      196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 208, 209, 210, 211, 
      212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 
      226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 
      240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 
      254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 
      268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 
      282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 
      296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 
      310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 
      324, 325, 326, 327, 328 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 
      24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 36, 37, 38, 39, 40, 43, 44, 45, 
      46, 49, 50, 51, 54, 55, 56, 57, 58, 59, 60, 61, 63, 64, 66, 67, 68, 69, 
      72, 73, 74, 75, 76, 77, 78, 79, 82, 83, 84, 85, 86, 87, 89, 90, 91, 94, 
      95, 96, 97, 98, 99, 100, 103, 104, 109, 110, 111, 112, 113, 114, 115, 
      116, 119, 126, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 
      139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 150, 151, 154, 155, 
      156, 157, 160, 162, 163, 165, 166, 167, 168, 169, 170, 171, 172, 173, 
      174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 189, 
      192, 193, 194, 197, 198, 199, 200, 202, 205, 208, 209, 212, 213, 214, 
      217, 220, 225, 226, 227, 230, 231, 232, 235, 237, 238, 239, 240, 241, 
      243, 245, 247, 250, 252, 253, 254, 255, 257, 258, 261, 263, 264, 265, 
      266, 270, 272, 273, 274, 277, 278, 279, 280, 281, 282, 283, 284, 285, 
      286, 287, 288, 289, 290, 293, 300, 304, 307, 308, 309, 310, 311, 312, 
      313, 314, 315, 316, 321, 324, 325 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 38, 39, 44, 45, 51, 55, 56, 59, 84, 
      89, 96, 100, 104, 126, 128, 133, 134, 137, 138, 139, 202, 213, 252 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 27, 38, 39, 44, 45, 51, 55, 56, 
      59, 84, 89, 96, 97, 98, 100, 104, 109, 113, 126, 128, 129, 133, 134, 
      137, 138, 139, 146, 148, 172, 173, 174, 175, 202, 213, 252, 255, 257, 
      258, 280, 313 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 20, 28, 38, 39, 44, 45, 51, 55, 56, 
      59, 84, 89, 96, 100, 104, 109, 114, 126, 128, 130, 133, 134, 137, 138, 
      139, 151, 176, 178, 202, 213, 252, 281 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 24, 30, 38, 39, 44, 45, 51, 55, 56, 
      57, 59, 84, 85, 86, 89, 96, 100, 104, 109, 115, 126, 128, 131, 133, 
      134, 137, 138, 139, 163, 181, 182, 183, 202, 213, 245, 252, 283 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 27, 38, 39, 44, 45, 51, 55, 56, 59, 89, 
      98, 100, 104, 128, 129, 133, 134, 172, 173, 174, 175, 202, 213, 257, 
      258, 280, 313 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 28, 38, 39, 44, 45, 51, 55, 56, 59, 89, 
      100, 104, 128, 130, 133, 134, 176, 178, 202, 213, 281 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 30, 38, 39, 44, 45, 51, 55, 56, 57, 59, 
      86, 89, 100, 104, 128, 131, 133, 134, 181, 182, 183, 202, 213, 245, 283 
     ], [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 30, 36, 38, 39, 44, 45, 51, 55, 56, 
      57, 58, 59, 86, 87, 89, 100, 104, 115, 128, 131, 132, 133, 134, 181, 
      182, 183, 193, 194, 198, 202, 213, 245, 247, 283, 284 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 38, 39, 44, 45, 51, 52, 55, 56, 59, 
      84, 88, 89, 96, 100, 101, 104, 109, 126, 127, 128, 133, 134, 137, 138, 
      139, 201, 202, 210, 213, 222, 252, 262 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 27, 38, 39, 44, 45, 51, 52, 53, 
      54, 55, 56, 59, 84, 88, 89, 96, 97, 98, 100, 101, 102, 103, 104, 109, 
      110, 113, 117, 119, 126, 127, 128, 129, 133, 134, 135, 137, 138, 139, 
      140, 146, 148, 149, 172, 173, 174, 175, 201, 202, 210, 211, 212, 213, 
      214, 222, 252, 253, 255, 256, 257, 258, 262, 264, 267, 280, 288, 295, 
      297, 313, 320 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 27, 38, 39, 44, 45, 51, 54, 55, 56, 59, 
      89, 98, 100, 103, 104, 113, 128, 129, 133, 134, 135, 172, 173, 174, 
      175, 202, 212, 213, 214, 257, 258, 280, 313 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 19, 20, 21, 22, 23, 
      24, 25, 26, 27, 28, 29, 30, 31, 32, 36, 38, 39, 40, 41, 42, 43, 44, 45, 
      49, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 63, 64, 65, 67, 69, 70, 71, 
      72, 73, 74, 75, 76, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 
      97, 98, 99, 100, 101, 102, 103, 104, 109, 110, 111, 112, 113, 114, 115, 
      116, 117, 118, 119, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 
      131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 143, 144, 145, 146, 
      147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 
      161, 162, 163, 164, 165, 166, 167, 168, 170, 171, 172, 173, 174, 175, 
      176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 
      193, 194, 195, 196, 197, 198, 201, 202, 203, 204, 205, 206, 207, 208, 
      209, 210, 211, 212, 213, 214, 218, 219, 220, 222, 223, 224, 225, 227, 
      228, 229, 230, 231, 233, 234, 235, 236, 237, 238, 239, 243, 244, 245, 
      246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 
      260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 
      274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 
      288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 
      302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 
      316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 19, 20, 21, 22, 23, 
      24, 25, 26, 27, 28, 29, 30, 31, 36, 38, 39, 40, 41, 42, 43, 44, 45, 51, 
      52, 53, 54, 55, 56, 57, 58, 59, 63, 64, 65, 69, 70, 71, 72, 73, 74, 75, 
      76, 84, 85, 86, 87, 88, 89, 91, 92, 93, 94, 95, 96, 97, 98, 100, 101, 
      102, 103, 104, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 
      124, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 
      139, 140, 143, 145, 146, 148, 149, 151, 152, 153, 154, 155, 156, 157, 
      158, 159, 160, 161, 163, 164, 165, 166, 167, 168, 170, 171, 172, 173, 
      174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 193, 
      194, 195, 196, 197, 198, 201, 202, 203, 204, 205, 208, 209, 210, 211, 
      212, 213, 214, 222, 227, 228, 229, 230, 231, 236, 237, 238, 239, 243, 
      244, 245, 246, 247, 251, 252, 253, 255, 256, 257, 258, 262, 263, 264, 
      265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 
      279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 290, 291, 293, 294, 
      295, 297, 301, 302, 303, 304, 306, 307, 308, 309, 310, 311, 312, 313, 
      314, 315, 316, 317, 318, 320, 321, 322, 323, 324, 325, 327, 328 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 19, 20, 21, 22, 23, 
      24, 25, 26, 27, 28, 29, 30, 31, 38, 39, 40, 41, 42, 43, 44, 45, 49, 51, 
      52, 53, 54, 55, 56, 57, 59, 64, 65, 67, 69, 70, 71, 72, 74, 75, 76, 84, 
      85, 86, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 
      103, 104, 109, 110, 111, 112, 113, 114, 115, 117, 118, 119, 125, 126, 
      127, 128, 129, 130, 131, 133, 134, 135, 137, 138, 139, 140, 143, 146, 
      147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 158, 159, 160, 162, 
      163, 164, 166, 167, 170, 172, 173, 174, 175, 176, 177, 178, 180, 181, 
      182, 183, 185, 186, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 
      211, 212, 213, 214, 218, 219, 220, 222, 231, 233, 234, 235, 236, 244, 
      245, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 
      261, 262, 264, 265, 267, 268, 269, 270, 271, 272, 274, 278, 280, 281, 
      282, 283, 288, 289, 290, 291, 295, 296, 297, 298, 299, 300, 301, 305, 
      306, 309, 310, 313, 319, 320, 322, 324, 326, 327 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 12, 13, 14, 15, 16, 17, 19, 20, 21, 22, 23, 24, 
      25, 26, 27, 28, 29, 30, 31, 32, 36, 38, 39, 40, 42, 43, 44, 45, 49, 51, 
      54, 55, 56, 57, 58, 59, 60, 63, 64, 65, 67, 69, 72, 73, 74, 75, 76, 84, 
      85, 86, 87, 89, 90, 91, 94, 95, 96, 97, 98, 99, 100, 103, 104, 109, 
      110, 111, 112, 113, 114, 115, 116, 119, 124, 125, 126, 128, 129, 130, 
      131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 143, 144, 145, 146, 
      147, 148, 150, 151, 154, 155, 156, 157, 160, 161, 162, 163, 165, 166, 
      167, 168, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 
      182, 183, 184, 185, 186, 189, 193, 194, 197, 198, 202, 205, 207, 208, 
      209, 212, 213, 214, 220, 225, 227, 230, 231, 235, 237, 238, 239, 243, 
      245, 247, 250, 252, 253, 254, 255, 257, 258, 261, 263, 264, 265, 266, 
      270, 272, 273, 274, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 
      287, 288, 289, 290, 293, 300, 304, 307, 308, 309, 310, 311, 312, 313, 
      314, 315, 316, 321, 324, 325 ], 
  [ 1, 2, 4, 6, 7, 8, 10, 12, 13, 14, 15, 16, 27, 28, 29, 30, 31, 36, 38, 39, 
      40, 42, 43, 44, 45, 51, 54, 55, 56, 57, 58, 59, 73, 74, 75, 76, 86, 87, 
      89, 91, 94, 95, 98, 100, 103, 104, 113, 114, 115, 116, 119, 128, 129, 
      130, 131, 132, 133, 134, 135, 170, 171, 172, 173, 174, 175, 176, 177, 
      178, 179, 180, 181, 182, 183, 184, 185, 186, 193, 194, 197, 198, 202, 
      205, 208, 209, 212, 213, 214, 237, 238, 239, 245, 247, 257, 258, 272, 
      273, 274, 277, 278, 279, 280, 281, 282, 283, 284, 285, 309, 310, 311, 
      312, 313, 314, 315, 316, 324, 325 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 12, 13, 14, 15, 16, 17, 19, 20, 21, 22, 23, 24, 
      25, 26, 27, 28, 29, 30, 31, 38, 39, 40, 42, 43, 44, 45, 49, 51, 54, 55, 
      56, 57, 59, 64, 65, 67, 69, 72, 74, 75, 76, 84, 85, 86, 89, 90, 91, 94, 
      95, 96, 97, 98, 99, 100, 103, 104, 109, 110, 111, 112, 113, 114, 115, 
      119, 126, 128, 129, 130, 131, 133, 134, 135, 137, 138, 139, 140, 143, 
      146, 147, 148, 150, 151, 154, 155, 156, 160, 162, 163, 166, 167, 170, 
      172, 173, 174, 175, 176, 177, 178, 180, 181, 182, 183, 185, 186, 202, 
      205, 207, 208, 209, 212, 213, 214, 220, 231, 235, 245, 250, 252, 253, 
      254, 255, 257, 258, 261, 264, 265, 270, 272, 274, 278, 280, 281, 282, 
      283, 288, 289, 290, 300, 309, 310, 313, 324 ], 
  [ 1, 2, 13, 14, 15, 16, 17, 55, 56, 128 ], 
  [ 1, 2, 13, 14, 15, 16, 17, 52, 55, 56, 126, 128 ], 
  [ 1, 2, 13, 15, 16, 56 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 27, 38, 39, 45, 55, 56, 59, 89, 98, 104, 128, 
      133, 173, 175, 202, 258 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 28, 38, 39, 45, 55, 56, 59, 89, 104, 128, 
      133, 178, 202 ], 
  [ 1, 2, 13, 14, 15, 16, 30, 38, 55, 56, 57, 59, 128, 133, 183, 202 ], 
  [ 1, 2, 13, 14, 15, 16, 30, 36, 38, 55, 56, 57, 58, 59, 128, 131, 133, 183, 
      198, 202 ], [ 1, 2, 13, 14, 15, 16, 38, 55, 56, 59, 128, 202 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 38, 39, 45, 51, 55, 56, 59, 89, 100, 104, 
      128, 133, 202, 213 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 27, 38, 39, 45, 51, 54, 55, 56, 59, 89, 98, 
      100, 103, 104, 128, 129, 133, 134, 173, 174, 175, 202, 213, 214, 257, 
      258, 280, 313 ], 
  [ 1, 2, 13, 14, 15, 16, 17, 24, 30, 36, 38, 55, 56, 57, 58, 59, 126, 128, 
      131, 132, 133, 137, 183, 198, 202 ], 
  [ 1, 2, 13, 14, 15, 16, 17, 38, 55, 56, 59, 126, 128, 133, 202 ], 
  [ 1, 2, 6, 17, 44, 45, 51, 55, 56, 84, 89, 139, 213 ], 
  [ 1, 2, 6, 17, 45, 51, 55, 56, 84, 89, 213 ], 
  [ 1, 2, 6, 17, 19, 27, 45, 51, 54, 55, 56, 84, 89, 139, 148, 173, 174, 175, 
      213, 214, 313 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 
      27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 51, 55, 56, 57, 58, 59, 63, 69, 
      73, 74, 76, 77, 78, 79, 83, 84, 85, 86, 87, 89, 91, 95, 96, 97, 98, 
      100, 104, 126, 128, 129, 130, 131, 132, 133, 134, 136, 137, 139, 143, 
      145, 148, 151, 155, 163, 165, 166, 168, 170, 171, 173, 174, 175, 176, 
      178, 181, 182, 183, 184, 185, 193, 194, 198, 199, 202, 208, 213, 227, 
      237, 239, 240, 243, 245, 247, 252, 255, 257, 258, 278, 279, 280, 281, 
      283, 284, 286, 290, 293, 307, 309, 310, 311, 312, 313, 315, 324, 325 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 
      27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 51, 54, 55, 56, 57, 58, 59, 63, 
      69, 72, 73, 74, 75, 76, 77, 78, 79, 82, 83, 84, 85, 86, 87, 89, 91, 94, 
      95, 96, 97, 98, 100, 103, 104, 126, 128, 129, 130, 131, 132, 133, 134, 
      135, 136, 137, 139, 140, 141, 143, 145, 148, 151, 154, 155, 156, 163, 
      165, 166, 167, 168, 170, 171, 173, 174, 175, 176, 177, 178, 181, 182, 
      183, 184, 185, 186, 193, 194, 197, 198, 199, 200, 202, 208, 209, 213, 
      214, 227, 230, 237, 238, 239, 240, 241, 243, 245, 247, 252, 253, 255, 
      257, 258, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 290, 293, 
      307, 308, 309, 310, 311, 312, 313, 315, 316, 324, 325 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 45, 55, 
      56, 57, 59, 84, 85, 86, 89, 96, 97, 98, 104, 126, 128, 129, 130, 131, 
      133, 137, 170, 173, 175, 178, 181, 183, 202, 245, 258, 278, 310 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 32, 36, 38, 
      39, 44, 45, 49, 51, 55, 56, 57, 58, 59, 84, 85, 86, 87, 89, 96, 97, 98, 
      99, 100, 104, 109, 110, 111, 112, 113, 114, 115, 116, 126, 128, 129, 
      130, 131, 132, 133, 134, 136, 137, 138, 139, 143, 145, 146, 147, 148, 
      150, 151, 162, 163, 170, 171, 172, 173, 174, 175, 176, 178, 181, 182, 
      183, 193, 194, 198, 202, 213, 243, 245, 247, 252, 254, 255, 257, 258, 
      263, 265, 266, 272, 273, 278, 279, 280, 281, 283, 284, 286, 289, 290, 
      293, 309, 310, 311, 312, 313, 324, 325 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 36, 38, 39, 45, 
      55, 56, 57, 58, 59, 84, 85, 86, 87, 89, 96, 97, 98, 104, 126, 128, 129, 
      130, 131, 132, 133, 136, 137, 143, 170, 171, 173, 175, 178, 181, 183, 
      193, 198, 202, 243, 245, 247, 258, 278, 279, 310, 312 ], 
  [ 1, 2, 6, 17, 19, 27, 44, 45, 51, 55, 56, 84, 89, 138, 139, 148, 172, 173, 
      174, 175, 213, 313 ], 
  [ 1, 2, 6, 17, 19, 27, 44, 45, 49, 51, 55, 56, 84, 89, 138, 139, 146, 148, 
      172, 173, 174, 175, 213, 313 ], 
  [ 1, 2, 6, 17, 19, 27, 45, 51, 55, 56, 84, 89, 139, 173, 174, 175, 213, 313 
     ], [ 1, 2, 6, 17, 19, 27, 45, 52, 55, 56, 84, 88, 89, 173, 175 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 20, 28, 38, 39, 44, 45, 49, 51, 55, 
      56, 59, 84, 89, 96, 99, 100, 104, 109, 111, 114, 126, 128, 130, 133, 
      134, 137, 138, 139, 151, 176, 178, 202, 213, 252, 281 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 20, 28, 38, 39, 45, 51, 55, 56, 59, 84, 
      89, 96, 100, 104, 126, 128, 130, 133, 134, 137, 139, 176, 178, 202, 
      213, 252, 281 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 20, 28, 38, 39, 45, 52, 55, 56, 59, 84, 
      88, 89, 96, 101, 104, 126, 127, 128, 130, 133, 137, 178, 201, 202 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 45, 51, 
      52, 53, 54, 55, 56, 57, 59, 84, 85, 86, 88, 89, 96, 97, 98, 100, 101, 
      102, 103, 104, 126, 127, 128, 129, 130, 131, 133, 134, 135, 137, 139, 
      140, 143, 148, 149, 151, 152, 154, 163, 164, 170, 173, 174, 175, 176, 
      177, 178, 181, 182, 183, 201, 202, 213, 214, 222, 244, 245, 252, 253, 
      255, 256, 257, 258, 262, 278, 280, 281, 282, 283, 290, 291, 297, 301, 
      306, 309, 310, 313, 320, 324, 327 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 45, 51, 
      54, 55, 56, 57, 59, 84, 85, 86, 89, 96, 97, 98, 100, 103, 104, 126, 
      128, 129, 130, 131, 133, 134, 135, 137, 139, 140, 143, 148, 151, 163, 
      170, 173, 174, 175, 176, 177, 178, 181, 182, 183, 202, 213, 214, 245, 
      252, 253, 255, 257, 258, 278, 280, 281, 282, 283, 290, 309, 310, 313, 
      324 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 38, 39, 43, 45, 51, 55, 56, 57, 59, 69, 74, 76, 84, 85, 86, 89, 
      91, 95, 96, 97, 98, 100, 104, 126, 128, 129, 130, 131, 133, 134, 137, 
      139, 143, 148, 151, 163, 166, 170, 173, 174, 175, 176, 178, 181, 182, 
      183, 185, 202, 208, 213, 245, 252, 255, 257, 258, 278, 280, 281, 283, 
      290, 309, 310, 313, 324 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 38, 39, 43, 45, 51, 54, 55, 56, 57, 59, 69, 72, 74, 75, 76, 84, 
      85, 86, 89, 91, 94, 95, 96, 97, 98, 100, 103, 104, 126, 128, 129, 130, 
      131, 133, 134, 135, 137, 139, 140, 143, 148, 151, 154, 155, 163, 166, 
      167, 170, 173, 174, 175, 176, 177, 178, 181, 182, 183, 185, 186, 202, 
      208, 209, 213, 214, 245, 252, 253, 255, 257, 258, 278, 280, 281, 282, 
      283, 290, 309, 310, 313, 324 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 36, 38, 39, 40, 43, 44, 45, 51, 55, 56, 57, 58, 59, 
      63, 64, 69, 73, 74, 76, 84, 85, 86, 87, 89, 91, 95, 96, 97, 98, 100, 
      104, 109, 110, 111, 112, 113, 114, 115, 116, 126, 128, 129, 130, 131, 
      132, 133, 134, 136, 137, 138, 139, 143, 145, 146, 148, 151, 155, 163, 
      165, 166, 168, 170, 171, 172, 173, 174, 175, 176, 178, 179, 181, 182, 
      183, 184, 185, 193, 194, 198, 202, 208, 213, 227, 237, 239, 243, 245, 
      247, 252, 255, 257, 258, 263, 265, 266, 272, 273, 278, 279, 280, 281, 
      283, 284, 286, 290, 293, 307, 309, 310, 311, 312, 313, 315, 324, 325 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 38, 39, 40, 43, 44, 45, 51, 52, 55, 56, 57, 59, 64, 
      69, 70, 74, 76, 84, 85, 86, 88, 89, 91, 92, 95, 96, 97, 98, 100, 101, 
      104, 109, 110, 111, 112, 113, 114, 115, 117, 126, 127, 128, 129, 130, 
      131, 133, 134, 137, 138, 139, 143, 146, 148, 149, 151, 152, 155, 163, 
      164, 166, 170, 172, 173, 174, 175, 176, 178, 181, 182, 183, 185, 201, 
      202, 203, 208, 210, 213, 222, 236, 244, 245, 251, 252, 255, 256, 257, 
      258, 262, 265, 267, 268, 271, 272, 278, 280, 281, 283, 290, 291, 295, 
      297, 301, 306, 309, 310, 313, 320, 322, 324, 327 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 38, 39, 40, 43, 44, 45, 51, 52, 53, 54, 55, 56, 57, 
      59, 64, 69, 70, 71, 72, 74, 75, 76, 84, 85, 86, 88, 89, 91, 92, 93, 94, 
      95, 96, 97, 98, 100, 101, 102, 103, 104, 109, 110, 111, 112, 113, 114, 
      115, 117, 118, 119, 126, 127, 128, 129, 130, 131, 133, 134, 135, 137, 
      138, 139, 140, 143, 146, 148, 149, 151, 152, 153, 154, 155, 156, 158, 
      160, 163, 164, 166, 167, 170, 172, 173, 174, 175, 176, 177, 178, 180, 
      181, 182, 183, 185, 186, 201, 202, 203, 204, 205, 208, 209, 210, 211, 
      212, 213, 214, 222, 231, 236, 244, 245, 251, 252, 253, 255, 256, 257, 
      258, 262, 264, 265, 267, 268, 269, 270, 271, 272, 274, 278, 280, 281, 
      282, 283, 288, 290, 291, 295, 297, 301, 306, 309, 310, 313, 320, 322, 
      324, 327 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 38, 39, 40, 43, 44, 45, 51, 54, 55, 56, 57, 59, 64, 
      69, 72, 74, 75, 76, 84, 85, 86, 89, 91, 94, 95, 96, 97, 98, 100, 103, 
      104, 109, 110, 111, 112, 113, 114, 115, 119, 126, 128, 129, 130, 131, 
      133, 134, 135, 137, 138, 139, 140, 143, 146, 148, 151, 154, 155, 156, 
      163, 166, 167, 170, 172, 173, 174, 175, 176, 177, 178, 180, 181, 182, 
      183, 185, 186, 202, 205, 208, 209, 212, 213, 214, 231, 245, 252, 253, 
      255, 257, 258, 264, 265, 270, 272, 274, 278, 280, 281, 282, 283, 288, 
      290, 309, 310, 313, 324 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 12, 13, 14, 15, 16, 17, 19, 20, 21, 22, 23, 24, 
      25, 26, 27, 28, 29, 30, 31, 36, 38, 39, 40, 42, 43, 44, 45, 51, 54, 55, 
      56, 57, 58, 59, 63, 64, 65, 69, 72, 73, 74, 75, 76, 84, 85, 86, 87, 89, 
      91, 94, 95, 96, 97, 98, 100, 103, 104, 109, 110, 111, 112, 113, 114, 
      115, 116, 119, 124, 126, 128, 129, 130, 131, 132, 133, 134, 135, 136, 
      137, 138, 139, 140, 143, 145, 146, 148, 151, 154, 155, 156, 157, 160, 
      163, 165, 166, 167, 168, 170, 171, 172, 173, 174, 175, 176, 177, 178, 
      179, 180, 181, 182, 183, 184, 185, 186, 193, 194, 197, 198, 202, 205, 
      208, 209, 212, 213, 214, 227, 230, 231, 237, 238, 239, 243, 245, 247, 
      252, 253, 255, 257, 258, 263, 264, 265, 266, 270, 272, 273, 274, 277, 
      278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 290, 293, 304, 
      307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 321, 324, 325 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 24, 30, 38, 39, 44, 45, 49, 51, 55, 
      56, 57, 59, 84, 85, 86, 89, 96, 99, 100, 104, 109, 112, 115, 126, 128, 
      131, 133, 134, 137, 138, 139, 163, 181, 182, 183, 202, 213, 245, 252, 
      283 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 24, 30, 38, 39, 45, 51, 55, 56, 57, 59, 
      84, 85, 86, 89, 96, 100, 104, 126, 128, 131, 133, 134, 137, 139, 181, 
      182, 183, 202, 213, 245, 252, 283 ], 
  [ 1, 2, 13, 14, 15, 16, 17, 24, 30, 38, 52, 55, 56, 57, 59, 126, 127, 128, 
      131, 133, 137, 183, 201, 202 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 25, 27, 28, 30, 36, 38, 57, 58, 59, 73, 86, 
      87, 98, 170, 171 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 38, 51, 56, 57, 59, 74, 
      76, 86, 89, 91, 95, 98, 100, 104, 128, 170, 174, 175, 176, 178, 182, 
      183, 202, 245, 257, 258, 309, 310 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 38, 51, 54, 56, 57, 59, 
      74, 75, 76, 86, 89, 91, 94, 95, 98, 100, 103, 104, 128, 166, 170, 174, 
      175, 176, 177, 178, 182, 183, 202, 245, 257, 258, 309, 310 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 36, 38, 56, 57, 58, 59, 
      73, 76, 86, 87, 89, 95, 98, 104, 128, 165, 170, 171, 175, 178, 183, 
      198, 202, 239, 245, 247, 258, 310, 312 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 36, 38, 46, 56, 57, 
      58, 59, 73, 76, 77, 78, 83, 86, 87, 89, 95, 98, 104, 128, 165, 168, 
      170, 171, 175, 178, 183, 198, 202, 239, 245, 247, 258, 310, 312 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 28, 30, 38, 57, 59, 86, 98 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 28, 30, 36, 38, 57, 58, 59, 86, 87, 98, 170 ],
  [ 1, 2, 6, 27, 44, 45, 51, 55, 56, 89, 173, 174, 175, 213, 313 ], 
  [ 1, 2, 6, 27, 45, 55, 56, 89, 175 ], [ 1, 2, 6, 27, 51, 56, 89, 175 ], 
  [ 1, 2, 6, 27, 56, 89 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 28, 38, 51, 56, 59, 89, 100, 104, 128, 178, 202 ],
  [ 1, 2, 6, 8, 13, 15, 16, 27, 28, 30, 38, 51, 54, 56, 57, 59, 86, 89, 98, 
      100, 103, 104, 128, 170, 174, 175, 176, 178, 182, 183, 202, 245, 257, 
      258, 309, 310 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 28, 38, 56, 59, 89, 104, 128, 202 ], 
  [ 1, 2, 4, 6, 7, 8, 10, 13, 14, 15, 16, 27, 28, 29, 30, 31, 36, 38, 39, 40, 
      43, 44, 45, 51, 55, 56, 57, 58, 59, 73, 74, 76, 86, 87, 89, 91, 95, 98, 
      100, 104, 113, 114, 115, 116, 128, 129, 130, 131, 132, 133, 134, 170, 
      171, 172, 173, 174, 175, 176, 178, 181, 182, 183, 184, 185, 193, 194, 
      198, 202, 208, 213, 237, 239, 245, 247, 257, 258, 272, 273, 278, 279, 
      280, 281, 283, 284, 309, 310, 311, 312, 313, 315, 324, 325 ], 
  [ 1, 2, 4, 6, 7, 8, 10, 13, 14, 15, 16, 27, 28, 29, 30, 31, 38, 39, 40, 43, 
      44, 45, 51, 54, 55, 56, 57, 59, 74, 75, 76, 86, 89, 91, 94, 95, 98, 
      100, 103, 104, 113, 114, 115, 119, 128, 129, 130, 131, 133, 134, 135, 
      170, 172, 173, 174, 175, 176, 177, 178, 181, 182, 183, 185, 186, 202, 
      205, 208, 209, 212, 213, 214, 245, 257, 258, 272, 274, 278, 280, 281, 
      282, 283, 309, 310, 313, 324 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 30, 38, 39, 45, 55, 56, 57, 59, 86, 89, 104, 
      128, 131, 133, 183, 202, 245 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 30, 38, 51, 56, 57, 59, 86, 89, 100, 104, 128, 
      183, 202, 245 ], [ 1, 2, 13, 15, 16, 30, 38, 56, 57, 59, 128, 202 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 14, 15, 16, 27, 28, 30, 31, 36, 38, 39, 43, 45, 55, 
      56, 57, 58, 59, 73, 76, 86, 87, 89, 95, 98, 104, 128, 129, 130, 131, 
      132, 133, 170, 171, 173, 175, 178, 181, 183, 193, 198, 202, 239, 245, 
      247, 258, 278, 279, 310, 312 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 14, 15, 16, 27, 28, 30, 31, 38, 39, 43, 45, 51, 55, 
      56, 57, 59, 74, 76, 86, 89, 91, 95, 98, 100, 104, 128, 129, 130, 131, 
      133, 134, 170, 173, 174, 175, 176, 178, 181, 182, 183, 202, 208, 213, 
      245, 257, 258, 278, 280, 281, 283, 309, 310, 313, 324 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 14, 15, 16, 27, 28, 30, 31, 38, 39, 43, 45, 51, 54, 
      55, 56, 57, 59, 74, 75, 76, 86, 89, 91, 94, 95, 98, 100, 103, 104, 128, 
      129, 130, 131, 133, 134, 135, 170, 173, 174, 175, 176, 177, 178, 181, 
      182, 183, 185, 202, 208, 209, 213, 214, 245, 257, 258, 278, 280, 281, 
      282, 283, 309, 310, 313, 324 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 24, 30, 32, 36, 38, 39, 44, 45, 49, 
      51, 52, 55, 56, 57, 58, 59, 84, 85, 86, 87, 88, 89, 96, 99, 100, 101, 
      104, 109, 112, 115, 116, 117, 126, 127, 128, 131, 132, 133, 134, 136, 
      137, 138, 139, 162, 163, 164, 181, 182, 183, 193, 194, 195, 198, 201, 
      202, 210, 213, 218, 222, 243, 244, 245, 246, 247, 252, 259, 262, 263, 
      271, 275, 283, 284, 286, 305, 306, 317 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 32, 36, 38, 
      39, 44, 45, 49, 51, 52, 53, 54, 55, 56, 57, 58, 59, 84, 85, 86, 87, 88, 
      89, 96, 97, 98, 99, 100, 101, 102, 103, 104, 109, 110, 111, 112, 113, 
      114, 115, 116, 117, 118, 119, 126, 127, 128, 129, 130, 131, 132, 133, 
      134, 135, 136, 137, 138, 139, 140, 143, 144, 145, 146, 147, 148, 149, 
      150, 151, 152, 153, 154, 162, 163, 164, 170, 171, 172, 173, 174, 175, 
      176, 177, 178, 181, 182, 183, 187, 189, 193, 194, 195, 196, 197, 198, 
      201, 202, 210, 211, 212, 213, 214, 218, 219, 220, 222, 243, 244, 245, 
      246, 247, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 
      264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 
      278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 
      292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 305, 306, 309, 310, 
      311, 312, 313, 317, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 32, 36, 38, 
      39, 44, 45, 49, 51, 54, 55, 56, 57, 58, 59, 84, 85, 86, 87, 89, 96, 97, 
      98, 99, 100, 103, 104, 109, 110, 111, 112, 113, 114, 115, 116, 119, 
      126, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 
      143, 144, 145, 146, 147, 148, 150, 151, 154, 162, 163, 170, 171, 172, 
      173, 174, 175, 176, 177, 178, 181, 182, 183, 193, 194, 197, 198, 202, 
      212, 213, 214, 220, 243, 245, 247, 252, 253, 254, 255, 257, 258, 261, 
      263, 264, 265, 266, 270, 272, 273, 274, 277, 278, 279, 280, 281, 282, 
      283, 284, 285, 286, 287, 288, 289, 290, 293, 300, 309, 310, 311, 312, 
      313, 321, 324, 325 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 10, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24, 
      25, 26, 27, 28, 29, 30, 31, 33, 36, 37, 38, 39, 40, 43, 44, 45, 51, 52, 
      55, 56, 57, 58, 59, 61, 63, 64, 69, 70, 73, 74, 76, 77, 78, 79, 80, 83, 
      84, 85, 86, 87, 88, 89, 91, 92, 95, 96, 97, 98, 100, 101, 104, 109, 
      110, 111, 112, 113, 114, 115, 116, 117, 126, 127, 128, 129, 130, 131, 
      132, 133, 134, 136, 137, 138, 139, 141, 143, 145, 146, 148, 149, 151, 
      152, 155, 157, 158, 163, 164, 165, 166, 168, 170, 171, 172, 173, 174, 
      175, 176, 178, 179, 181, 182, 183, 184, 185, 193, 194, 195, 198, 199, 
      201, 202, 203, 208, 210, 213, 222, 227, 228, 236, 237, 239, 240, 242, 
      243, 244, 245, 246, 247, 251, 252, 255, 256, 257, 258, 262, 263, 265, 
      266, 267, 268, 271, 272, 273, 275, 278, 279, 280, 281, 283, 284, 286, 
      290, 291, 293, 294, 295, 297, 301, 302, 306, 307, 309, 310, 311, 312, 
      313, 315, 317, 318, 320, 322, 323, 324, 325, 327, 328 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 10, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24, 
      25, 26, 27, 28, 29, 30, 31, 33, 36, 37, 38, 39, 40, 43, 44, 45, 51, 52, 
      53, 54, 55, 56, 57, 58, 59, 61, 63, 64, 69, 70, 71, 72, 73, 74, 75, 76, 
      77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 91, 92, 93, 94, 95, 
      96, 97, 98, 100, 101, 102, 103, 104, 109, 110, 111, 112, 113, 114, 115, 
      116, 117, 118, 119, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 
      136, 137, 138, 139, 140, 141, 142, 143, 145, 146, 148, 149, 151, 152, 
      153, 154, 155, 156, 157, 158, 159, 160, 163, 164, 165, 166, 167, 168, 
      170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 
      184, 185, 186, 190, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 
      202, 203, 204, 205, 208, 209, 210, 211, 212, 213, 214, 222, 226, 227, 
      228, 229, 230, 231, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 
      246, 247, 251, 252, 253, 255, 256, 257, 258, 262, 263, 264, 265, 266, 
      267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 
      281, 282, 283, 284, 285, 286, 287, 288, 290, 291, 293, 294, 295, 297, 
      301, 302, 303, 304, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 
      316, 317, 318, 320, 321, 322, 323, 324, 325, 327, 328 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 10, 13, 14, 15, 16, 27, 28, 29, 30, 31, 33, 36, 37, 
      38, 39, 40, 43, 44, 45, 51, 54, 55, 56, 57, 58, 59, 73, 74, 75, 76, 79, 
      82, 83, 86, 87, 89, 91, 94, 95, 98, 100, 103, 104, 113, 114, 115, 116, 
      119, 128, 129, 130, 131, 132, 133, 134, 135, 170, 171, 172, 173, 174, 
      175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 193, 194, 
      197, 198, 199, 200, 202, 205, 208, 209, 212, 213, 214, 237, 238, 239, 
      245, 247, 257, 258, 272, 273, 274, 277, 278, 279, 280, 281, 282, 283, 
      284, 285, 309, 310, 311, 312, 313, 314, 315, 316, 324, 325 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 30, 36, 38, 39, 45, 55, 56, 57, 58, 59, 86, 
      87, 89, 104, 128, 131, 132, 133, 181, 183, 198, 202, 245, 247 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 30, 36, 38, 51, 56, 57, 58, 59, 86, 87, 89, 100, 
      104, 128, 182, 183, 198, 202, 245, 247 ], 
  [ 1, 2, 13, 14, 15, 16, 17, 24, 30, 36, 38, 52, 55, 56, 57, 58, 59, 126, 
      127, 128, 131, 132, 133, 136, 137, 164, 183, 198, 201, 202 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 36, 38, 39, 45, 
      51, 52, 53, 54, 55, 56, 57, 58, 59, 84, 85, 86, 87, 88, 89, 96, 97, 98, 
      100, 101, 102, 103, 104, 126, 127, 128, 129, 130, 131, 132, 133, 134, 
      135, 136, 137, 139, 140, 143, 145, 148, 149, 151, 152, 153, 154, 163, 
      164, 170, 171, 173, 174, 175, 176, 177, 178, 181, 182, 183, 193, 194, 
      195, 197, 198, 201, 202, 213, 214, 222, 243, 244, 245, 246, 247, 252, 
      253, 255, 256, 257, 258, 262, 278, 279, 280, 281, 282, 283, 284, 285, 
      286, 287, 290, 291, 293, 294, 297, 301, 306, 309, 310, 311, 312, 313, 
      317, 320, 324, 325, 327, 328 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 28, 30, 36, 38, 51, 54, 56, 57, 58, 59, 86, 
      87, 89, 98, 100, 103, 104, 128, 170, 171, 174, 175, 176, 177, 178, 182, 
      183, 194, 198, 202, 245, 247, 257, 258, 309, 310, 311, 312 ], 
  [ 1, 2, 13, 15, 16, 30, 36, 38, 56, 57, 58, 59, 128, 183, 202 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 14, 15, 16, 27, 28, 30, 31, 36, 37, 38, 39, 43, 
      45, 51, 55, 56, 57, 58, 59, 73, 74, 76, 79, 83, 86, 87, 89, 91, 95, 98, 
      100, 104, 128, 129, 130, 131, 132, 133, 134, 170, 171, 173, 174, 175, 
      176, 178, 181, 182, 183, 184, 185, 193, 194, 198, 202, 208, 213, 237, 
      239, 245, 247, 257, 258, 278, 279, 280, 281, 283, 284, 309, 310, 311, 
      312, 313, 315, 324, 325 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 14, 15, 16, 27, 28, 30, 31, 36, 37, 38, 39, 43, 
      45, 51, 54, 55, 56, 57, 58, 59, 73, 74, 75, 76, 79, 82, 83, 86, 87, 89, 
      91, 94, 95, 98, 100, 103, 104, 128, 129, 130, 131, 132, 133, 134, 135, 
      170, 171, 173, 174, 175, 176, 177, 178, 181, 182, 183, 184, 185, 186, 
      193, 194, 197, 198, 199, 202, 208, 209, 213, 214, 237, 238, 239, 245, 
      247, 257, 258, 278, 279, 280, 281, 282, 283, 284, 285, 309, 310, 311, 
      312, 313, 315, 316, 324, 325 ], 
  [ 1, 2, 13, 14, 15, 16, 17, 38, 52, 55, 56, 59, 126, 127, 128, 133, 137, 
      202 ], [ 1, 2, 13, 15, 16, 38, 56, 59, 128 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 43, 44, 45, 51, 52, 55, 56, 64, 69, 70, 
      74, 76, 84, 88, 89, 138, 139, 146, 148, 149, 172, 173, 174, 175, 208, 
      210, 213, 222, 236, 295, 297, 313 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 43, 44, 45, 51, 52, 53, 54, 55, 56, 64, 
      69, 70, 71, 72, 74, 75, 76, 84, 88, 89, 138, 139, 140, 146, 148, 149, 
      172, 173, 174, 175, 203, 205, 208, 209, 210, 211, 212, 213, 214, 222, 
      231, 236, 288, 295, 297, 313 ], 
  [ 1, 2, 4, 6, 27, 40, 43, 44, 45, 51, 54, 55, 56, 74, 75, 76, 89, 172, 173, 
      174, 175, 208, 209, 212, 213, 214, 313 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 41, 42, 43, 44, 45, 49, 51, 52, 53, 54, 
      55, 56, 64, 65, 67, 69, 70, 71, 72, 74, 75, 76, 84, 88, 89, 138, 139, 
      140, 146, 147, 148, 149, 172, 173, 174, 175, 203, 204, 205, 207, 208, 
      209, 210, 211, 212, 213, 214, 218, 219, 220, 222, 231, 233, 234, 235, 
      236, 288, 295, 296, 297, 313 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 42, 43, 44, 45, 49, 51, 54, 55, 56, 64, 
      65, 67, 69, 72, 74, 75, 76, 84, 89, 138, 139, 140, 146, 147, 148, 172, 
      173, 174, 175, 205, 208, 209, 212, 213, 214, 220, 231, 235, 288, 313 ], 
  [ 1, 2, 4, 6, 27, 43, 45, 51, 55, 56, 74, 76, 89, 173, 174, 175, 213, 313 ],
  [ 1, 2, 4, 6, 27, 43, 45, 51, 54, 55, 56, 74, 75, 76, 89, 173, 174, 175, 
      208, 213, 214, 313 ], 
  [ 1, 2, 6, 17, 44, 45, 51, 52, 55, 56, 84, 88, 89, 138, 139, 213, 222 ], 
  [ 1, 2, 6, 17, 19, 27, 44, 45, 51, 52, 53, 54, 55, 56, 84, 88, 89, 138, 
      139, 140, 146, 148, 149, 172, 173, 174, 175, 210, 212, 213, 214, 222, 
      288, 295, 297, 313 ], 
  [ 1, 2, 6, 27, 44, 45, 51, 54, 55, 56, 89, 172, 173, 174, 175, 213, 214, 
      313 ], [ 1, 2, 6, 45, 51, 55, 56, 89 ], 
  [ 1, 2, 6, 27, 45, 51, 54, 55, 56, 89, 173, 174, 175, 213, 313 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 
      27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 46, 52, 55, 56, 57, 58, 59, 63, 
      66, 70, 73, 76, 77, 78, 80, 83, 84, 85, 86, 87, 88, 89, 92, 95, 96, 97, 
      98, 101, 104, 126, 127, 128, 129, 130, 131, 132, 133, 136, 137, 143, 
      145, 149, 152, 164, 165, 168, 169, 170, 171, 173, 175, 178, 181, 183, 
      184, 193, 195, 198, 201, 202, 228, 239, 243, 244, 245, 246, 247, 256, 
      258, 278, 279, 291, 294, 310, 312 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 
      27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 46, 50, 51, 52, 53, 54, 55, 56, 
      57, 58, 59, 63, 66, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 
      81, 82, 83, 84, 85, 86, 87, 88, 89, 91, 92, 93, 94, 95, 96, 97, 98, 
      100, 101, 102, 103, 104, 126, 127, 128, 129, 130, 131, 132, 133, 134, 
      135, 136, 137, 139, 140, 141, 142, 143, 145, 148, 149, 151, 152, 153, 
      154, 155, 156, 163, 164, 165, 166, 167, 168, 169, 170, 171, 173, 174, 
      175, 176, 177, 178, 181, 182, 183, 184, 185, 186, 193, 194, 195, 196, 
      197, 198, 199, 200, 201, 202, 208, 209, 213, 214, 215, 217, 221, 222, 
      227, 228, 229, 230, 232, 236, 237, 238, 239, 240, 241, 242, 243, 244, 
      245, 246, 247, 251, 252, 253, 255, 256, 257, 258, 262, 278, 279, 280, 
      281, 282, 283, 284, 285, 286, 287, 290, 291, 293, 294, 297, 301, 306, 
      307, 308, 309, 310, 311, 312, 313, 315, 316, 317, 318, 320, 324, 325, 
      327, 328 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 36, 38, 46, 50, 51, 
      54, 56, 57, 58, 59, 73, 74, 75, 76, 77, 78, 79, 82, 83, 86, 87, 89, 91, 
      94, 95, 98, 100, 103, 104, 128, 165, 166, 167, 168, 169, 170, 171, 174, 
      175, 176, 177, 178, 182, 183, 194, 197, 198, 202, 237, 238, 239, 240, 
      241, 245, 247, 257, 258, 307, 308, 309, 310, 311, 312 ], 
  [ 1, 2, 6, 17, 44, 45, 49, 51, 52, 55, 56, 84, 88, 89, 138, 139, 210, 213, 
      222 ], 
  [ 1, 2, 6, 17, 19, 27, 44, 45, 49, 51, 52, 53, 54, 55, 56, 84, 88, 89, 138, 
      139, 140, 146, 147, 148, 149, 172, 173, 174, 175, 210, 211, 212, 213, 
      214, 218, 220, 222, 288, 295, 296, 297, 313 ], 
  [ 1, 2, 6, 17, 19, 27, 44, 45, 49, 51, 54, 55, 56, 84, 89, 138, 139, 140, 
      146, 147, 148, 172, 173, 174, 175, 212, 213, 214, 288, 313 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 
      27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 46, 50, 51, 52, 55, 56, 57, 58, 
      59, 63, 66, 68, 69, 70, 73, 74, 76, 77, 78, 79, 80, 83, 84, 85, 86, 87, 
      88, 89, 91, 92, 95, 96, 97, 98, 100, 101, 104, 126, 127, 128, 129, 130, 
      131, 132, 133, 134, 136, 137, 139, 141, 143, 145, 148, 149, 151, 152, 
      155, 163, 164, 165, 166, 168, 169, 170, 171, 173, 174, 175, 176, 178, 
      181, 182, 183, 184, 185, 193, 194, 195, 198, 199, 201, 202, 208, 213, 
      215, 222, 227, 228, 236, 237, 239, 240, 242, 243, 244, 245, 246, 247, 
      251, 252, 255, 256, 257, 258, 262, 278, 279, 280, 281, 283, 284, 286, 
      290, 291, 293, 294, 297, 301, 306, 307, 309, 310, 311, 312, 313, 315, 
      317, 318, 320, 324, 325, 327, 328 ], 
  [ 1, 2, 6, 17, 45, 51, 52, 55, 56, 84, 88, 89, 139, 213 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 32, 36, 38, 39, 40, 43, 44, 45, 49, 51, 52, 55, 56, 
      57, 58, 59, 60, 63, 64, 67, 69, 70, 73, 74, 76, 84, 85, 86, 87, 88, 89, 
      90, 91, 92, 95, 96, 97, 98, 99, 100, 101, 104, 109, 110, 111, 112, 113, 
      114, 115, 116, 117, 126, 127, 128, 129, 130, 131, 132, 133, 134, 136, 
      137, 138, 139, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 155, 
      157, 158, 162, 163, 164, 165, 166, 168, 170, 171, 172, 173, 174, 175, 
      176, 178, 179, 181, 182, 183, 184, 185, 187, 193, 194, 195, 198, 201, 
      202, 203, 208, 210, 213, 218, 222, 227, 228, 233, 236, 237, 239, 243, 
      244, 245, 246, 247, 248, 251, 252, 254, 255, 256, 257, 258, 259, 262, 
      263, 265, 266, 267, 268, 271, 272, 273, 275, 278, 279, 280, 281, 283, 
      284, 286, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 301, 302, 
      305, 306, 307, 309, 310, 311, 312, 313, 315, 317, 318, 319, 320, 322, 
      323, 324, 325, 326, 327, 328 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 32, 36, 38, 39, 40, 43, 44, 45, 49, 51, 52, 53, 54, 
      55, 56, 57, 58, 59, 60, 63, 64, 67, 69, 70, 71, 72, 73, 74, 75, 76, 84, 
      85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 
      102, 103, 104, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 
      126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 
      140, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 
      156, 157, 158, 159, 160, 162, 163, 164, 165, 166, 167, 168, 170, 171, 
      172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 
      186, 187, 188, 189, 193, 194, 195, 196, 197, 198, 201, 202, 203, 204, 
      205, 208, 209, 210, 211, 212, 213, 214, 218, 219, 220, 222, 223, 225, 
      227, 228, 229, 230, 231, 233, 234, 235, 236, 237, 238, 239, 243, 244, 
      245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 
      259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 
      273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 
      287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 
      301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 
      315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 32, 36, 38, 39, 40, 43, 44, 45, 49, 51, 54, 55, 56, 
      57, 58, 59, 60, 63, 64, 67, 69, 72, 73, 74, 75, 76, 84, 85, 86, 87, 89, 
      90, 91, 94, 95, 96, 97, 98, 99, 100, 103, 104, 109, 110, 111, 112, 113, 
      114, 115, 116, 119, 126, 128, 129, 130, 131, 132, 133, 134, 135, 136, 
      137, 138, 139, 140, 143, 144, 145, 146, 147, 148, 150, 151, 154, 155, 
      156, 157, 160, 162, 163, 165, 166, 167, 168, 170, 171, 172, 173, 174, 
      175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 189, 193, 
      194, 197, 198, 202, 205, 208, 209, 212, 213, 214, 220, 227, 230, 231, 
      235, 237, 238, 239, 243, 245, 247, 250, 252, 253, 254, 255, 257, 258, 
      261, 263, 264, 265, 266, 270, 272, 273, 274, 277, 278, 279, 280, 281, 
      282, 283, 284, 285, 286, 287, 288, 289, 290, 293, 300, 304, 307, 308, 
      309, 310, 311, 312, 313, 314, 315, 316, 321, 324, 325 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 10, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24, 
      25, 26, 27, 28, 29, 30, 31, 33, 36, 37, 38, 39, 40, 43, 44, 45, 51, 54, 
      55, 56, 57, 58, 59, 61, 63, 64, 69, 72, 73, 74, 75, 76, 77, 78, 79, 82, 
      83, 84, 85, 86, 87, 89, 91, 94, 95, 96, 97, 98, 100, 103, 104, 109, 
      110, 111, 112, 113, 114, 115, 116, 119, 126, 128, 129, 130, 131, 132, 
      133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 145, 146, 148, 
      151, 154, 155, 156, 157, 160, 163, 165, 166, 167, 168, 170, 171, 172, 
      173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 
      192, 193, 194, 197, 198, 199, 200, 202, 205, 208, 209, 212, 213, 214, 
      227, 230, 231, 237, 238, 239, 240, 241, 243, 245, 247, 252, 253, 255, 
      257, 258, 263, 264, 265, 266, 270, 272, 273, 274, 277, 278, 279, 280, 
      281, 282, 283, 284, 285, 286, 287, 288, 290, 293, 304, 307, 308, 309, 
      310, 311, 312, 313, 314, 315, 316, 321, 324, 325 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 36, 38, 39, 43, 45, 51, 55, 56, 57, 58, 59, 63, 69, 73, 74, 76, 
      84, 85, 86, 87, 89, 91, 95, 96, 97, 98, 100, 104, 126, 128, 129, 130, 
      131, 132, 133, 134, 136, 137, 139, 143, 145, 148, 151, 155, 163, 165, 
      166, 168, 170, 171, 173, 174, 175, 176, 178, 181, 182, 183, 184, 185, 
      193, 194, 198, 202, 208, 213, 237, 239, 243, 245, 247, 252, 255, 257, 
      258, 278, 279, 280, 281, 283, 284, 286, 290, 293, 307, 309, 310, 311, 
      312, 313, 315, 324, 325 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 36, 38, 39, 43, 45, 52, 55, 56, 57, 58, 59, 63, 70, 73, 76, 84, 
      85, 86, 87, 88, 89, 92, 95, 96, 97, 98, 101, 104, 126, 127, 128, 129, 
      130, 131, 132, 133, 136, 137, 143, 145, 149, 152, 164, 165, 168, 170, 
      171, 173, 175, 178, 181, 183, 184, 193, 195, 198, 201, 202, 239, 243, 
      244, 245, 246, 247, 256, 258, 278, 279, 291, 294, 310, 312 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 36, 38, 39, 43, 45, 51, 52, 53, 54, 55, 56, 57, 58, 59, 63, 69, 
      70, 71, 72, 73, 74, 75, 76, 84, 85, 86, 87, 88, 89, 91, 92, 93, 94, 95, 
      96, 97, 98, 100, 101, 102, 103, 104, 126, 127, 128, 129, 130, 131, 132, 
      133, 134, 135, 136, 137, 139, 140, 143, 145, 148, 149, 151, 152, 153, 
      154, 155, 156, 163, 164, 165, 166, 167, 168, 170, 171, 173, 174, 175, 
      176, 177, 178, 181, 182, 183, 184, 185, 186, 193, 194, 195, 196, 197, 
      198, 201, 202, 208, 209, 213, 214, 222, 227, 228, 230, 236, 237, 238, 
      239, 243, 244, 245, 246, 247, 251, 252, 253, 255, 256, 257, 258, 262, 
      278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 290, 291, 293, 294, 
      297, 301, 306, 307, 308, 309, 310, 311, 312, 313, 315, 316, 317, 318, 
      320, 324, 325, 327, 328 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 36, 38, 39, 43, 45, 51, 54, 55, 56, 57, 58, 59, 63, 69, 72, 73, 
      74, 75, 76, 84, 85, 86, 87, 89, 91, 94, 95, 96, 97, 98, 100, 103, 104, 
      126, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 139, 140, 143, 
      145, 148, 151, 154, 155, 156, 163, 165, 166, 167, 168, 170, 171, 173, 
      174, 175, 176, 177, 178, 181, 182, 183, 184, 185, 186, 193, 194, 197, 
      198, 202, 208, 209, 213, 214, 227, 237, 238, 239, 243, 245, 247, 252, 
      253, 255, 257, 258, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 
      290, 293, 307, 308, 309, 310, 311, 312, 313, 315, 316, 324, 325 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 43, 44, 45, 51, 54, 55, 56, 64, 69, 72, 
      74, 75, 76, 84, 89, 138, 139, 140, 146, 148, 172, 173, 174, 175, 205, 
      208, 209, 212, 213, 214, 288, 313 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 
      27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 46, 50, 51, 54, 55, 56, 57, 58, 
      59, 63, 66, 68, 69, 72, 73, 74, 75, 76, 77, 78, 79, 82, 83, 84, 85, 86, 
      87, 89, 91, 94, 95, 96, 97, 98, 100, 103, 104, 126, 128, 129, 130, 131, 
      132, 133, 134, 135, 136, 137, 139, 140, 141, 142, 143, 145, 148, 151, 
      154, 155, 156, 163, 165, 166, 167, 168, 169, 170, 171, 173, 174, 175, 
      176, 177, 178, 181, 182, 183, 184, 185, 186, 193, 194, 197, 198, 199, 
      200, 202, 208, 209, 213, 214, 217, 227, 230, 237, 238, 239, 240, 241, 
      243, 245, 247, 252, 253, 255, 257, 258, 278, 279, 280, 281, 282, 283, 
      284, 285, 286, 287, 290, 293, 307, 308, 309, 310, 311, 312, 313, 315, 
      316, 324, 325 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 43, 44, 45, 49, 51, 52, 55, 56, 64, 67, 
      69, 70, 74, 76, 84, 88, 89, 138, 139, 146, 147, 148, 149, 172, 173, 
      174, 175, 203, 208, 210, 213, 218, 222, 236, 295, 296, 297, 313 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 43, 44, 45, 49, 51, 52, 53, 54, 55, 56, 
      64, 67, 69, 70, 71, 72, 74, 75, 76, 84, 88, 89, 138, 139, 140, 146, 
      147, 148, 149, 172, 173, 174, 175, 203, 204, 205, 208, 209, 210, 211, 
      212, 213, 214, 218, 219, 220, 222, 231, 233, 235, 236, 288, 295, 296, 
      297, 313 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 40, 43, 44, 45, 49, 51, 54, 55, 56, 64, 67, 
      69, 72, 74, 75, 76, 84, 89, 138, 139, 140, 146, 147, 148, 172, 173, 
      174, 175, 205, 208, 209, 212, 213, 214, 220, 231, 288, 313 ], 
  [ 1, 2, 3, 4, 6, 17, 19, 27, 43, 45, 51, 52, 55, 56, 69, 70, 74, 76, 84, 
      88, 89, 139, 148, 149, 173, 174, 175, 208, 213, 222, 297, 313 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 27, 28, 30, 36, 38, 51, 56, 57, 58, 59, 73, 
      74, 76, 86, 87, 89, 91, 95, 98, 100, 104, 128, 170, 171, 174, 175, 176, 
      178, 182, 183, 194, 198, 202, 239, 245, 247, 257, 258, 309, 310, 311, 
      312 ], [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 27, 28, 30, 36, 38, 51, 54, 56, 
      57, 58, 59, 73, 74, 75, 76, 86, 87, 89, 91, 94, 95, 98, 100, 103, 104, 
      128, 170, 171, 174, 175, 176, 177, 178, 182, 183, 194, 197, 198, 202, 
      237, 239, 245, 247, 257, 258, 309, 310, 311, 312 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 27, 28, 30, 36, 38, 56, 57, 58, 59, 73, 76, 
      86, 87, 89, 95, 98, 104, 128, 170, 171, 175, 178, 183, 198, 202, 245, 
      247, 258, 310, 312 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 36, 38, 51, 56, 57, 
      58, 59, 73, 74, 76, 77, 78, 79, 83, 86, 87, 89, 91, 95, 98, 100, 104, 
      128, 165, 166, 168, 170, 171, 174, 175, 176, 178, 182, 183, 194, 198, 
      202, 237, 239, 245, 247, 257, 258, 307, 309, 310, 311, 312 ], 
  [ 1, 2, 4, 5, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 36, 38, 51, 54, 56, 
      57, 58, 59, 73, 74, 75, 76, 77, 78, 79, 82, 83, 86, 87, 89, 91, 94, 95, 
      98, 100, 103, 104, 128, 165, 166, 167, 168, 170, 171, 174, 175, 176, 
      177, 178, 182, 183, 194, 197, 198, 202, 237, 238, 239, 240, 245, 247, 
      257, 258, 307, 308, 309, 310, 311, 312 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 
      27, 28, 30, 31, 36, 37, 38, 39, 43, 45, 51, 52, 55, 56, 57, 58, 59, 63, 
      69, 70, 73, 74, 76, 77, 78, 79, 80, 83, 84, 85, 86, 87, 88, 89, 91, 92, 
      95, 96, 97, 98, 100, 101, 104, 126, 127, 128, 129, 130, 131, 132, 133, 
      134, 136, 137, 139, 141, 143, 145, 148, 149, 151, 152, 155, 163, 164, 
      165, 166, 168, 170, 171, 173, 174, 175, 176, 178, 181, 182, 183, 184, 
      185, 193, 194, 195, 198, 199, 201, 202, 208, 213, 222, 227, 228, 236, 
      237, 239, 240, 243, 244, 245, 246, 247, 251, 252, 255, 256, 257, 258, 
      262, 278, 279, 280, 281, 283, 284, 286, 290, 291, 293, 294, 297, 301, 
      306, 307, 309, 310, 311, 312, 313, 315, 317, 318, 320, 324, 325, 327, 
      328 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 24, 30, 36, 38, 39, 45, 55, 56, 57, 58, 
      59, 84, 85, 86, 87, 89, 96, 104, 126, 128, 131, 132, 133, 136, 137, 
      181, 183, 193, 198, 202, 245, 247 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 24, 30, 38, 39, 45, 52, 55, 56, 57, 59, 
      84, 85, 86, 88, 89, 96, 101, 104, 126, 127, 128, 131, 133, 137, 164, 
      181, 183, 201, 202, 245 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 30, 38, 56, 57, 59, 86, 89, 104, 128, 183, 202 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 24, 30, 36, 38, 39, 45, 52, 55, 56, 57, 
      58, 59, 84, 85, 86, 87, 88, 89, 96, 101, 104, 126, 127, 128, 131, 132, 
      133, 136, 137, 164, 181, 183, 193, 195, 198, 201, 202, 243, 244, 245, 
      247 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 30, 36, 38, 56, 57, 58, 59, 86, 87, 89, 104, 128, 
      183, 198, 202, 245 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 38, 39, 40, 43, 44, 45, 49, 51, 52, 55, 56, 57, 59, 
      64, 67, 69, 70, 74, 76, 84, 85, 86, 88, 89, 90, 91, 92, 95, 96, 97, 98, 
      99, 100, 101, 104, 109, 110, 111, 112, 113, 114, 115, 117, 126, 127, 
      128, 129, 130, 131, 133, 134, 137, 138, 139, 143, 146, 147, 148, 149, 
      150, 151, 152, 155, 158, 162, 163, 164, 166, 170, 172, 173, 174, 175, 
      176, 178, 181, 182, 183, 185, 201, 202, 203, 208, 210, 213, 218, 222, 
      233, 236, 244, 245, 251, 252, 254, 255, 256, 257, 258, 259, 262, 265, 
      267, 268, 271, 272, 278, 280, 281, 283, 289, 290, 291, 295, 296, 297, 
      298, 301, 305, 306, 309, 310, 313, 319, 320, 322, 324, 326, 327 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 38, 39, 40, 43, 44, 45, 49, 51, 52, 53, 54, 55, 56, 
      57, 59, 64, 67, 69, 70, 71, 72, 74, 75, 76, 84, 85, 86, 88, 89, 90, 91, 
      92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 109, 110, 111, 
      112, 113, 114, 115, 117, 118, 119, 126, 127, 128, 129, 130, 131, 133, 
      134, 135, 137, 138, 139, 140, 143, 146, 147, 148, 149, 150, 151, 152, 
      153, 154, 155, 156, 158, 159, 160, 162, 163, 164, 166, 167, 170, 172, 
      173, 174, 175, 176, 177, 178, 180, 181, 182, 183, 185, 186, 201, 202, 
      203, 204, 205, 208, 209, 210, 211, 212, 213, 214, 218, 219, 220, 222, 
      231, 233, 234, 235, 236, 244, 245, 248, 250, 251, 252, 253, 254, 255, 
      256, 257, 258, 259, 260, 261, 262, 264, 265, 267, 268, 269, 270, 271, 
      272, 274, 278, 280, 281, 282, 283, 288, 289, 290, 291, 295, 296, 297, 
      298, 299, 300, 301, 305, 306, 309, 310, 313, 319, 320, 322, 324, 326, 
      327 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 38, 39, 40, 43, 44, 45, 49, 51, 54, 55, 56, 57, 59, 
      64, 67, 69, 72, 74, 75, 76, 84, 85, 86, 89, 90, 91, 94, 95, 96, 97, 98, 
      99, 100, 103, 104, 109, 110, 111, 112, 113, 114, 115, 119, 126, 128, 
      129, 130, 131, 133, 134, 135, 137, 138, 139, 140, 143, 146, 147, 148, 
      150, 151, 154, 155, 156, 160, 162, 163, 166, 167, 170, 172, 173, 174, 
      175, 176, 177, 178, 180, 181, 182, 183, 185, 186, 202, 205, 208, 209, 
      212, 213, 214, 220, 231, 235, 245, 252, 253, 254, 255, 257, 258, 261, 
      264, 265, 270, 272, 274, 278, 280, 281, 282, 283, 288, 289, 290, 300, 
      309, 310, 313, 324 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 38, 39, 43, 45, 51, 52, 55, 56, 57, 59, 69, 70, 74, 76, 84, 85, 
      86, 88, 89, 91, 92, 95, 96, 97, 98, 100, 101, 104, 126, 127, 128, 129, 
      130, 131, 133, 134, 137, 139, 143, 148, 149, 151, 152, 155, 163, 164, 
      166, 170, 173, 174, 175, 176, 178, 181, 182, 183, 185, 201, 202, 208, 
      213, 222, 236, 244, 245, 252, 255, 256, 257, 258, 262, 278, 280, 281, 
      283, 290, 291, 297, 301, 306, 309, 310, 313, 320, 324, 327 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 38, 39, 45, 51, 55, 56, 59, 84, 89, 96, 
      100, 104, 126, 128, 133, 134, 137, 139, 202, 213 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 27, 38, 39, 45, 51, 54, 55, 56, 59, 
      84, 89, 96, 97, 98, 100, 103, 104, 126, 128, 129, 133, 134, 135, 137, 
      139, 140, 148, 173, 174, 175, 202, 213, 214, 252, 255, 257, 258, 280, 
      313 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 27, 38, 39, 44, 45, 49, 51, 55, 
      56, 59, 84, 89, 96, 97, 98, 99, 100, 104, 109, 110, 113, 126, 128, 129, 
      133, 134, 137, 138, 139, 146, 147, 148, 172, 173, 174, 175, 202, 213, 
      252, 255, 257, 258, 280, 313 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 27, 38, 39, 45, 51, 55, 56, 59, 84, 
      89, 96, 97, 98, 100, 104, 126, 128, 129, 133, 134, 137, 139, 148, 173, 
      174, 175, 202, 213, 252, 257, 258, 280, 313 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 27, 38, 39, 45, 52, 55, 56, 59, 84, 
      88, 89, 96, 97, 98, 101, 104, 126, 127, 128, 129, 133, 137, 149, 173, 
      175, 201, 202, 258 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 38, 51, 56, 59, 89, 98, 100, 104, 128, 174, 
      175, 202, 258 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 38, 56, 59, 89, 98, 104, 128, 175, 202 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 38, 39, 44, 45, 49, 51, 52, 55, 56, 
      59, 84, 88, 89, 96, 99, 100, 101, 104, 109, 117, 126, 127, 128, 133, 
      134, 137, 138, 139, 201, 202, 210, 213, 218, 222, 252, 262 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 27, 38, 39, 44, 45, 49, 51, 52, 
      53, 54, 55, 56, 59, 84, 88, 89, 96, 97, 98, 99, 100, 101, 102, 103, 
      104, 109, 110, 113, 117, 118, 119, 126, 127, 128, 129, 133, 134, 135, 
      137, 138, 139, 140, 146, 147, 148, 149, 172, 173, 174, 175, 201, 202, 
      210, 211, 212, 213, 214, 218, 219, 220, 222, 252, 253, 254, 255, 256, 
      257, 258, 259, 261, 262, 264, 267, 280, 288, 295, 296, 297, 313, 319, 
      320 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 27, 38, 39, 44, 45, 49, 51, 54, 
      55, 56, 59, 84, 89, 96, 97, 98, 99, 100, 103, 104, 109, 110, 113, 119, 
      126, 128, 129, 133, 134, 135, 137, 138, 139, 140, 146, 147, 148, 172, 
      173, 174, 175, 202, 212, 213, 214, 220, 252, 253, 254, 255, 257, 258, 
      264, 280, 288, 313 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 38, 39, 45, 51, 52, 55, 56, 59, 84, 88, 
      89, 96, 100, 101, 104, 126, 127, 128, 133, 134, 137, 139, 201, 202, 
      213, 222, 252 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 24, 30, 36, 38, 39, 44, 45, 51, 55, 
      56, 57, 58, 59, 84, 85, 86, 87, 89, 96, 100, 104, 109, 112, 115, 116, 
      126, 128, 131, 132, 133, 134, 136, 137, 138, 139, 163, 181, 182, 183, 
      193, 194, 198, 202, 213, 243, 245, 247, 252, 283, 284, 286 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 27, 38, 39, 44, 45, 51, 54, 55, 
      56, 59, 84, 89, 96, 97, 98, 100, 103, 104, 109, 110, 113, 119, 126, 
      128, 129, 133, 134, 135, 137, 138, 139, 140, 146, 148, 172, 173, 174, 
      175, 202, 212, 213, 214, 252, 253, 255, 257, 258, 280, 288, 313 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 44, 
      45, 51, 55, 56, 57, 59, 84, 85, 86, 89, 96, 97, 98, 100, 104, 109, 110, 
      111, 112, 113, 114, 115, 126, 128, 129, 130, 131, 133, 134, 137, 138, 
      139, 143, 146, 148, 151, 163, 170, 172, 173, 174, 175, 176, 178, 181, 
      182, 183, 202, 213, 245, 252, 255, 257, 258, 272, 278, 280, 281, 283, 
      290, 309, 310, 313, 324 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 36, 38, 39, 
      44, 45, 51, 55, 56, 57, 58, 59, 84, 85, 86, 87, 89, 96, 97, 98, 100, 
      104, 109, 110, 111, 112, 113, 114, 115, 116, 126, 128, 129, 130, 131, 
      132, 133, 134, 136, 137, 138, 139, 143, 145, 146, 148, 151, 163, 170, 
      171, 172, 173, 174, 175, 176, 178, 181, 182, 183, 193, 194, 198, 202, 
      213, 243, 245, 247, 252, 255, 257, 258, 263, 265, 272, 273, 278, 279, 
      280, 281, 283, 284, 286, 290, 293, 309, 310, 311, 312, 313, 324, 325 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 27, 38, 39, 44, 45, 51, 52, 55, 
      56, 59, 84, 88, 89, 96, 97, 98, 100, 101, 104, 109, 110, 113, 117, 126, 
      127, 128, 129, 133, 134, 137, 138, 139, 146, 148, 149, 172, 173, 174, 
      175, 201, 202, 210, 213, 222, 252, 255, 256, 257, 258, 262, 280, 295, 
      297, 313, 320 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 20, 28, 38, 39, 44, 45, 51, 52, 55, 
      56, 59, 84, 88, 89, 96, 100, 101, 104, 109, 111, 114, 117, 126, 127, 
      128, 130, 133, 134, 137, 138, 139, 151, 152, 176, 178, 201, 202, 210, 
      213, 222, 252, 262, 281, 301 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 44, 
      45, 51, 52, 53, 54, 55, 56, 57, 59, 84, 85, 86, 88, 89, 96, 97, 98, 
      100, 101, 102, 103, 104, 109, 110, 111, 112, 113, 114, 115, 117, 118, 
      119, 126, 127, 128, 129, 130, 131, 133, 134, 135, 137, 138, 139, 140, 
      143, 146, 148, 149, 151, 152, 153, 154, 163, 164, 170, 172, 173, 174, 
      175, 176, 177, 178, 181, 182, 183, 201, 202, 210, 211, 212, 213, 214, 
      222, 244, 245, 252, 253, 255, 256, 257, 258, 262, 264, 265, 267, 268, 
      270, 271, 272, 274, 278, 280, 281, 282, 283, 288, 290, 291, 295, 297, 
      301, 306, 309, 310, 313, 320, 322, 324, 327 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 44, 
      45, 51, 54, 55, 56, 57, 59, 84, 85, 86, 89, 96, 97, 98, 100, 103, 104, 
      109, 110, 111, 112, 113, 114, 115, 119, 126, 128, 129, 130, 131, 133, 
      134, 135, 137, 138, 139, 140, 143, 146, 148, 151, 154, 163, 170, 172, 
      173, 174, 175, 176, 177, 178, 181, 182, 183, 202, 212, 213, 214, 245, 
      252, 253, 255, 257, 258, 264, 265, 272, 274, 278, 280, 281, 282, 283, 
      288, 290, 309, 310, 313, 324 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 24, 30, 38, 39, 44, 45, 51, 52, 55, 
      56, 57, 59, 84, 85, 86, 88, 89, 96, 100, 101, 104, 109, 112, 115, 117, 
      126, 127, 128, 131, 133, 134, 137, 138, 139, 163, 164, 181, 182, 183, 
      201, 202, 210, 213, 222, 244, 245, 252, 262, 283, 306 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 27, 28, 30, 38, 39, 44, 45, 51, 55, 56, 
      57, 59, 86, 89, 98, 100, 104, 113, 114, 115, 128, 129, 130, 131, 133, 
      134, 170, 172, 173, 174, 175, 176, 178, 181, 182, 183, 202, 213, 245, 
      257, 258, 278, 280, 281, 283, 309, 310, 313, 324 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 27, 28, 30, 36, 38, 39, 44, 45, 51, 55, 
      56, 57, 58, 59, 86, 87, 89, 98, 100, 104, 113, 114, 115, 116, 128, 129, 
      130, 131, 132, 133, 134, 170, 171, 172, 173, 174, 175, 176, 178, 181, 
      182, 183, 193, 194, 198, 202, 213, 245, 247, 257, 258, 272, 278, 279, 
      280, 281, 283, 284, 309, 310, 311, 312, 313, 324, 325 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 27, 28, 30, 38, 39, 44, 45, 51, 54, 55, 
      56, 57, 59, 86, 89, 98, 100, 103, 104, 113, 114, 115, 119, 128, 129, 
      130, 131, 133, 134, 135, 170, 172, 173, 174, 175, 176, 177, 178, 181, 
      182, 183, 202, 212, 213, 214, 245, 257, 258, 272, 278, 280, 281, 282, 
      283, 309, 310, 313, 324 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 24, 30, 36, 38, 39, 44, 45, 51, 52, 
      55, 56, 57, 58, 59, 84, 85, 86, 87, 88, 89, 96, 100, 101, 104, 109, 
      112, 115, 116, 117, 126, 127, 128, 131, 132, 133, 134, 136, 137, 138, 
      139, 163, 164, 181, 182, 183, 193, 194, 195, 198, 201, 202, 210, 213, 
      222, 243, 244, 245, 246, 247, 252, 262, 263, 271, 283, 284, 286, 306, 
      317 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 36, 38, 39, 
      44, 45, 51, 52, 53, 54, 55, 56, 57, 58, 59, 84, 85, 86, 87, 88, 89, 96, 
      97, 98, 100, 101, 102, 103, 104, 109, 110, 111, 112, 113, 114, 115, 
      116, 117, 118, 119, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 
      136, 137, 138, 139, 140, 143, 145, 146, 148, 149, 151, 152, 153, 154, 
      163, 164, 170, 171, 172, 173, 174, 175, 176, 177, 178, 181, 182, 183, 
      193, 194, 195, 196, 197, 198, 201, 202, 210, 211, 212, 213, 214, 222, 
      243, 244, 245, 246, 247, 252, 253, 255, 256, 257, 258, 262, 263, 264, 
      265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 277, 278, 279, 
      280, 281, 282, 283, 284, 285, 286, 287, 288, 290, 291, 293, 294, 295, 
      297, 301, 306, 309, 310, 311, 312, 313, 317, 320, 321, 322, 323, 324, 
      325, 327, 328 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 27, 28, 30, 36, 38, 39, 44, 45, 51, 54, 
      55, 56, 57, 58, 59, 86, 87, 89, 98, 100, 103, 104, 113, 114, 115, 116, 
      119, 128, 129, 130, 131, 132, 133, 134, 135, 170, 171, 172, 173, 174, 
      175, 176, 177, 178, 181, 182, 183, 193, 194, 197, 198, 202, 212, 213, 
      214, 245, 247, 257, 258, 272, 273, 274, 278, 279, 280, 281, 282, 283, 
      284, 285, 309, 310, 311, 312, 313, 324, 325 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 27, 28, 30, 38, 39, 45, 55, 56, 57, 59, 86, 
      89, 98, 104, 128, 129, 130, 131, 133, 170, 173, 175, 178, 181, 183, 
      202, 245, 258, 310 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 27, 28, 30, 36, 38, 39, 45, 55, 56, 57, 58, 
      59, 86, 87, 89, 98, 104, 128, 129, 130, 131, 132, 133, 170, 171, 173, 
      175, 178, 181, 183, 193, 198, 202, 245, 247, 258, 278, 310, 312 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 27, 38, 39, 45, 51, 55, 56, 59, 89, 98, 100, 
      104, 128, 129, 133, 134, 173, 174, 175, 202, 213, 257, 258, 313 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 28, 38, 39, 45, 51, 55, 56, 59, 89, 100, 104, 
      128, 130, 133, 134, 176, 178, 202, 213 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 27, 28, 30, 38, 39, 45, 51, 54, 55, 56, 57, 
      59, 86, 89, 98, 100, 103, 104, 128, 129, 130, 131, 133, 134, 135, 170, 
      173, 174, 175, 176, 177, 178, 181, 182, 183, 202, 213, 214, 245, 257, 
      258, 278, 280, 281, 283, 309, 310, 313, 324 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 30, 38, 39, 45, 51, 55, 56, 57, 59, 86, 89, 
      100, 104, 128, 131, 133, 134, 181, 182, 183, 202, 213, 245 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 30, 36, 38, 39, 45, 51, 55, 56, 57, 58, 59, 
      86, 87, 89, 100, 104, 128, 131, 132, 133, 134, 181, 182, 183, 193, 194, 
      198, 202, 213, 245, 247, 283 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 27, 28, 30, 36, 38, 39, 45, 51, 54, 55, 56, 
      57, 58, 59, 86, 87, 89, 98, 100, 103, 104, 128, 129, 130, 131, 132, 
      133, 134, 135, 170, 171, 173, 174, 175, 176, 177, 178, 181, 182, 183, 
      193, 194, 197, 198, 202, 213, 214, 245, 247, 257, 258, 278, 279, 280, 
      281, 282, 283, 284, 309, 310, 311, 312, 313, 324, 325 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 24, 30, 36, 38, 39, 45, 51, 55, 56, 57, 
      58, 59, 84, 85, 86, 87, 89, 96, 100, 104, 126, 128, 131, 132, 133, 134, 
      136, 137, 139, 163, 181, 182, 183, 193, 194, 198, 202, 213, 243, 245, 
      247, 252, 283, 284 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 36, 38, 39, 45, 
      51, 54, 55, 56, 57, 58, 59, 84, 85, 86, 87, 89, 96, 97, 98, 100, 103, 
      104, 126, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 139, 140, 
      143, 145, 148, 151, 154, 163, 170, 171, 173, 174, 175, 176, 177, 178, 
      181, 182, 183, 193, 194, 197, 198, 202, 213, 214, 243, 245, 247, 252, 
      253, 255, 257, 258, 278, 279, 280, 281, 282, 283, 284, 285, 286, 290, 
      293, 309, 310, 311, 312, 313, 324, 325 ], 
  [ 1, 2, 6, 17, 19, 27, 44, 45, 51, 54, 55, 56, 84, 89, 138, 139, 140, 146, 
      148, 172, 173, 174, 175, 212, 213, 214, 313 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 44, 
      45, 49, 51, 55, 56, 57, 59, 84, 85, 86, 89, 96, 97, 98, 99, 100, 104, 
      109, 110, 111, 112, 113, 114, 115, 126, 128, 129, 130, 131, 133, 134, 
      137, 138, 139, 143, 146, 147, 148, 150, 151, 162, 163, 170, 172, 173, 
      174, 175, 176, 178, 181, 182, 183, 202, 213, 245, 252, 254, 255, 257, 
      258, 265, 272, 278, 280, 281, 283, 290, 309, 310, 313, 324 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 45, 51, 
      55, 56, 57, 59, 84, 85, 86, 89, 96, 97, 98, 100, 104, 126, 128, 129, 
      130, 131, 133, 134, 137, 139, 143, 148, 151, 163, 170, 173, 174, 175, 
      176, 178, 181, 182, 183, 202, 213, 245, 252, 255, 257, 258, 278, 280, 
      281, 283, 309, 310, 313, 324 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 45, 52, 
      55, 56, 57, 59, 84, 85, 86, 88, 89, 96, 97, 98, 101, 104, 126, 127, 
      128, 129, 130, 131, 133, 137, 143, 149, 152, 164, 170, 173, 175, 178, 
      181, 183, 201, 202, 244, 245, 256, 258, 278, 310 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 32, 36, 38, 
      39, 44, 45, 49, 51, 52, 55, 56, 57, 58, 59, 84, 85, 86, 87, 88, 89, 96, 
      97, 98, 99, 100, 101, 104, 109, 110, 111, 112, 113, 114, 115, 116, 117, 
      126, 127, 128, 129, 130, 131, 132, 133, 134, 136, 137, 138, 139, 143, 
      144, 145, 146, 147, 148, 149, 150, 151, 152, 162, 163, 164, 170, 171, 
      172, 173, 174, 175, 176, 178, 181, 182, 183, 187, 193, 194, 195, 198, 
      201, 202, 210, 213, 218, 222, 243, 244, 245, 246, 247, 252, 254, 255, 
      256, 257, 258, 259, 262, 263, 265, 266, 267, 268, 271, 272, 273, 275, 
      278, 279, 280, 281, 283, 284, 286, 289, 290, 291, 293, 294, 295, 296, 
      297, 298, 301, 305, 306, 309, 310, 311, 312, 313, 317, 319, 320, 322, 
      323, 324, 325, 326, 327, 328 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 36, 38, 39, 45, 
      51, 55, 56, 57, 58, 59, 84, 85, 86, 87, 89, 96, 97, 98, 100, 104, 126, 
      128, 129, 130, 131, 132, 133, 134, 136, 137, 139, 143, 145, 148, 151, 
      163, 170, 171, 173, 174, 175, 176, 178, 181, 182, 183, 193, 194, 198, 
      202, 213, 243, 245, 247, 252, 255, 257, 258, 278, 279, 280, 281, 283, 
      284, 286, 290, 309, 310, 311, 312, 313, 324, 325 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 36, 38, 39, 45, 
      52, 55, 56, 57, 58, 59, 84, 85, 86, 87, 88, 89, 96, 97, 98, 101, 104, 
      126, 127, 128, 129, 130, 131, 132, 133, 136, 137, 143, 145, 149, 152, 
      164, 170, 171, 173, 175, 178, 181, 183, 193, 195, 198, 201, 202, 243, 
      244, 245, 246, 247, 256, 258, 278, 279, 291, 310, 312 ], 
  [ 1, 2, 6, 17, 19, 27, 44, 45, 51, 52, 55, 56, 84, 88, 89, 138, 139, 146, 
      148, 149, 172, 173, 174, 175, 210, 213, 222, 297, 313 ], 
  [ 1, 2, 6, 17, 19, 27, 44, 45, 49, 51, 52, 55, 56, 84, 88, 89, 138, 139, 
      146, 147, 148, 149, 172, 173, 174, 175, 210, 213, 218, 222, 295, 297, 
      313 ], [ 1, 2, 6, 17, 19, 27, 45, 51, 52, 55, 56, 84, 88, 89, 139, 148, 
      149, 173, 174, 175, 213, 222, 313 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 20, 28, 38, 39, 44, 45, 49, 51, 52, 
      55, 56, 59, 84, 88, 89, 96, 99, 100, 101, 104, 109, 111, 114, 117, 126, 
      127, 128, 130, 133, 134, 137, 138, 139, 150, 151, 152, 176, 178, 201, 
      202, 210, 213, 218, 222, 252, 259, 262, 268, 281, 301 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 44, 
      45, 49, 51, 52, 53, 54, 55, 56, 57, 59, 84, 85, 86, 88, 89, 96, 97, 98, 
      99, 100, 101, 102, 103, 104, 109, 110, 111, 112, 113, 114, 115, 117, 
      118, 119, 126, 127, 128, 129, 130, 131, 133, 134, 135, 137, 138, 139, 
      140, 143, 146, 147, 148, 149, 150, 151, 152, 153, 154, 162, 163, 164, 
      170, 172, 173, 174, 175, 176, 177, 178, 181, 182, 183, 201, 202, 210, 
      211, 212, 213, 214, 218, 219, 220, 222, 244, 245, 252, 253, 254, 255, 
      256, 257, 258, 259, 260, 261, 262, 264, 265, 267, 268, 269, 270, 271, 
      272, 274, 278, 280, 281, 282, 283, 288, 289, 290, 291, 295, 296, 297, 
      298, 300, 301, 305, 306, 309, 310, 313, 319, 320, 322, 324, 326, 327 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 44, 
      45, 49, 51, 54, 55, 56, 57, 59, 84, 85, 86, 89, 96, 97, 98, 99, 100, 
      103, 104, 109, 110, 111, 112, 113, 114, 115, 119, 126, 128, 129, 130, 
      131, 133, 134, 135, 137, 138, 139, 140, 143, 146, 147, 148, 150, 151, 
      154, 162, 163, 170, 172, 173, 174, 175, 176, 177, 178, 181, 182, 183, 
      202, 212, 213, 214, 220, 245, 252, 253, 254, 255, 257, 258, 261, 264, 
      265, 270, 272, 274, 278, 280, 281, 282, 283, 288, 289, 290, 309, 310, 
      313, 324 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 20, 28, 38, 39, 45, 51, 52, 55, 56, 59, 
      84, 88, 89, 96, 100, 101, 104, 126, 127, 128, 130, 133, 134, 137, 139, 
      151, 152, 176, 178, 201, 202, 213, 222, 252, 262, 281 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 36, 38, 39, 40, 43, 44, 45, 51, 52, 55, 56, 57, 58, 
      59, 63, 64, 69, 70, 73, 74, 76, 84, 85, 86, 87, 88, 89, 91, 92, 95, 96, 
      97, 98, 100, 101, 104, 109, 110, 111, 112, 113, 114, 115, 116, 117, 
      126, 127, 128, 129, 130, 131, 132, 133, 134, 136, 137, 138, 139, 143, 
      145, 146, 148, 149, 151, 152, 155, 157, 158, 163, 164, 165, 166, 168, 
      170, 171, 172, 173, 174, 175, 176, 178, 179, 181, 182, 183, 184, 185, 
      193, 194, 195, 198, 201, 202, 203, 208, 210, 213, 222, 227, 228, 236, 
      237, 239, 243, 244, 245, 246, 247, 251, 252, 255, 256, 257, 258, 262, 
      263, 265, 266, 267, 268, 271, 272, 273, 275, 278, 279, 280, 281, 283, 
      284, 286, 290, 291, 293, 294, 295, 297, 301, 306, 307, 309, 310, 311, 
      312, 313, 315, 317, 318, 320, 322, 323, 324, 325, 327, 328 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 36, 38, 39, 40, 43, 44, 45, 51, 52, 53, 54, 55, 56, 
      57, 58, 59, 63, 64, 69, 70, 71, 72, 73, 74, 75, 76, 84, 85, 86, 87, 88, 
      89, 91, 92, 93, 94, 95, 96, 97, 98, 100, 101, 102, 103, 104, 109, 110, 
      111, 112, 113, 114, 115, 116, 117, 118, 119, 126, 127, 128, 129, 130, 
      131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 143, 145, 146, 148, 
      149, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 163, 164, 165, 
      166, 167, 168, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 
      181, 182, 183, 184, 185, 186, 193, 194, 195, 196, 197, 198, 201, 202, 
      203, 204, 205, 208, 209, 210, 211, 212, 213, 214, 222, 227, 228, 229, 
      230, 231, 236, 237, 238, 239, 243, 244, 245, 246, 247, 251, 252, 253, 
      255, 256, 257, 258, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 
      272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 
      286, 287, 288, 290, 291, 293, 294, 295, 297, 301, 302, 304, 306, 307, 
      308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 320, 321, 322, 
      323, 324, 325, 327, 328 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 13, 14, 15, 16, 17, 19, 20, 21, 22, 24, 25, 26, 
      27, 28, 29, 30, 31, 36, 38, 39, 40, 43, 44, 45, 51, 54, 55, 56, 57, 58, 
      59, 63, 64, 69, 72, 73, 74, 75, 76, 84, 85, 86, 87, 89, 91, 94, 95, 96, 
      97, 98, 100, 103, 104, 109, 110, 111, 112, 113, 114, 115, 116, 119, 
      126, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 
      143, 145, 146, 148, 151, 154, 155, 156, 157, 160, 163, 165, 166, 167, 
      168, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 
      183, 184, 185, 186, 193, 194, 197, 198, 202, 205, 208, 209, 212, 213, 
      214, 227, 230, 231, 237, 238, 239, 243, 245, 247, 252, 253, 255, 257, 
      258, 263, 264, 265, 266, 270, 272, 273, 274, 277, 278, 279, 280, 281, 
      282, 283, 284, 285, 286, 287, 288, 290, 293, 307, 308, 309, 310, 311, 
      312, 313, 314, 315, 316, 321, 324, 325 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 24, 30, 38, 39, 44, 45, 49, 51, 52, 
      55, 56, 57, 59, 84, 85, 86, 88, 89, 96, 99, 100, 101, 104, 109, 112, 
      115, 117, 126, 127, 128, 131, 133, 134, 137, 138, 139, 162, 163, 164, 
      181, 182, 183, 201, 202, 210, 213, 218, 222, 244, 245, 252, 259, 262, 
      271, 283, 306 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 24, 30, 38, 39, 45, 51, 52, 55, 56, 57, 
      59, 84, 85, 86, 88, 89, 96, 100, 101, 104, 126, 127, 128, 131, 133, 
      134, 137, 139, 163, 164, 181, 182, 183, 201, 202, 213, 222, 244, 245, 
      252, 262, 283 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 36, 38, 51, 56, 57, 58, 
      59, 73, 74, 76, 86, 87, 89, 91, 95, 98, 100, 104, 128, 165, 166, 168, 
      170, 171, 174, 175, 176, 178, 182, 183, 194, 198, 202, 237, 239, 245, 
      247, 257, 258, 309, 310, 311, 312 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 15, 16, 25, 26, 27, 28, 30, 36, 38, 51, 54, 56, 57, 
      58, 59, 73, 74, 75, 76, 86, 87, 89, 91, 94, 95, 98, 100, 103, 104, 128, 
      165, 166, 167, 168, 170, 171, 174, 175, 176, 177, 178, 182, 183, 194, 
      197, 198, 202, 237, 238, 239, 245, 247, 257, 258, 307, 309, 310, 311, 
      312 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 28, 30, 38, 51, 56, 57, 59, 86, 89, 98, 100, 
      104, 128, 170, 174, 175, 176, 178, 182, 183, 202, 245, 257, 258, 310 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 28, 30, 38, 56, 57, 59, 86, 89, 98, 104, 128, 
      170, 175, 178, 183, 202, 245, 258 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 28, 30, 36, 38, 51, 56, 57, 58, 59, 86, 87, 
      89, 98, 100, 104, 128, 170, 171, 174, 175, 176, 178, 182, 183, 194, 
      198, 202, 245, 247, 257, 258, 309, 310, 312 ], 
  [ 1, 2, 6, 8, 13, 15, 16, 27, 28, 30, 36, 38, 56, 57, 58, 59, 86, 87, 89, 
      98, 104, 128, 170, 171, 175, 178, 183, 198, 202, 245, 247, 258, 310 ], 
  [ 1, 2, 6, 27, 45, 51, 55, 56, 89, 173, 174, 175, 213 ], 
  [ 1, 2, 4, 6, 7, 8, 10, 13, 14, 15, 16, 27, 28, 29, 30, 31, 36, 38, 39, 40, 
      43, 44, 45, 51, 54, 55, 56, 57, 58, 59, 73, 74, 75, 76, 86, 87, 89, 91, 
      94, 95, 98, 100, 103, 104, 113, 114, 115, 116, 119, 128, 129, 130, 131, 
      132, 133, 134, 135, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 
      180, 181, 182, 183, 184, 185, 186, 193, 194, 197, 198, 202, 205, 208, 
      209, 212, 213, 214, 237, 238, 239, 245, 247, 257, 258, 272, 273, 274, 
      277, 278, 279, 280, 281, 282, 283, 284, 285, 309, 310, 311, 312, 313, 
      315, 316, 324, 325 ], 
  [ 1, 2, 4, 6, 7, 8, 13, 14, 15, 16, 27, 28, 30, 31, 36, 38, 39, 43, 45, 51, 
      55, 56, 57, 58, 59, 73, 74, 76, 86, 87, 89, 91, 95, 98, 100, 104, 128, 
      129, 130, 131, 132, 133, 134, 170, 171, 173, 174, 175, 176, 178, 181, 
      182, 183, 184, 185, 193, 194, 198, 202, 208, 213, 237, 239, 245, 247, 
      257, 258, 278, 279, 280, 281, 283, 284, 309, 310, 311, 312, 313, 324, 
      325 ], [ 1, 2, 4, 6, 7, 8, 13, 14, 15, 16, 27, 28, 30, 31, 36, 38, 39, 
      43, 45, 51, 54, 55, 56, 57, 58, 59, 73, 74, 75, 76, 86, 87, 89, 91, 94, 
      95, 98, 100, 103, 104, 128, 129, 130, 131, 132, 133, 134, 135, 170, 
      171, 173, 174, 175, 176, 177, 178, 181, 182, 183, 184, 185, 186, 193, 
      194, 197, 198, 202, 208, 209, 213, 214, 237, 238, 239, 245, 247, 257, 
      258, 278, 279, 280, 281, 282, 283, 284, 285, 309, 310, 311, 312, 313, 
      315, 324, 325 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 24, 30, 36, 38, 39, 45, 51, 52, 55, 56, 
      57, 58, 59, 84, 85, 86, 87, 88, 89, 96, 100, 101, 104, 126, 127, 128, 
      131, 132, 133, 134, 136, 137, 139, 163, 164, 181, 182, 183, 193, 194, 
      195, 198, 201, 202, 213, 222, 243, 244, 245, 246, 247, 252, 262, 283, 
      284, 286, 306 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 17, 19, 20, 21, 24, 25, 26, 27, 28, 
      30, 31, 36, 38, 39, 43, 45, 51, 52, 55, 56, 57, 58, 59, 63, 69, 70, 73, 
      74, 76, 84, 85, 86, 87, 88, 89, 91, 92, 95, 96, 97, 98, 100, 101, 104, 
      126, 127, 128, 129, 130, 131, 132, 133, 134, 136, 137, 139, 143, 145, 
      148, 149, 151, 152, 155, 163, 164, 165, 166, 168, 170, 171, 173, 174, 
      175, 176, 178, 181, 182, 183, 184, 185, 193, 194, 195, 198, 201, 202, 
      208, 213, 222, 227, 228, 236, 237, 239, 243, 244, 245, 246, 247, 251, 
      252, 255, 256, 257, 258, 262, 278, 279, 280, 281, 283, 284, 286, 290, 
      291, 293, 294, 297, 301, 306, 307, 309, 310, 311, 312, 313, 315, 317, 
      320, 324, 325, 327, 328 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 27, 38, 39, 44, 45, 49, 51, 52, 
      55, 56, 59, 84, 88, 89, 96, 97, 98, 99, 100, 101, 104, 109, 110, 113, 
      117, 126, 127, 128, 129, 133, 134, 137, 138, 139, 146, 147, 148, 149, 
      172, 173, 174, 175, 201, 202, 210, 213, 218, 222, 252, 254, 255, 256, 
      257, 258, 259, 262, 267, 280, 295, 296, 297, 313, 320 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 27, 38, 39, 45, 51, 52, 55, 56, 59, 
      84, 88, 89, 96, 97, 98, 100, 101, 104, 126, 127, 128, 129, 133, 134, 
      137, 139, 148, 149, 173, 174, 175, 201, 202, 213, 222, 252, 255, 256, 
      257, 258, 262, 280, 297, 313 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 36, 38, 39, 
      44, 45, 51, 54, 55, 56, 57, 58, 59, 84, 85, 86, 87, 89, 96, 97, 98, 
      100, 103, 104, 109, 110, 111, 112, 113, 114, 115, 116, 119, 126, 128, 
      129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 143, 145, 
      146, 148, 151, 154, 163, 170, 171, 172, 173, 174, 175, 176, 177, 178, 
      181, 182, 183, 193, 194, 197, 198, 202, 212, 213, 214, 243, 245, 247, 
      252, 253, 255, 257, 258, 263, 264, 265, 266, 270, 272, 273, 274, 277, 
      278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 290, 293, 309, 
      310, 311, 312, 313, 324, 325 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 44, 
      45, 51, 52, 55, 56, 57, 59, 84, 85, 86, 88, 89, 96, 97, 98, 100, 101, 
      104, 109, 110, 111, 112, 113, 114, 115, 117, 126, 127, 128, 129, 130, 
      131, 133, 134, 137, 138, 139, 143, 146, 148, 149, 151, 152, 163, 164, 
      170, 172, 173, 174, 175, 176, 178, 181, 182, 183, 201, 202, 210, 213, 
      222, 244, 245, 252, 255, 256, 257, 258, 262, 265, 267, 268, 271, 272, 
      278, 280, 281, 283, 290, 291, 295, 297, 301, 306, 309, 310, 313, 320, 
      324, 327 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 36, 38, 39, 
      44, 45, 51, 52, 55, 56, 57, 58, 59, 84, 85, 86, 87, 88, 89, 96, 97, 98, 
      100, 101, 104, 109, 110, 111, 112, 113, 114, 115, 116, 117, 126, 127, 
      128, 129, 130, 131, 132, 133, 134, 136, 137, 138, 139, 143, 145, 146, 
      148, 149, 151, 152, 163, 164, 170, 171, 172, 173, 174, 175, 176, 178, 
      181, 182, 183, 193, 194, 195, 198, 201, 202, 210, 213, 222, 243, 244, 
      245, 246, 247, 252, 255, 256, 257, 258, 262, 263, 265, 266, 267, 268, 
      271, 272, 273, 275, 278, 279, 280, 281, 283, 284, 286, 290, 291, 293, 
      294, 295, 297, 301, 306, 309, 310, 311, 312, 313, 317, 320, 322, 324, 
      325, 327, 328 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 27, 28, 30, 38, 39, 45, 51, 55, 56, 57, 59, 
      86, 89, 98, 100, 104, 128, 129, 130, 131, 133, 134, 170, 173, 174, 175, 
      176, 178, 181, 182, 183, 202, 213, 245, 257, 258, 278, 280, 281, 283, 
      309, 310, 313 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 27, 28, 30, 36, 38, 39, 45, 51, 55, 56, 57, 
      58, 59, 86, 87, 89, 98, 100, 104, 128, 129, 130, 131, 132, 133, 134, 
      170, 171, 173, 174, 175, 176, 178, 181, 182, 183, 193, 194, 198, 202, 
      213, 245, 247, 257, 258, 278, 279, 280, 281, 283, 284, 309, 310, 311, 
      312, 313, 324 ], 
  [ 1, 2, 6, 8, 10, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 44, 
      45, 49, 51, 52, 55, 56, 57, 59, 84, 85, 86, 88, 89, 96, 97, 98, 99, 
      100, 101, 104, 109, 110, 111, 112, 113, 114, 115, 117, 126, 127, 128, 
      129, 130, 131, 133, 134, 137, 138, 139, 143, 146, 147, 148, 149, 150, 
      151, 152, 162, 163, 164, 170, 172, 173, 174, 175, 176, 178, 181, 182, 
      183, 201, 202, 210, 213, 218, 222, 244, 245, 252, 254, 255, 256, 257, 
      258, 259, 262, 265, 267, 268, 271, 272, 278, 280, 281, 283, 289, 290, 
      291, 295, 296, 297, 298, 301, 305, 306, 309, 310, 313, 319, 320, 322, 
      324, 327 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 38, 39, 45, 51, 
      52, 55, 56, 57, 59, 84, 85, 86, 88, 89, 96, 97, 98, 100, 101, 104, 126, 
      127, 128, 129, 130, 131, 133, 134, 137, 139, 143, 148, 149, 151, 152, 
      163, 164, 170, 173, 174, 175, 176, 178, 181, 182, 183, 201, 202, 213, 
      222, 244, 245, 252, 255, 256, 257, 258, 262, 278, 280, 281, 283, 290, 
      291, 297, 301, 306, 309, 310, 313, 320, 324 ], 
  [ 1, 2, 6, 8, 13, 14, 15, 16, 17, 19, 20, 24, 27, 28, 30, 36, 38, 39, 45, 
      51, 52, 55, 56, 57, 58, 59, 84, 85, 86, 87, 88, 89, 96, 97, 98, 100, 
      101, 104, 126, 127, 128, 129, 130, 131, 132, 133, 134, 136, 137, 139, 
      143, 145, 148, 149, 151, 152, 163, 164, 170, 171, 173, 174, 175, 176, 
      178, 181, 182, 183, 193, 194, 195, 198, 201, 202, 213, 222, 243, 244, 
      245, 246, 247, 252, 255, 256, 257, 258, 262, 278, 279, 280, 281, 283, 
      284, 286, 290, 291, 293, 294, 297, 301, 306, 309, 310, 311, 312, 313, 
      317, 320, 324, 325, 327 ] ]
gap> S := Semigroup([
> Transformation([1, 5, 4, 5, 2]), Transformation([4, 5, 1, 3, 5])]);;
gap> l := LatticeOfCongruences(S);
[ [  ], [ 1, 3, 11, 12, 13, 18, 22, 24, 48, 51, 54, 58, 61, 63, 112, 116, 
      127, 147 ], [ 1, 48 ], 
  [ 1, 2, 3, 11, 12, 13, 18, 19, 22, 24, 25, 31, 48, 51, 54, 58, 61, 63, 104, 
      112, 116, 127, 147 ], 
  [ 1, 3, 6, 10, 21, 33, 48, 49, 50, 53, 59, 60, 96, 99, 138, 165 ], 
  [ 1, 3, 10, 21, 48, 49, 50, 53, 60, 96, 99, 138 ], 
  [ 1, 2, 3, 4, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 28, 30, 31, 32, 39, 40, 42, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 
      60, 61, 62, 63, 64, 66, 80, 81, 82, 83, 85, 86, 87, 88, 89, 94, 95, 96, 
      97, 98, 99, 100, 101, 102, 103, 104, 107, 111, 112, 113, 114, 115, 116, 
      119, 124, 125, 126, 127, 131, 132, 137, 138, 139, 140, 141, 142, 145, 
      146, 147, 150, 151, 154, 173, 179, 184, 186, 193, 198, 205 ], 
  [ 1, 2, 3, 6, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 40, 47, 
      48, 49, 50, 51, 52, 53, 54, 55, 58, 60, 61, 62, 63, 64, 80, 86, 87, 88, 
      89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 111, 112, 113, 114, 
      115, 116, 124, 125, 126, 127, 131, 132, 137, 138, 139, 140, 141, 142, 
      145, 146, 147, 173, 179, 186, 193, 198, 205 ], 
  [ 1, 2, 3, 4, 5, 6, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 
      23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 35, 36, 37, 38, 40, 43, 44, 
      45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 
      63, 64, 65, 67, 68, 69, 70, 71, 72, 73, 74, 76, 77, 78, 79, 80, 81, 82, 
      83, 84, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
      104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 
      118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 
      132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 
      146, 147, 148, 149, 150, 151, 152, 156, 157, 158, 159, 160, 161, 162, 
      163, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 179, 181, 
      182, 183, 184, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 
      197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207 ], [ 1, 50 ], 
  [ 1, 48 ], [ 1, 3, 11, 24, 48 ], [ 1, 11, 48, 51, 54 ], 
  [ 1, 3, 6, 10, 11, 12, 15, 21, 23, 24, 48, 49, 50, 52, 53, 60, 62, 87, 95, 
      96, 98, 99, 103, 137, 138, 140 ], 
  [ 1, 10, 11, 48, 49, 50, 52, 53, 96, 98, 99 ], 
  [ 1, 2, 3, 5, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 33, 
      36, 37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 57, 58, 59, 60, 61, 62, 
      63, 64, 67, 68, 70, 76, 77, 78, 79, 80, 86, 87, 88, 89, 94, 95, 96, 97, 
      98, 99, 100, 101, 102, 103, 108, 110, 111, 112, 113, 114, 115, 116, 
      118, 121, 122, 123, 124, 125, 126, 127, 129, 130, 131, 132, 135, 136, 
      137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 165, 166, 167, 
      168, 169, 173, 174, 175, 176, 177, 178, 179, 181, 182, 186, 188, 192, 
      193, 195, 197, 198, 199, 202, 203, 204, 205, 206 ], 
  [ 1, 3, 6, 10, 21, 48, 49, 50, 52, 53, 60, 62, 87, 96, 98, 99, 138, 140 ], 
  [ 1, 11, 24, 48, 54, 147 ], 
  [ 1, 3, 11, 12, 13, 18, 22, 24, 25, 48, 51, 54, 58, 61, 63, 104, 112, 116, 
      127, 147 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 17, 18, 21, 23, 24, 48, 49, 50, 52, 53, 54, 
      58, 60, 62, 63, 80, 87, 88, 94, 95, 96, 98, 99, 100, 102, 103, 125, 
      126, 137, 138, 140, 141, 145, 147, 186, 205 ], [ 1, 10, 50, 53, 99 ], 
  [ 1, 3, 11, 12, 13, 24, 48, 51, 54, 61, 63, 116, 147 ], 
  [ 1, 10, 11, 15, 48, 49, 50, 52, 53, 96, 98, 99 ], [ 1, 11, 48 ], 
  [ 1, 3, 48, 51, 61 ], 
  [ 1, 3, 5, 6, 10, 21, 25, 29, 33, 48, 49, 50, 51, 53, 59, 60, 61, 71, 76, 
      82, 86, 96, 97, 99, 138, 139, 148, 150, 156, 165, 166, 173, 175, 179 ], 
  [ 1, 2, 3, 4, 5, 6, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 
      23, 24, 25, 28, 30, 31, 32, 33, 36, 37, 40, 47, 48, 49, 50, 51, 52, 53, 
      54, 55, 57, 58, 59, 60, 61, 62, 63, 64, 65, 67, 68, 69, 70, 71, 72, 73, 
      74, 76, 77, 78, 79, 80, 81, 82, 83, 86, 87, 88, 89, 94, 95, 96, 97, 98, 
      99, 100, 101, 102, 103, 104, 107, 108, 110, 111, 112, 113, 114, 115, 
      116, 118, 119, 121, 122, 123, 124, 125, 126, 127, 129, 130, 131, 132, 
      133, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 
      148, 149, 150, 151, 160, 161, 162, 163, 165, 166, 167, 168, 169, 173, 
      174, 175, 176, 177, 178, 179, 181, 182, 183, 184, 186, 188, 189, 190, 
      192, 193, 195, 197, 198, 199, 202, 203, 204, 205, 206, 207 ], 
  [ 1, 2, 3, 4, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 30, 31, 32, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 60, 61, 62, 
      63, 64, 80, 81, 82, 83, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 
      101, 102, 103, 104, 107, 111, 112, 113, 114, 115, 116, 119, 124, 125, 
      126, 127, 131, 132, 137, 138, 139, 140, 141, 142, 145, 146, 147, 150, 
      151, 173, 179, 184, 186, 193, 198, 205 ], 
  [ 1, 3, 5, 6, 10, 21, 33, 48, 49, 50, 53, 59, 60, 96, 99, 138, 165 ], 
  [ 1, 3, 6, 10, 17, 21, 25, 48, 49, 50, 51, 52, 53, 55, 60, 61, 62, 64, 82, 
      86, 87, 89, 96, 97, 98, 99, 101, 124, 138, 139, 140, 142, 150, 151, 
      173, 179, 184 ], 
  [ 1, 2, 3, 11, 12, 13, 18, 22, 24, 48, 51, 54, 58, 61, 63, 112, 116, 127, 
      147 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 25, 30, 
      40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 60, 61, 62, 63, 64, 80, 81, 
      82, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 
      107, 111, 112, 113, 114, 115, 116, 119, 124, 125, 126, 127, 131, 132, 
      137, 138, 139, 140, 141, 142, 145, 146, 147, 150, 151, 173, 179, 184, 
      186, 193, 198, 205 ], [ 1, 10, 21, 50, 53, 99 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 
      22, 23, 24, 25, 27, 28, 30, 31, 32, 33, 36, 37, 39, 40, 42, 47, 48, 49, 
      50, 51, 52, 53, 54, 55, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 
      69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 85, 86, 87, 
      88, 89, 90, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 107, 108, 
      110, 111, 112, 113, 114, 115, 116, 118, 119, 121, 122, 123, 124, 125, 
      126, 127, 129, 130, 131, 132, 133, 135, 136, 137, 138, 139, 140, 141, 
      142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 153, 154, 160, 161, 
      162, 163, 164, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 
      179, 180, 181, 182, 183, 184, 186, 188, 189, 190, 192, 193, 195, 197, 
      198, 199, 202, 203, 204, 205, 206, 207 ], 
  [ 1, 2, 3, 4, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 28, 30, 31, 32, 33, 38, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 57, 
      58, 59, 60, 61, 62, 63, 64, 65, 80, 81, 82, 83, 84, 86, 87, 88, 89, 94, 
      95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 107, 108, 110, 111, 112, 
      113, 114, 115, 116, 118, 119, 121, 124, 125, 126, 127, 129, 131, 132, 
      133, 135, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 
      150, 151, 160, 162, 163, 165, 166, 167, 168, 169, 173, 174, 175, 176, 
      177, 178, 179, 184, 186, 188, 189, 190, 192, 193, 195, 197, 198, 199, 
      202, 203, 204, 205, 206, 207 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 21, 23, 24, 33, 48, 49, 50, 52, 53, 59, 
      60, 62, 77, 87, 95, 96, 98, 99, 103, 108, 110, 137, 138, 140, 144, 165, 
      167, 176 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 21, 22, 23, 24, 33, 36, 40, 47, 48, 
      49, 50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 76, 77, 78, 79, 86, 
      87, 88, 89, 95, 96, 97, 98, 99, 100, 101, 103, 108, 110, 114, 115, 116, 
      118, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 165, 166, 
      167, 168, 169, 173, 175, 176, 177, 178, 179, 186, 198, 199, 205, 206 ], 
  [ 1, 2, 3, 4, 11, 12, 13, 18, 19, 22, 24, 25, 31, 48, 51, 54, 58, 61, 63, 
      104, 112, 116, 127, 147 ], 
  [ 1, 2, 3, 4, 11, 12, 13, 18, 19, 22, 24, 25, 31, 42, 48, 51, 54, 58, 61, 
      63, 66, 104, 112, 116, 127, 147 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 21, 22, 23, 24, 47, 48, 49, 50, 51, 52, 
      53, 54, 55, 60, 61, 62, 63, 64, 86, 87, 88, 89, 95, 96, 97, 98, 99, 
      100, 101, 103, 114, 115, 116, 137, 138, 139, 140, 141, 142, 145, 146, 
      147, 173, 179, 186, 198, 205 ], 
  [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 
      21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 
      39, 40, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 
      58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 
      76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 
      94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 
      109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 
      123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 
      137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 
      151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 
      165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 
      179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 
      193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 
      207 ], 
  [ 1, 2, 3, 11, 12, 13, 18, 22, 24, 31, 48, 51, 54, 58, 61, 63, 112, 116, 
      127, 147 ], 
  [ 1, 3, 5, 6, 10, 17, 21, 25, 26, 29, 30, 33, 48, 49, 50, 51, 52, 53, 55, 
      59, 60, 61, 62, 64, 67, 71, 72, 76, 77, 79, 82, 86, 87, 89, 96, 97, 98, 
      99, 101, 120, 121, 124, 138, 139, 140, 142, 148, 150, 151, 152, 156, 
      157, 159, 160, 165, 166, 167, 169, 173, 175, 176, 178, 179, 181, 183, 
      184, 200, 202, 207 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 18, 19, 21, 22, 23, 24, 25, 26, 29, 
      33, 36, 37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 
      63, 64, 68, 69, 71, 76, 77, 78, 79, 80, 81, 82, 86, 87, 88, 89, 94, 95, 
      96, 97, 98, 99, 100, 101, 103, 104, 105, 106, 108, 110, 112, 114, 115, 
      116, 117, 118, 119, 126, 127, 128, 129, 130, 131, 132, 133, 137, 138, 
      139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 
      156, 157, 158, 159, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 
      178, 179, 183, 184, 186, 189, 193, 194, 195, 198, 199, 204, 205, 206, 
      207 ], [ 1, 2, 3, 5, 6, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21, 
      22, 23, 24, 29, 31, 33, 36, 37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 
      56, 57, 58, 59, 60, 61, 62, 63, 64, 67, 68, 70, 73, 76, 77, 78, 79, 80, 
      83, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 106, 
      108, 110, 111, 112, 113, 114, 115, 116, 117, 118, 120, 121, 122, 123, 
      124, 125, 126, 127, 128, 129, 130, 131, 132, 134, 135, 136, 137, 138, 
      139, 140, 141, 142, 143, 144, 145, 146, 147, 156, 157, 158, 159, 162, 
      165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 179, 181, 182, 
      186, 187, 188, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 
      202, 203, 204, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 25, 
      26, 29, 30, 32, 33, 36, 37, 40, 43, 44, 47, 48, 49, 50, 51, 52, 53, 54, 
      55, 58, 59, 60, 61, 62, 63, 64, 67, 68, 69, 70, 71, 72, 74, 76, 77, 78, 
      79, 80, 81, 82, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 
      103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 
      117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 
      131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 
      145, 146, 147, 148, 149, 150, 151, 152, 156, 157, 158, 159, 160, 161, 
      163, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 179, 181, 
      182, 183, 184, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 
      197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207 ], 
  [ 1, 10, 11, 13, 15, 48, 49, 50, 51, 52, 53, 54, 55, 96, 97, 98, 99, 100, 
      101, 173 ], [ 1 ], [ 1, 48, 50, 53 ], [ 1 ], [ 1, 48 ], 
  [ 1, 48, 49, 50, 53 ], [ 1, 50 ], [ 1, 11, 48 ], 
  [ 1, 48, 49, 50, 51, 52, 53, 173 ], 
  [ 1, 2, 3, 5, 6, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21, 22, 23, 24, 
      29, 33, 36, 37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 57, 58, 59, 60, 
      61, 62, 63, 64, 67, 68, 70, 76, 77, 78, 79, 80, 86, 87, 88, 89, 94, 95, 
      96, 97, 98, 99, 100, 101, 102, 103, 106, 108, 110, 111, 112, 113, 114, 
      115, 116, 117, 118, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 
      130, 131, 132, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 
      145, 146, 147, 156, 157, 158, 159, 165, 166, 167, 168, 169, 173, 174, 
      175, 176, 177, 178, 179, 181, 182, 186, 187, 188, 191, 192, 193, 194, 
      195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206 ], 
  [ 1, 2, 3, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 33, 
      40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 64, 80, 
      86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 108, 110, 
      111, 112, 113, 114, 115, 116, 118, 121, 124, 125, 126, 127, 129, 131, 
      132, 135, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 165, 
      166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 179, 186, 188, 192, 
      193, 195, 197, 198, 199, 202, 203, 204, 205, 206 ], 
  [ 1, 3, 11, 12, 18, 24, 48, 54, 63, 147 ], 
  [ 1, 3, 6, 10, 21, 33, 48, 49, 50, 53, 60, 96, 99, 138, 165 ], 
  [ 1, 3, 48, 49, 50, 53 ], [ 1, 3, 48, 51 ], [ 1, 3, 48, 49, 50, 52, 53, 60 ]
    , [ 1, 3, 11, 12, 24, 48, 54, 147 ], 
  [ 1, 3, 48, 49, 50, 51, 52, 53, 55, 60, 61, 62, 173, 179 ], 
  [ 1, 2, 3, 4, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 28, 30, 31, 32, 33, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 57, 58, 
      59, 60, 61, 62, 63, 64, 80, 81, 82, 83, 86, 87, 88, 89, 94, 95, 96, 97, 
      98, 99, 100, 101, 102, 103, 104, 107, 108, 110, 111, 112, 113, 114, 
      115, 116, 118, 119, 121, 124, 125, 126, 127, 129, 131, 132, 133, 135, 
      137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 150, 151, 
      160, 162, 163, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 
      179, 184, 186, 188, 189, 190, 192, 193, 195, 197, 198, 199, 202, 203, 
      204, 205, 206, 207 ], 
  [ 1, 2, 3, 4, 11, 12, 13, 18, 19, 22, 24, 25, 31, 42, 48, 51, 54, 58, 61, 
      63, 104, 112, 116, 127, 147 ], 
  [ 1, 3, 5, 6, 10, 17, 21, 33, 48, 49, 50, 52, 53, 59, 60, 62, 77, 87, 96, 
      98, 99, 121, 138, 140, 165, 167, 176 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 18, 21, 23, 24, 33, 36, 48, 49, 50, 52, 
      53, 54, 58, 59, 60, 62, 63, 77, 78, 80, 87, 88, 94, 95, 96, 98, 99, 
      100, 103, 108, 110, 126, 129, 137, 138, 140, 141, 144, 145, 147, 165, 
      167, 168, 174, 176, 177, 186, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 18, 19, 21, 22, 23, 24, 25, 33, 36, 
      37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 64, 
      68, 71, 76, 77, 78, 79, 80, 81, 82, 86, 87, 88, 89, 94, 95, 96, 97, 98, 
      99, 100, 101, 103, 104, 108, 110, 112, 114, 115, 116, 118, 119, 126, 
      127, 129, 130, 131, 132, 133, 137, 138, 139, 140, 141, 142, 143, 144, 
      145, 146, 147, 148, 149, 150, 151, 165, 166, 167, 168, 169, 173, 174, 
      175, 176, 177, 178, 179, 183, 184, 186, 189, 193, 195, 198, 199, 204, 
      205, 206, 207 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 17, 18, 20, 21, 23, 24, 33, 36, 48, 49, 
      50, 52, 53, 54, 58, 59, 60, 62, 63, 67, 68, 77, 78, 80, 87, 88, 94, 95, 
      96, 98, 99, 100, 102, 103, 108, 110, 121, 122, 125, 126, 129, 135, 137, 
      138, 140, 141, 144, 145, 147, 165, 167, 168, 174, 176, 177, 182, 186, 
      188, 203, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 21, 25, 33, 48, 49, 50, 51, 53, 59, 60, 61, 76, 82, 86, 
      96, 97, 99, 138, 139, 148, 150, 165, 166, 173, 175, 179 ], 
  [ 1, 3, 5, 6, 10, 17, 21, 25, 30, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 
      61, 62, 64, 67, 71, 76, 77, 79, 82, 86, 87, 89, 96, 97, 98, 99, 101, 
      121, 124, 138, 139, 140, 142, 148, 150, 151, 160, 165, 166, 167, 169, 
      173, 175, 176, 178, 179, 181, 183, 184, 202, 207 ], 
  [ 1, 2, 3, 5, 6, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21, 22, 23, 24, 
      31, 33, 36, 37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 57, 58, 59, 60, 
      61, 62, 63, 64, 67, 68, 70, 76, 77, 78, 79, 80, 83, 86, 87, 88, 89, 94, 
      95, 96, 97, 98, 99, 100, 101, 102, 103, 108, 110, 111, 112, 113, 114, 
      115, 116, 118, 121, 122, 123, 124, 125, 126, 127, 129, 130, 131, 132, 
      135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 162, 
      165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 179, 181, 182, 
      186, 188, 192, 193, 195, 197, 198, 199, 202, 203, 204, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 25, 
      30, 32, 33, 36, 37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 
      61, 62, 63, 64, 67, 68, 69, 70, 71, 72, 76, 77, 78, 79, 80, 81, 82, 86, 
      87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 107, 108, 
      110, 111, 112, 113, 114, 115, 116, 118, 119, 121, 122, 123, 124, 125, 
      126, 127, 129, 130, 131, 132, 133, 135, 136, 137, 138, 139, 140, 141, 
      142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 160, 161, 163, 165, 
      166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 179, 181, 182, 183, 
      184, 186, 188, 189, 190, 192, 193, 195, 197, 198, 199, 202, 203, 204, 
      205, 206, 207 ], 
  [ 1, 2, 3, 5, 6, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21, 22, 23, 24, 
      31, 33, 36, 37, 40, 42, 47, 48, 49, 50, 51, 52, 53, 54, 55, 57, 58, 59, 
      60, 61, 62, 63, 64, 67, 68, 70, 73, 76, 77, 78, 79, 80, 83, 85, 86, 87, 
      88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 108, 110, 111, 112, 
      113, 114, 115, 116, 118, 121, 122, 123, 124, 125, 126, 127, 129, 130, 
      131, 132, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 
      147, 162, 164, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 
      179, 181, 182, 186, 188, 192, 193, 195, 197, 198, 199, 202, 203, 204, 
      205, 206 ], 
  [ 1, 3, 5, 6, 10, 21, 33, 48, 49, 50, 51, 53, 59, 60, 61, 86, 96, 97, 99, 
      138, 139, 165, 166, 173, 175, 179 ], 
  [ 1, 3, 5, 6, 10, 21, 33, 48, 49, 50, 52, 53, 59, 60, 62, 87, 96, 98, 99, 
      138, 140, 165, 167, 176 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 21, 23, 24, 33, 36, 48, 49, 50, 52, 53, 
      54, 59, 60, 62, 63, 77, 87, 88, 95, 96, 98, 99, 100, 103, 108, 110, 
      137, 138, 140, 141, 144, 145, 147, 165, 167, 168, 176, 177, 186, 205, 
      206 ], 
  [ 1, 3, 5, 6, 10, 21, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 61, 62, 64, 
      76, 77, 86, 87, 89, 96, 97, 98, 99, 101, 138, 139, 140, 142, 165, 166, 
      167, 169, 173, 175, 176, 178, 179 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 18, 21, 23, 24, 48, 49, 50, 52, 53, 54, 58, 
      60, 62, 63, 87, 88, 94, 95, 96, 98, 99, 100, 103, 126, 137, 138, 140, 
      141, 145, 147, 186, 205 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 18, 19, 21, 22, 23, 24, 25, 40, 47, 48, 
      49, 50, 51, 52, 53, 54, 55, 58, 60, 61, 62, 63, 64, 80, 82, 86, 87, 88, 
      89, 94, 95, 96, 97, 98, 99, 100, 101, 103, 104, 112, 114, 115, 116, 
      119, 126, 127, 131, 132, 137, 138, 139, 140, 141, 142, 145, 146, 147, 
      150, 151, 173, 179, 184, 186, 193, 198, 205 ], 
  [ 1, 3, 6, 10, 21, 25, 48, 49, 50, 51, 53, 60, 61, 86, 96, 97, 99, 138, 
      139, 150, 173, 179 ], 
  [ 1, 2, 3, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 31, 
      40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 60, 61, 62, 63, 64, 80, 86, 
      87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 111, 112, 113, 
      114, 115, 116, 124, 125, 126, 127, 131, 132, 137, 138, 139, 140, 141, 
      142, 145, 146, 147, 173, 179, 186, 193, 198, 205 ], 
  [ 1, 2, 3, 4, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 28, 30, 31, 32, 38, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 60, 
      61, 62, 63, 64, 80, 81, 82, 83, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 
      100, 101, 102, 103, 104, 107, 111, 112, 113, 114, 115, 116, 119, 124, 
      125, 126, 127, 131, 132, 137, 138, 139, 140, 141, 142, 145, 146, 147, 
      150, 151, 173, 179, 184, 186, 193, 198, 205 ], 
  [ 1, 2, 3, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 31, 
      40, 42, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 60, 61, 62, 63, 64, 80, 
      83, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 111, 
      112, 113, 114, 115, 116, 124, 125, 126, 127, 131, 132, 137, 138, 139, 
      140, 141, 142, 145, 146, 147, 173, 179, 186, 193, 198, 205 ], 
  [ 1, 3, 6, 10, 21, 48, 49, 50, 51, 53, 60, 61, 96, 97, 99, 138, 139, 173, 
      179 ], [ 1, 3, 6, 10, 21, 48, 49, 50, 52, 53, 60, 62, 96, 98, 99, 138, 
      140 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 21, 23, 24, 48, 49, 50, 52, 53, 54, 60, 62, 
      63, 87, 95, 96, 98, 99, 100, 103, 137, 138, 140, 141, 145, 147, 186, 
      205 ], 
  [ 1, 3, 6, 10, 21, 48, 49, 50, 51, 52, 53, 55, 60, 61, 62, 64, 86, 87, 96, 
      97, 98, 99, 101, 138, 139, 140, 142, 173, 179 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 
      24, 25, 28, 30, 31, 32, 33, 39, 40, 42, 47, 48, 49, 50, 51, 52, 53, 54, 
      55, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 80, 81, 82, 83, 85, 86, 87, 
      88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 107, 108, 110, 
      111, 112, 113, 114, 115, 116, 118, 119, 121, 124, 125, 126, 127, 129, 
      131, 132, 133, 135, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 
      147, 148, 150, 151, 154, 160, 162, 163, 164, 165, 166, 167, 168, 169, 
      173, 174, 175, 176, 177, 178, 179, 180, 184, 186, 188, 189, 190, 192, 
      193, 195, 197, 198, 199, 202, 203, 204, 205, 206, 207 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 
      24, 25, 28, 30, 31, 32, 33, 35, 38, 39, 40, 42, 47, 48, 49, 50, 51, 52, 
      53, 54, 55, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 80, 81, 82, 83, 84, 
      85, 86, 87, 88, 89, 90, 92, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
      104, 107, 108, 110, 111, 112, 113, 114, 115, 116, 118, 119, 121, 124, 
      125, 126, 127, 129, 131, 132, 133, 135, 137, 138, 139, 140, 141, 142, 
      143, 144, 145, 146, 147, 148, 150, 151, 154, 160, 162, 163, 164, 165, 
      166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 
      180, 184, 185, 186, 188, 189, 190, 192, 193, 195, 197, 198, 199, 202, 
      203, 204, 205, 206, 207 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 
      24, 25, 28, 30, 31, 32, 38, 39, 40, 42, 47, 48, 49, 50, 51, 52, 53, 54, 
      55, 58, 60, 61, 62, 63, 64, 66, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 
      94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 107, 111, 112, 113, 
      114, 115, 116, 119, 124, 125, 126, 127, 131, 132, 137, 138, 139, 140, 
      141, 142, 145, 146, 147, 150, 151, 154, 171, 172, 173, 179, 184, 185, 
      186, 193, 198, 205 ], 
  [ 1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 
      22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 35, 36, 37, 38, 40, 42, 
      43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 
      61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 
      79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 
      100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 
      114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 
      128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 
      142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 
      156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 
      170, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 
      185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 
      199, 200, 201, 202, 203, 204, 205, 206, 207 ], 
  [ 1, 10, 11, 15, 18, 24, 48, 49, 50, 52, 53, 54, 95, 96, 98, 99, 100, 147, 
      186 ], [ 1, 10, 11, 15, 24, 48, 49, 50, 52, 53, 96, 98, 99 ], 
  [ 1, 10, 48, 49, 50, 53, 99 ], [ 1, 10, 48, 49, 50, 51, 53, 96, 99, 173 ], 
  [ 1, 10, 48, 49, 50, 52, 53, 96, 99 ], [ 1, 10, 50, 53 ], 
  [ 1, 10, 11, 15, 48, 49, 50, 52, 53, 54, 96, 98, 99 ], 
  [ 1, 10, 48, 49, 50, 51, 52, 53, 55, 96, 97, 98, 99, 173 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 17, 21, 23, 24, 48, 49, 50, 52, 53, 60, 62, 
      87, 95, 96, 98, 99, 103, 137, 138, 140 ], 
  [ 1, 10, 11, 15, 21, 48, 49, 50, 52, 53, 96, 98, 99, 138, 140 ], 
  [ 1, 3, 11, 12, 13, 22, 24, 25, 48, 51, 54, 61, 63, 116, 147 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 21, 22, 23, 24, 25, 26, 29, 33, 36, 
      37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 71, 
      76, 77, 78, 79, 82, 86, 87, 88, 89, 95, 96, 97, 98, 99, 100, 101, 103, 
      104, 106, 108, 110, 114, 115, 116, 117, 118, 119, 137, 138, 139, 140, 
      141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 156, 157, 
      158, 159, 165, 166, 167, 168, 169, 173, 175, 176, 177, 178, 179, 183, 
      184, 186, 189, 198, 199, 205, 206, 207 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 21, 23, 24, 29, 33, 36, 48, 49, 50, 52, 
      53, 59, 60, 62, 77, 87, 95, 96, 98, 99, 103, 108, 110, 137, 138, 140, 
      144, 157, 165, 167, 176 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 17, 21, 22, 23, 24, 25, 30, 40, 47, 48, 
      49, 50, 51, 52, 53, 54, 55, 60, 61, 62, 63, 64, 82, 86, 87, 88, 89, 95, 
      96, 97, 98, 99, 100, 101, 102, 103, 104, 111, 114, 115, 116, 119, 124, 
      125, 137, 138, 139, 140, 141, 142, 145, 146, 147, 150, 151, 173, 179, 
      184, 186, 198, 205 ], 
  [ 1, 10, 11, 15, 21, 33, 48, 49, 50, 52, 53, 96, 98, 99, 103, 138, 140, 
      165, 167 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 17, 21, 22, 23, 24, 25, 26, 29, 30, 
      33, 36, 37, 40, 43, 47, 48, 49, 50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 
      63, 64, 67, 71, 72, 76, 77, 78, 79, 82, 86, 87, 88, 89, 95, 96, 97, 98, 
      99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 110, 111, 114, 115, 
      116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 137, 138, 139, 140, 
      141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 156, 157, 
      158, 159, 160, 161, 165, 166, 167, 168, 169, 173, 175, 176, 177, 178, 
      179, 181, 182, 183, 184, 186, 187, 188, 189, 190, 191, 192, 198, 199, 
      200, 201, 202, 203, 205, 206, 207 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 21, 23, 24, 33, 48, 49, 50, 52, 53, 59, 60, 
      62, 87, 95, 96, 98, 99, 103, 108, 137, 138, 140, 144, 165, 167, 176 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 17, 21, 22, 23, 24, 40, 47, 48, 49, 50, 
      51, 52, 53, 54, 55, 60, 61, 62, 63, 64, 86, 87, 88, 89, 95, 96, 97, 98, 
      99, 100, 101, 102, 103, 114, 115, 116, 124, 125, 137, 138, 139, 140, 
      141, 142, 145, 146, 147, 173, 179, 186, 198, 205 ], 
  [ 1, 11, 13, 18, 24, 48, 51, 54, 116, 147 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 40, 47, 48, 
      49, 50, 51, 52, 53, 54, 55, 58, 60, 61, 62, 63, 64, 80, 86, 87, 88, 89, 
      94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 111, 112, 114, 115, 116, 
      124, 125, 126, 127, 131, 132, 137, 138, 139, 140, 141, 142, 145, 146, 
      147, 173, 179, 186, 193, 198, 205 ], 
  [ 1, 10, 11, 13, 15, 21, 47, 48, 49, 50, 51, 52, 53, 54, 55, 96, 97, 98, 
      99, 100, 101, 103, 138, 139, 140, 141, 142, 173 ], 
  [ 1, 10, 11, 13, 15, 23, 47, 48, 49, 50, 51, 52, 53, 54, 55, 96, 97, 98, 
      99, 100, 101, 145, 173 ], [ 1, 11, 13, 24, 48, 51, 54, 147 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 21, 22, 23, 24, 29, 33, 36, 37, 40, 
      47, 48, 49, 50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 76, 77, 78, 
      79, 86, 87, 88, 89, 95, 96, 97, 98, 99, 100, 101, 103, 106, 108, 110, 
      114, 115, 116, 118, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 
      147, 156, 157, 158, 159, 165, 166, 167, 168, 169, 173, 175, 176, 177, 
      178, 179, 186, 198, 199, 205, 206 ], 
  [ 1, 10, 11, 13, 15, 21, 33, 47, 48, 49, 50, 51, 52, 53, 54, 55, 96, 97, 
      98, 99, 100, 101, 103, 108, 114, 138, 139, 140, 141, 142, 165, 166, 
      167, 168, 169, 173 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 21, 22, 23, 24, 25, 40, 47, 48, 49, 50, 
      51, 52, 53, 54, 55, 60, 61, 62, 63, 64, 82, 86, 87, 88, 89, 95, 96, 97, 
      98, 99, 100, 101, 103, 104, 114, 115, 116, 137, 138, 139, 140, 141, 
      142, 145, 146, 147, 150, 151, 173, 179, 184, 186, 198, 205 ], 
  [ 1, 3, 5, 6, 10, 17, 21, 29, 33, 48, 49, 50, 52, 53, 59, 60, 62, 67, 77, 
      87, 96, 98, 99, 121, 138, 140, 157, 165, 167, 176 ], 
  [ 1, 3, 6, 10, 17, 21, 33, 48, 49, 50, 52, 53, 59, 60, 62, 87, 96, 98, 99, 
      138, 140, 165, 167, 176 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 17, 21, 23, 24, 33, 36, 48, 49, 50, 52, 
      53, 59, 60, 62, 67, 77, 87, 95, 96, 98, 99, 102, 103, 108, 110, 121, 
      137, 138, 140, 144, 165, 167, 176, 188 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 17, 21, 22, 23, 24, 33, 36, 37, 40, 
      47, 48, 49, 50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 67, 76, 77, 
      78, 79, 86, 87, 88, 89, 95, 96, 97, 98, 99, 100, 101, 102, 103, 108, 
      110, 111, 114, 115, 116, 118, 121, 122, 124, 125, 137, 138, 139, 140, 
      141, 142, 143, 144, 145, 146, 147, 165, 166, 167, 168, 169, 173, 175, 
      176, 177, 178, 179, 181, 182, 186, 188, 192, 198, 199, 202, 203, 205, 
      206 ], 
  [ 1, 3, 6, 10, 17, 21, 48, 49, 50, 51, 52, 53, 55, 60, 61, 62, 64, 86, 87, 
      89, 96, 97, 98, 99, 101, 138, 139, 140, 142, 173, 179 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 17, 21, 23, 24, 48, 49, 50, 52, 53, 54, 60, 
      62, 63, 87, 88, 95, 96, 98, 99, 100, 102, 103, 137, 138, 140, 141, 145, 
      147, 186, 205 ], 
  [ 1, 10, 11, 15, 18, 21, 23, 24, 48, 49, 50, 52, 53, 54, 94, 95, 96, 98, 
      99, 100, 103, 137, 138, 140, 141, 145, 147, 186, 205 ], 
  [ 1, 3, 11, 12, 13, 18, 22, 24, 48, 51, 54, 58, 61, 63, 112, 116, 147 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 18, 21, 23, 24, 29, 33, 36, 48, 49, 50, 
      52, 53, 54, 58, 59, 60, 62, 63, 68, 77, 78, 80, 87, 88, 94, 95, 96, 98, 
      99, 100, 103, 106, 108, 110, 126, 129, 137, 138, 140, 141, 144, 145, 
      147, 157, 158, 165, 167, 168, 174, 176, 177, 186, 205, 206 ], 
  [ 1, 10, 11, 15, 18, 21, 23, 24, 33, 48, 49, 50, 52, 53, 54, 94, 95, 96, 
      98, 99, 100, 103, 108, 126, 137, 138, 140, 141, 144, 145, 147, 165, 
      167, 168, 186, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 18, 21, 22, 23, 24, 33, 36, 37, 40, 
      47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 64, 68, 76, 
      77, 78, 79, 80, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 103, 
      108, 110, 112, 114, 115, 116, 118, 126, 127, 129, 131, 132, 137, 138, 
      139, 140, 141, 142, 143, 144, 145, 146, 147, 165, 166, 167, 168, 169, 
      173, 174, 175, 176, 177, 178, 179, 186, 193, 195, 198, 199, 204, 205, 
      206 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 18, 21, 22, 23, 24, 40, 47, 48, 49, 50, 
      51, 52, 53, 54, 55, 58, 60, 61, 62, 63, 64, 80, 86, 87, 88, 89, 94, 95, 
      96, 97, 98, 99, 100, 101, 103, 112, 114, 115, 116, 126, 127, 132, 137, 
      138, 139, 140, 141, 142, 145, 146, 147, 173, 179, 186, 193, 198, 205 ], 
  [ 1, 10, 11, 13, 15, 18, 24, 47, 48, 49, 50, 51, 52, 53, 54, 55, 94, 95, 
      96, 97, 98, 99, 100, 101, 112, 116, 146, 147, 173, 186 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 18, 19, 21, 22, 23, 24, 25, 33, 40, 47, 
      48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 64, 80, 81, 82, 
      86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 103, 104, 108, 110, 
      112, 114, 115, 116, 118, 119, 126, 127, 129, 131, 132, 137, 138, 139, 
      140, 141, 142, 143, 144, 145, 146, 147, 148, 150, 151, 165, 166, 167, 
      168, 169, 173, 174, 175, 176, 177, 178, 179, 184, 186, 189, 193, 195, 
      198, 199, 204, 205, 206, 207 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 17, 18, 20, 21, 23, 24, 29, 33, 36, 48, 
      49, 50, 52, 53, 54, 58, 59, 60, 62, 63, 67, 68, 70, 77, 78, 80, 87, 88, 
      94, 95, 96, 98, 99, 100, 102, 103, 106, 108, 110, 120, 121, 122, 125, 
      126, 128, 129, 135, 137, 138, 140, 141, 144, 145, 147, 157, 158, 165, 
      167, 168, 174, 176, 177, 182, 186, 187, 188, 201, 203, 205, 206 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 17, 18, 20, 21, 23, 24, 33, 48, 49, 50, 52, 
      53, 54, 58, 59, 60, 62, 63, 80, 87, 88, 94, 95, 96, 98, 99, 100, 102, 
      103, 108, 110, 121, 125, 126, 129, 137, 138, 140, 141, 144, 145, 147, 
      165, 167, 168, 174, 176, 177, 186, 188, 203, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 33, 36, 
      37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 64, 
      67, 68, 70, 76, 77, 78, 79, 80, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 
      100, 101, 102, 103, 108, 110, 111, 112, 113, 114, 115, 116, 118, 121, 
      122, 123, 124, 125, 126, 127, 129, 130, 131, 132, 135, 137, 138, 139, 
      140, 141, 142, 143, 144, 145, 146, 147, 165, 166, 167, 168, 169, 173, 
      174, 175, 176, 177, 178, 179, 181, 182, 186, 188, 192, 193, 195, 197, 
      198, 199, 202, 203, 204, 205, 206 ], 
  [ 1, 10, 11, 15, 21, 23, 24, 48, 49, 50, 52, 53, 95, 96, 98, 99, 103, 138, 
      140 ], [ 1, 10, 21, 48, 49, 50, 53, 96, 99 ], 
  [ 1, 10, 21, 48, 49, 50, 51, 53, 96, 97, 99, 138, 173 ], 
  [ 1, 10, 21, 48, 49, 50, 52, 53, 96, 98, 99, 138 ], 
  [ 1, 10, 11, 15, 21, 48, 49, 50, 52, 53, 54, 96, 98, 99, 100, 103, 138, 140 
     ], [ 1, 10, 21, 48, 49, 50, 51, 52, 53, 55, 96, 97, 98, 99, 101, 138, 
      139, 140, 173 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 21, 22, 23, 24, 33, 40, 47, 48, 49, 50, 
      51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 86, 87, 88, 89, 95, 96, 97, 
      98, 99, 100, 101, 103, 108, 110, 114, 115, 116, 118, 137, 138, 139, 
      140, 141, 142, 144, 145, 146, 147, 165, 166, 167, 168, 169, 173, 175, 
      176, 177, 178, 179, 186, 198, 199, 205, 206 ], 
  [ 1, 10, 11, 15, 21, 23, 24, 33, 48, 49, 50, 52, 53, 95, 96, 98, 99, 103, 
      108, 137, 138, 140, 165, 167 ], 
  [ 1, 10, 11, 15, 23, 48, 49, 50, 52, 53, 54, 96, 98, 99, 100 ], 
  [ 1, 10, 11, 13, 15, 24, 47, 48, 49, 50, 51, 52, 53, 54, 55, 95, 96, 97, 
      98, 99, 100, 101, 116, 147, 173, 186 ], [ 1, 11, 24, 48, 54 ], 
  [ 1, 3, 6, 10, 21, 25, 33, 48, 49, 50, 51, 53, 59, 60, 61, 82, 86, 96, 97, 
      99, 138, 139, 150, 165, 166, 173, 175, 179 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 21, 22, 23, 24, 25, 33, 36, 37, 40, 
      47, 48, 49, 50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 71, 76, 77, 
      78, 79, 82, 86, 87, 88, 89, 95, 96, 97, 98, 99, 100, 101, 103, 104, 
      108, 110, 114, 115, 116, 118, 119, 137, 138, 139, 140, 141, 142, 143, 
      144, 145, 146, 147, 148, 150, 151, 165, 166, 167, 168, 169, 173, 175, 
      176, 177, 178, 179, 183, 184, 186, 189, 198, 199, 205, 206, 207 ], 
  [ 1, 3, 25, 48, 49, 50, 51, 53, 60, 61, 173, 179 ], 
  [ 1, 3, 25, 48, 49, 50, 51, 52, 53, 55, 60, 61, 62, 64, 150, 173, 179 ], 
  [ 1, 3, 5, 6, 10, 21, 25, 26, 29, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 
      61, 62, 64, 71, 76, 77, 79, 82, 86, 87, 89, 96, 97, 98, 99, 101, 138, 
      139, 140, 142, 148, 150, 151, 156, 157, 159, 165, 166, 167, 169, 173, 
      175, 176, 178, 179, 183, 184, 207 ], 
  [ 1, 2, 3, 4, 5, 6, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 
      23, 24, 25, 27, 28, 30, 31, 32, 33, 36, 37, 40, 42, 47, 48, 49, 50, 51, 
      52, 53, 54, 55, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 
      71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 85, 86, 87, 88, 89, 
      94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 107, 108, 110, 111, 
      112, 113, 114, 115, 116, 118, 119, 121, 122, 123, 124, 125, 126, 127, 
      129, 130, 131, 132, 133, 135, 136, 137, 138, 139, 140, 141, 142, 143, 
      144, 145, 146, 147, 148, 149, 150, 151, 154, 160, 161, 162, 163, 164, 
      165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 179, 180, 181, 
      182, 183, 184, 186, 188, 189, 190, 192, 193, 195, 197, 198, 199, 202, 
      203, 204, 205, 206, 207 ], 
  [ 1, 2, 3, 4, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 28, 30, 31, 32, 40, 42, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 60, 
      61, 62, 63, 64, 66, 80, 81, 82, 83, 85, 86, 87, 88, 89, 94, 95, 96, 97, 
      98, 99, 100, 101, 102, 103, 104, 107, 111, 112, 113, 114, 115, 116, 
      119, 124, 125, 126, 127, 131, 132, 137, 138, 139, 140, 141, 142, 145, 
      146, 147, 150, 151, 173, 179, 184, 186, 193, 198, 205 ], 
  [ 1, 2, 3, 5, 6, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21, 22, 23, 24, 
      29, 31, 33, 36, 37, 40, 42, 45, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 
      57, 58, 59, 60, 61, 62, 63, 64, 67, 68, 70, 73, 75, 76, 77, 78, 79, 80, 
      83, 85, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
      106, 108, 110, 111, 112, 113, 114, 115, 116, 117, 118, 120, 121, 122, 
      123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 134, 135, 136, 137, 
      138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 156, 157, 158, 159, 
      162, 164, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 179, 
      181, 182, 186, 187, 188, 191, 192, 193, 194, 195, 196, 197, 198, 199, 
      200, 201, 202, 203, 204, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 21, 29, 33, 48, 49, 50, 51, 53, 59, 60, 61, 76, 86, 96, 
      97, 99, 138, 139, 165, 166, 173, 175, 179 ], 
  [ 1, 3, 5, 6, 10, 21, 29, 33, 48, 49, 50, 52, 53, 59, 60, 62, 77, 87, 96, 
      98, 99, 138, 140, 165, 167, 176 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 21, 23, 24, 29, 33, 36, 48, 49, 50, 52, 
      53, 54, 59, 60, 62, 63, 77, 78, 87, 88, 95, 96, 98, 99, 100, 103, 106, 
      108, 110, 137, 138, 140, 141, 144, 145, 147, 157, 165, 167, 168, 176, 
      177, 186, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 21, 29, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 61, 62, 
      64, 76, 77, 79, 86, 87, 89, 96, 97, 98, 99, 101, 138, 139, 140, 142, 
      156, 157, 165, 166, 167, 169, 173, 175, 176, 178, 179 ], 
  [ 1, 3, 6, 10, 17, 21, 25, 30, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 61, 
      62, 64, 82, 86, 87, 89, 96, 97, 98, 99, 101, 121, 124, 138, 139, 140, 
      142, 148, 150, 151, 165, 166, 167, 169, 173, 175, 176, 178, 179, 184, 
      202, 207 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 17, 21, 22, 23, 24, 25, 30, 33, 36, 
      37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 67, 
      71, 72, 76, 77, 78, 79, 82, 86, 87, 88, 89, 95, 96, 97, 98, 99, 100, 
      101, 102, 103, 104, 107, 108, 110, 111, 114, 115, 116, 118, 119, 121, 
      122, 123, 124, 125, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 
      147, 148, 149, 150, 151, 160, 165, 166, 167, 168, 169, 173, 175, 176, 
      177, 178, 179, 181, 182, 183, 184, 186, 188, 189, 190, 192, 198, 199, 
      202, 203, 205, 206, 207 ], 
  [ 1, 2, 3, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 31, 
      33, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 57, 58, 59, 60, 61, 62, 63, 
      64, 80, 83, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
      108, 110, 111, 112, 113, 114, 115, 116, 118, 121, 124, 125, 126, 127, 
      129, 131, 132, 135, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 
      147, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 179, 186, 
      188, 192, 193, 195, 197, 198, 199, 202, 203, 204, 205, 206 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 25, 30, 
      32, 33, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 
      64, 80, 81, 82, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 
      103, 104, 107, 108, 110, 111, 112, 113, 114, 115, 116, 118, 119, 121, 
      124, 125, 126, 127, 129, 131, 132, 133, 135, 137, 138, 139, 140, 141, 
      142, 143, 144, 145, 146, 147, 148, 150, 151, 160, 165, 166, 167, 168, 
      169, 173, 174, 175, 176, 177, 178, 179, 184, 186, 188, 189, 190, 192, 
      193, 195, 197, 198, 199, 202, 203, 204, 205, 206, 207 ], 
  [ 1, 2, 3, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 31, 
      33, 40, 42, 47, 48, 49, 50, 51, 52, 53, 54, 55, 57, 58, 59, 60, 61, 62, 
      63, 64, 80, 83, 85, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 
      102, 103, 108, 110, 111, 112, 113, 114, 115, 116, 118, 121, 124, 125, 
      126, 127, 129, 131, 132, 135, 137, 138, 139, 140, 141, 142, 143, 144, 
      145, 146, 147, 162, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 
      178, 179, 186, 188, 192, 193, 195, 197, 198, 199, 202, 203, 204, 205, 
      206 ], [ 1, 10, 21, 33, 48, 49, 50, 53, 96, 99, 138 ], 
  [ 1, 10, 21, 33, 48, 49, 50, 51, 53, 96, 97, 99, 138, 139, 165, 173 ], 
  [ 1, 10, 21, 33, 48, 49, 50, 52, 53, 96, 98, 99, 138, 140, 165 ], 
  [ 1, 10, 11, 15, 21, 33, 48, 49, 50, 52, 53, 54, 96, 98, 99, 100, 103, 108, 
      138, 140, 141, 165, 167 ], 
  [ 1, 10, 21, 33, 48, 49, 50, 51, 52, 53, 55, 96, 97, 98, 99, 101, 138, 139, 
      140, 142, 165, 166, 167, 173 ], 
  [ 1, 2, 3, 4, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 28, 30, 31, 32, 33, 35, 38, 40, 42, 47, 48, 49, 50, 51, 52, 53, 54, 
      55, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 80, 81, 82, 83, 84, 85, 86, 
      87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 107, 108, 
      110, 111, 112, 113, 114, 115, 116, 118, 119, 121, 124, 125, 126, 127, 
      129, 131, 132, 133, 135, 137, 138, 139, 140, 141, 142, 143, 144, 145, 
      146, 147, 148, 150, 151, 154, 160, 162, 163, 164, 165, 166, 167, 168, 
      169, 172, 173, 174, 175, 176, 177, 178, 179, 180, 184, 185, 186, 188, 
      189, 190, 192, 193, 195, 197, 198, 199, 202, 203, 204, 205, 206, 207 ], 
  [ 1, 2, 3, 4, 11, 12, 13, 18, 19, 22, 24, 25, 31, 38, 39, 42, 48, 51, 54, 
      58, 61, 63, 66, 104, 112, 116, 127, 147, 172 ], 
  [ 1, 2, 3, 4, 11, 12, 13, 18, 19, 22, 24, 25, 31, 38, 42, 48, 51, 54, 58, 
      61, 63, 66, 104, 112, 116, 127, 147 ], [ 1, 48, 49, 50, 51, 53 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 18, 21, 23, 24, 33, 48, 49, 50, 52, 53, 54, 
      58, 59, 60, 62, 63, 80, 87, 88, 94, 95, 96, 98, 99, 100, 103, 108, 110, 
      126, 129, 137, 138, 140, 141, 144, 145, 147, 165, 167, 168, 176, 177, 
      186, 205, 206 ], 
  [ 1, 3, 6, 10, 21, 33, 48, 49, 50, 51, 53, 59, 60, 61, 86, 96, 97, 99, 138, 
      139, 165, 166, 173, 179 ], 
  [ 1, 3, 6, 10, 21, 33, 48, 49, 50, 52, 53, 59, 60, 62, 87, 96, 98, 99, 138, 
      140, 165, 167 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 21, 23, 24, 33, 48, 49, 50, 52, 53, 54, 59, 
      60, 62, 63, 87, 88, 95, 96, 98, 99, 100, 103, 108, 110, 137, 138, 140, 
      141, 144, 145, 147, 165, 167, 168, 176, 186, 205, 206 ], 
  [ 1, 3, 6, 10, 21, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 61, 62, 64, 86, 
      87, 89, 96, 97, 98, 99, 101, 138, 139, 140, 142, 165, 166, 167, 169, 
      173, 175, 176, 179 ], [ 1, 3, 48, 49, 50, 51, 53, 60, 61, 173 ], 
  [ 1, 2, 3, 4, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 28, 30, 31, 32, 33, 40, 42, 47, 48, 49, 50, 51, 52, 53, 54, 55, 57, 
      58, 59, 60, 61, 62, 63, 64, 65, 66, 80, 81, 82, 83, 85, 86, 87, 88, 89, 
      94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 107, 108, 110, 111, 
      112, 113, 114, 115, 116, 118, 119, 121, 124, 125, 126, 127, 129, 131, 
      132, 133, 135, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 
      148, 150, 151, 154, 160, 162, 163, 164, 165, 166, 167, 168, 169, 173, 
      174, 175, 176, 177, 178, 179, 184, 186, 188, 189, 190, 192, 193, 195, 
      197, 198, 199, 202, 203, 204, 205, 206, 207 ], 
  [ 1, 3, 5, 6, 10, 17, 21, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 61, 62, 
      64, 67, 76, 77, 79, 86, 87, 89, 96, 97, 98, 99, 101, 121, 124, 138, 
      139, 140, 142, 165, 166, 167, 169, 173, 175, 176, 178, 179, 202 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 17, 21, 23, 24, 33, 36, 48, 49, 50, 52, 
      53, 54, 59, 60, 62, 63, 67, 77, 78, 87, 88, 95, 96, 98, 99, 100, 102, 
      103, 108, 110, 121, 122, 125, 137, 138, 140, 141, 144, 145, 147, 165, 
      167, 168, 176, 177, 186, 188, 203, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 21, 25, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 61, 62, 
      64, 71, 76, 77, 79, 82, 86, 87, 89, 96, 97, 98, 99, 101, 138, 139, 140, 
      142, 148, 150, 151, 165, 166, 167, 169, 173, 175, 176, 178, 179, 184, 
      207 ], 
  [ 1, 3, 6, 10, 21, 25, 48, 49, 50, 51, 52, 53, 55, 60, 61, 62, 64, 82, 86, 
      87, 89, 96, 97, 98, 99, 101, 138, 139, 140, 142, 150, 151, 173, 179 ], 
  [ 1, 2, 3, 4, 6, 8, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 28, 30, 31, 32, 38, 40, 42, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 
      60, 61, 62, 63, 64, 66, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 94, 95, 
      96, 97, 98, 99, 100, 101, 102, 103, 104, 107, 111, 112, 113, 114, 115, 
      116, 119, 124, 125, 126, 127, 131, 132, 137, 138, 139, 140, 141, 142, 
      145, 146, 147, 150, 151, 154, 172, 173, 179, 184, 186, 193, 198, 205 ], 
  [ 1, 10, 11, 15, 24, 48, 49, 50, 52, 53, 54, 95, 96, 98, 99, 100, 147 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 17, 21, 23, 24, 29, 33, 36, 48, 49, 50, 
      52, 53, 59, 60, 62, 67, 77, 87, 95, 96, 98, 99, 102, 103, 106, 108, 
      110, 120, 121, 122, 137, 138, 140, 144, 157, 165, 167, 176, 188 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 17, 21, 23, 24, 33, 48, 49, 50, 52, 53, 59, 
      60, 62, 87, 95, 96, 98, 99, 102, 103, 108, 110, 121, 137, 138, 140, 
      144, 165, 167, 176 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 21, 22, 23, 24, 25, 33, 40, 47, 48, 49, 
      50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 82, 86, 87, 88, 89, 95, 
      96, 97, 98, 99, 100, 101, 103, 104, 108, 110, 114, 115, 116, 118, 119, 
      137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 150, 151, 
      165, 166, 167, 168, 169, 173, 175, 176, 177, 178, 179, 184, 186, 198, 
      199, 205, 206, 207 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 17, 21, 22, 23, 24, 25, 30, 33, 40, 47, 
      48, 49, 50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 82, 86, 87, 88, 
      89, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 107, 108, 110, 111, 
      114, 115, 116, 118, 119, 121, 124, 125, 137, 138, 139, 140, 141, 142, 
      143, 144, 145, 146, 147, 148, 150, 151, 160, 165, 166, 167, 168, 169, 
      173, 175, 176, 177, 178, 179, 184, 186, 188, 189, 192, 198, 199, 202, 
      203, 205, 206, 207 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 17, 21, 22, 23, 24, 29, 33, 36, 37, 
      40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 67, 76, 
      77, 78, 79, 86, 87, 88, 89, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
      106, 108, 110, 111, 114, 115, 116, 117, 118, 120, 121, 122, 123, 124, 
      125, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 156, 157, 
      158, 159, 165, 166, 167, 168, 169, 173, 175, 176, 177, 178, 179, 181, 
      182, 186, 187, 188, 192, 198, 199, 200, 201, 202, 203, 205, 206 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 17, 21, 22, 23, 24, 33, 40, 47, 48, 49, 
      50, 51, 52, 53, 54, 55, 59, 60, 61, 62, 63, 64, 86, 87, 88, 89, 95, 96, 
      97, 98, 99, 100, 101, 102, 103, 108, 110, 111, 114, 115, 116, 118, 121, 
      124, 125, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 165, 
      166, 167, 168, 169, 173, 175, 176, 177, 178, 179, 186, 188, 198, 199, 
      202, 203, 205, 206 ], 
  [ 1, 10, 11, 13, 15, 18, 21, 23, 24, 47, 48, 49, 50, 51, 52, 53, 54, 55, 
      94, 95, 96, 97, 98, 99, 100, 101, 103, 112, 114, 115, 116, 126, 132, 
      137, 138, 139, 140, 141, 142, 145, 146, 147, 173, 186, 198, 205 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 18, 21, 22, 23, 24, 29, 33, 36, 37, 
      40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 64, 68, 
      76, 77, 78, 79, 80, 86, 87, 88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 
      103, 106, 108, 110, 112, 114, 115, 116, 117, 118, 126, 127, 128, 129, 
      130, 131, 132, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 
      156, 157, 158, 159, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 
      178, 179, 186, 193, 195, 198, 199, 204, 205, 206 ], 
  [ 1, 10, 11, 13, 15, 18, 21, 23, 24, 33, 47, 48, 49, 50, 51, 52, 53, 54, 
      55, 94, 95, 96, 97, 98, 99, 100, 101, 103, 108, 112, 114, 115, 116, 
      118, 126, 129, 132, 137, 138, 139, 140, 141, 142, 144, 145, 146, 147, 
      165, 166, 167, 168, 169, 173, 186, 193, 198, 199, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 29, 33, 
      36, 37, 40, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 
      64, 67, 68, 70, 76, 77, 78, 79, 80, 86, 87, 88, 89, 94, 95, 96, 97, 98, 
      99, 100, 101, 102, 103, 106, 108, 110, 111, 112, 113, 114, 115, 116, 
      117, 118, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 
      132, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 
      147, 156, 157, 158, 159, 165, 166, 167, 168, 169, 173, 174, 175, 176, 
      177, 178, 179, 181, 182, 186, 187, 188, 191, 192, 193, 194, 195, 197, 
      198, 199, 200, 201, 202, 203, 204, 205, 206 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 22, 23, 24, 33, 40, 47, 
      48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 64, 80, 86, 87, 
      88, 89, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 108, 110, 111, 112, 
      113, 114, 115, 116, 118, 121, 124, 125, 126, 127, 129, 131, 132, 135, 
      137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 165, 166, 167, 
      168, 169, 173, 174, 175, 176, 177, 178, 179, 186, 188, 192, 193, 195, 
      198, 199, 202, 203, 204, 205, 206 ], 
  [ 1, 10, 11, 13, 15, 21, 23, 24, 47, 48, 49, 50, 51, 52, 53, 54, 55, 95, 
      96, 97, 98, 99, 100, 101, 103, 114, 115, 116, 137, 138, 139, 140, 141, 
      142, 145, 146, 147, 173, 186, 205 ], 
  [ 1, 10, 11, 13, 15, 21, 23, 24, 33, 47, 48, 49, 50, 51, 52, 53, 54, 55, 
      95, 96, 97, 98, 99, 100, 101, 103, 108, 114, 115, 116, 118, 137, 138, 
      139, 140, 141, 142, 144, 145, 146, 147, 165, 166, 167, 168, 169, 173, 
      186, 198, 205, 206 ], 
  [ 1, 3, 5, 6, 10, 17, 21, 29, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 61, 
      62, 64, 67, 76, 77, 79, 86, 87, 89, 96, 97, 98, 99, 101, 120, 121, 124, 
      138, 139, 140, 142, 156, 157, 159, 165, 166, 167, 169, 173, 175, 176, 
      178, 179, 181, 202 ], 
  [ 1, 3, 5, 6, 10, 11, 12, 14, 15, 17, 21, 23, 24, 29, 33, 36, 48, 49, 50, 
      52, 53, 54, 59, 60, 62, 63, 67, 77, 78, 87, 88, 95, 96, 98, 99, 100, 
      102, 103, 106, 108, 110, 120, 121, 122, 125, 137, 138, 140, 141, 144, 
      145, 147, 157, 158, 165, 167, 168, 176, 177, 182, 186, 187, 188, 203, 
      205, 206 ], 
  [ 1, 3, 6, 10, 17, 21, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 61, 62, 64, 
      86, 87, 89, 96, 97, 98, 99, 101, 121, 124, 138, 139, 140, 142, 165, 
      166, 167, 169, 173, 175, 176, 178, 179 ], 
  [ 1, 3, 6, 10, 11, 12, 14, 15, 17, 21, 23, 24, 33, 48, 49, 50, 52, 53, 54, 
      59, 60, 62, 63, 87, 88, 95, 96, 98, 99, 100, 102, 103, 108, 110, 121, 
      125, 137, 138, 140, 141, 144, 145, 147, 165, 167, 168, 176, 177, 186, 
      188, 205, 206 ], 
  [ 1, 3, 6, 10, 11, 12, 13, 14, 15, 18, 21, 22, 23, 24, 33, 40, 47, 48, 49, 
      50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 64, 80, 86, 87, 88, 89, 
      94, 95, 96, 97, 98, 99, 100, 101, 103, 108, 110, 112, 114, 115, 116, 
      118, 126, 127, 129, 131, 132, 137, 138, 139, 140, 141, 142, 143, 144, 
      145, 146, 147, 165, 166, 167, 168, 169, 173, 174, 175, 176, 177, 178, 
      179, 186, 193, 195, 198, 199, 205, 206 ], 
  [ 1, 10, 11, 15, 21, 23, 24, 48, 49, 50, 52, 53, 54, 95, 96, 98, 99, 100, 
      103, 137, 138, 140, 141, 145, 147, 186 ], 
  [ 1, 10, 11, 15, 21, 23, 24, 33, 48, 49, 50, 52, 53, 54, 95, 96, 98, 99, 
      100, 103, 108, 137, 138, 140, 141, 144, 145, 147, 165, 167, 168, 186, 
      205 ], 
  [ 1, 3, 6, 10, 21, 25, 33, 48, 49, 50, 51, 52, 53, 55, 59, 60, 61, 62, 64, 
      82, 86, 87, 89, 96, 97, 98, 99, 101, 138, 139, 140, 142, 148, 150, 151, 
      165, 166, 167, 169, 173, 175, 176, 178, 179, 184 ] ]
gap> S := Semigroup([
> Transformation([1, 3, 5, 5, 3]), Transformation([4, 5, 5, 5, 2])]);;
gap> l := LatticeOfCongruences(S);
[ [  ], [ 1, 9, 15, 16, 32, 37, 38, 86, 93, 96, 123, 156 ], 
  [ 1, 2, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 30, 
      31, 32, 33, 35, 37, 38, 40, 41, 42, 46, 48, 49, 50, 52, 53, 54, 59, 62, 
      69, 70, 77, 78, 79, 80, 83, 84, 85, 86, 87, 88, 89, 90, 93, 94, 96, 98, 
      99, 102, 103, 104, 106, 110, 111, 112, 113, 115, 118, 119, 122, 123, 
      124, 128, 131, 135, 136, 137, 138, 139, 141, 143, 144, 155, 156, 163, 
      165, 175, 177, 179, 181, 182, 183, 186, 187, 190, 195, 196, 200, 202, 
      204, 206, 209, 210, 215, 216, 221, 223 ], 
  [ 1, 2, 3, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 
      24, 25, 26, 28, 29, 30, 31, 32, 33, 35, 37, 38, 40, 41, 42, 46, 47, 48, 
      49, 50, 52, 53, 54, 55, 56, 58, 59, 62, 65, 68, 69, 70, 72, 73, 74, 75, 
      76, 77, 78, 79, 80, 82, 83, 84, 85, 86, 87, 88, 89, 90, 92, 93, 94, 96, 
      98, 99, 102, 103, 104, 105, 106, 109, 110, 111, 112, 113, 114, 115, 
      118, 119, 121, 122, 123, 124, 127, 128, 130, 131, 132, 133, 135, 136, 
      137, 138, 139, 140, 141, 143, 144, 145, 146, 147, 148, 149, 150, 151, 
      152, 153, 154, 155, 156, 160, 162, 163, 164, 165, 166, 168, 169, 170, 
      172, 173, 174, 175, 176, 177, 178, 179, 181, 182, 183, 184, 185, 186, 
      187, 189, 190, 192, 193, 195, 196, 198, 199, 200, 201, 202, 203, 204, 
      205, 206, 207, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 
      220, 221, 222, 223, 224 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 
      22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 
      40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 
      58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 
      76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 
      94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 
      109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 
      123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 
      137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 
      151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 
      165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 
      179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 
      193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 
      207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 
      221, 222, 223, 224, 225 ], 
  [ 1, 8, 13, 15, 16, 21, 23, 32, 77, 79, 80, 110, 118, 119, 137, 177 ], 
  [ 1, 6, 8, 13, 15, 16, 21, 23, 28, 32, 68, 77, 79, 80, 82, 110, 118, 119, 
      121, 137, 177, 178 ], [ 1, 13, 15, 32 ], [ 1, 15 ], 
  [ 1, 8, 13, 15, 31, 32 ], 
  [ 1, 6, 8, 10, 13, 15, 16, 18, 19, 20, 21, 23, 31, 32, 35, 38, 40, 42, 70, 
      77, 78, 79, 80, 84, 85, 102, 103, 104, 106, 110, 118, 119, 124, 131, 
      136, 137, 139, 177, 182, 200, 202 ], 
  [ 1, 6, 7, 8, 10, 11, 13, 15, 16, 18, 19, 20, 21, 23, 25, 26, 27, 28, 31, 
      32, 35, 36, 38, 39, 40, 42, 43, 44, 67, 68, 70, 71, 73, 75, 77, 78, 79, 
      80, 81, 82, 84, 85, 102, 103, 104, 105, 106, 107, 108, 109, 110, 118, 
      119, 120, 121, 124, 125, 130, 131, 132, 133, 134, 136, 137, 139, 142, 
      147, 150, 152, 174, 177, 178, 180, 182, 185, 200, 201, 202, 203, 208, 
      214 ], [ 1 ], [ 1, 8, 9, 10, 13, 15, 30, 31, 32, 37, 83, 93 ], [ 1 ], 
  [ 1, 15, 32 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 21, 23, 30, 32, 77, 79, 80, 86, 89, 90, 93, 110, 
      118, 119, 122, 135, 137, 143, 177, 187, 195, 209 ], 
  [ 1, 6, 8, 10, 13, 15, 16, 21, 23, 31, 32, 77, 79, 80, 102, 103, 104, 110, 
      118, 119, 136, 137, 177, 200 ], [ 1, 13, 31 ], 
  [ 1, 8, 10, 13, 15, 16, 19, 31, 32, 38, 77, 78, 84, 102, 106 ], [ 1 ], 
  [ 1, 6, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 23, 30, 31, 32, 37, 69, 77, 
      79, 80, 83, 86, 89, 90, 93, 102, 103, 104, 110, 111, 112, 113, 118, 
      119, 122, 123, 135, 136, 137, 138, 143, 144, 177, 179, 181, 183, 187, 
      195, 200, 204, 209, 210, 221 ], [ 1, 15, 32 ], 
  [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 28, 30, 32, 68, 77, 79, 80, 82, 
      86, 89, 90, 92, 93, 110, 118, 119, 121, 122, 127, 135, 137, 143, 148, 
      177, 178, 187, 189, 195, 209, 211 ], 
  [ 1, 6, 7, 8, 10, 13, 15, 16, 18, 21, 23, 28, 31, 32, 68, 77, 79, 80, 82, 
      102, 103, 104, 105, 110, 118, 119, 121, 130, 136, 137, 177, 178, 200, 
      201 ], 
  [ 1, 6, 7, 8, 10, 11, 13, 15, 16, 18, 19, 20, 21, 23, 25, 28, 31, 32, 35, 
      38, 40, 42, 68, 70, 73, 75, 77, 78, 79, 80, 82, 84, 85, 102, 103, 104, 
      105, 106, 109, 110, 118, 119, 121, 124, 130, 131, 132, 133, 136, 137, 
      139, 147, 150, 152, 174, 177, 178, 182, 185, 200, 201, 202, 203, 214 ], 
  [ 1, 13, 19, 31 ], [ 1, 15, 23, 32 ], 
  [ 1, 6, 7, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 24, 25, 28, 30, 
      31, 32, 37, 68, 69, 74, 77, 79, 80, 82, 83, 86, 89, 90, 92, 93, 102, 
      103, 104, 105, 110, 111, 112, 113, 114, 118, 119, 121, 122, 123, 127, 
      130, 135, 136, 137, 138, 140, 143, 144, 148, 151, 173, 177, 178, 179, 
      181, 183, 184, 187, 189, 195, 200, 201, 204, 205, 209, 210, 211, 212, 
      221, 222 ], [ 1, 8, 9, 13, 15, 32, 93 ], [ 1, 13 ], [ 1, 15 ], 
  [ 1, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 30, 31, 
      32, 35, 37, 38, 40, 41, 42, 69, 70, 77, 78, 79, 80, 83, 84, 85, 86, 87, 
      88, 89, 90, 93, 94, 96, 98, 99, 102, 103, 104, 106, 110, 111, 112, 113, 
      115, 118, 119, 122, 123, 124, 128, 131, 135, 136, 137, 138, 139, 141, 
      143, 144, 155, 156, 175, 177, 179, 181, 182, 183, 186, 187, 190, 195, 
      196, 200, 202, 204, 206, 209, 210, 215, 216, 221, 223 ], 
  [ 1, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 
      24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 35, 36, 37, 38, 39, 40, 41, 42, 
      43, 44, 45, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 
      82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 
      100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 
      114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 
      128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 
      142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 
      156, 157, 158, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 
      184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 
      198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 
      212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225 ], 
  [ 1, 6, 8, 13, 15, 16, 21, 23, 32, 38, 70, 77, 79, 80, 84, 110, 118, 119, 
      137, 139, 177, 182 ], 
  [ 1, 6, 7, 8, 13, 15, 16, 21, 23, 28, 32, 35, 38, 39, 43, 68, 70, 73, 75, 
      77, 79, 80, 82, 84, 110, 118, 119, 121, 137, 139, 150, 152, 174, 177, 
      178, 182, 185 ], [ 1, 9, 15, 32, 93 ], [ 1, 15, 16, 32 ], 
  [ 1, 6, 7, 8, 13, 15, 16, 21, 23, 28, 32, 68, 77, 79, 80, 82, 110, 118, 
      119, 121, 137, 177, 178 ], [ 1, 13, 19, 21, 31, 110, 136 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 30, 32, 35, 37, 38, 69, 70, 77, 79, 
      80, 83, 84, 86, 89, 90, 93, 94, 96, 110, 118, 119, 122, 123, 128, 135, 
      137, 138, 139, 143, 144, 155, 156, 175, 177, 179, 181, 182, 183, 186, 
      187, 195, 196, 209, 210, 215, 216, 221, 223 ], 
  [ 1, 8, 10, 13, 15, 19, 23, 31, 32, 78, 80, 104 ], 
  [ 1, 6, 7, 8, 13, 15, 16, 21, 23, 28, 32, 38, 39, 68, 70, 75, 77, 79, 80, 
      82, 84, 110, 118, 119, 121, 137, 139, 152, 174, 177, 178, 182, 185 ], 
  [ 1, 8, 10, 13, 15, 19, 23, 27, 28, 31, 32, 42, 78, 80, 81, 82, 104, 105, 
      132, 142 ], 
  [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 35, 36, 37, 38, 
      39, 41, 43, 68, 69, 70, 73, 74, 75, 76, 77, 79, 80, 82, 83, 84, 86, 89, 
      90, 92, 93, 94, 95, 96, 97, 100, 110, 118, 119, 121, 122, 123, 127, 
      128, 135, 137, 138, 139, 143, 144, 145, 146, 148, 150, 151, 152, 153, 
      155, 156, 157, 158, 173, 174, 175, 176, 177, 178, 179, 181, 182, 183, 
      184, 185, 186, 187, 189, 195, 196, 198, 199, 209, 210, 211, 212, 213, 
      215, 216, 218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 2, 6, 8, 9, 13, 15, 16, 17, 21, 23, 30, 32, 37, 38, 48, 54, 69, 70, 
      77, 79, 80, 83, 84, 86, 89, 90, 93, 96, 110, 118, 119, 122, 123, 128, 
      135, 137, 138, 139, 143, 144, 155, 156, 163, 175, 177, 179, 181, 182, 
      183, 186, 187, 195, 196, 209, 210, 215, 216, 221, 223 ], 
  [ 1, 2, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 37, 38, 46, 48, 
      54, 58, 68, 69, 70, 74, 75, 77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 
      96, 110, 118, 119, 121, 122, 123, 127, 128, 135, 137, 138, 139, 143, 
      144, 146, 148, 151, 152, 155, 156, 160, 163, 164, 173, 174, 175, 176, 
      177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 195, 196, 199, 
      209, 210, 211, 212, 213, 215, 216, 218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 2, 8, 9, 13, 15, 16, 30, 32, 37, 38, 77, 83, 84, 86, 93, 96, 122, 123, 
      155, 156, 179, 186 ], 
  [ 1, 2, 8, 9, 10, 13, 14, 15, 16, 30, 31, 32, 37, 38, 48, 77, 83, 84, 86, 
      93, 96, 102, 106, 111, 115, 122, 123, 155, 156, 179, 186 ], 
  [ 1, 2, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 30, 
      31, 32, 33, 35, 37, 38, 40, 41, 42, 46, 48, 49, 52, 53, 54, 59, 62, 69, 
      70, 77, 78, 79, 80, 83, 84, 85, 86, 87, 88, 89, 90, 93, 94, 96, 98, 99, 
      102, 103, 104, 106, 110, 111, 112, 113, 115, 118, 119, 122, 123, 124, 
      128, 131, 135, 136, 137, 138, 139, 141, 143, 144, 155, 156, 163, 165, 
      175, 177, 179, 181, 182, 183, 186, 187, 190, 195, 196, 200, 202, 204, 
      206, 209, 210, 215, 216, 221, 223 ], 
  [ 1, 2, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 
      24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 
      42, 43, 44, 45, 46, 47, 48, 49, 50, 52, 53, 54, 55, 56, 57, 58, 59, 60, 
      61, 62, 63, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 
      82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 
      100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 
      114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 
      128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 
      142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 
      156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 
      170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 
      184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 
      198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 
      212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225 ], 
  [ 1, 2, 6, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 30, 31, 32, 37, 
      38, 46, 48, 49, 54, 69, 70, 77, 79, 80, 83, 84, 86, 89, 90, 93, 96, 
      102, 103, 104, 106, 110, 111, 112, 113, 115, 118, 119, 122, 123, 128, 
      131, 135, 136, 137, 138, 139, 141, 143, 144, 155, 156, 163, 165, 175, 
      177, 179, 181, 182, 183, 186, 187, 195, 196, 200, 202, 204, 206, 209, 
      210, 215, 216, 221, 223 ], 
  [ 1, 2, 8, 9, 10, 13, 14, 15, 16, 19, 20, 30, 31, 32, 37, 38, 48, 49, 77, 
      78, 83, 84, 86, 87, 88, 93, 96, 102, 106, 111, 115, 122, 123, 155, 156, 
      179, 186 ], 
  [ 1, 2, 9, 15, 16, 21, 23, 32, 37, 38, 86, 89, 90, 93, 96, 118, 119, 123, 
      137, 138, 139, 144, 156, 187, 195, 196, 210, 216 ], 
  [ 1, 2, 6, 7, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 24, 25, 28, 29, 
      30, 31, 32, 37, 38, 46, 47, 48, 49, 52, 54, 58, 68, 69, 70, 74, 75, 77, 
      79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 96, 102, 103, 104, 105, 106, 
      110, 111, 112, 113, 114, 115, 118, 119, 121, 122, 123, 127, 128, 130, 
      131, 135, 136, 137, 138, 139, 140, 141, 143, 144, 146, 147, 148, 151, 
      152, 154, 155, 156, 160, 163, 164, 165, 166, 169, 173, 174, 175, 176, 
      177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 195, 196, 199, 
      200, 201, 202, 203, 204, 205, 206, 207, 209, 210, 211, 212, 213, 214, 
      215, 216, 217, 218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 2, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 26, 28, 29, 30, 31, 32, 33, 35, 37, 38, 40, 41, 42, 46, 47, 48, 49, 
      50, 52, 53, 54, 55, 58, 59, 62, 68, 69, 70, 72, 73, 74, 75, 76, 77, 78, 
      79, 80, 82, 83, 84, 85, 86, 87, 88, 89, 90, 92, 93, 94, 96, 98, 99, 
      102, 103, 104, 105, 106, 109, 110, 111, 112, 113, 114, 115, 118, 119, 
      121, 122, 123, 124, 127, 128, 130, 131, 132, 133, 135, 136, 137, 138, 
      139, 140, 141, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 
      154, 155, 156, 160, 162, 163, 164, 165, 166, 168, 169, 170, 172, 173, 
      174, 175, 176, 177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 
      190, 192, 193, 195, 196, 198, 199, 200, 201, 202, 203, 204, 205, 206, 
      207, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 
      222, 223, 224 ], 
  [ 1, 2, 8, 9, 10, 13, 14, 15, 16, 19, 20, 27, 30, 31, 32, 37, 38, 48, 49, 
      53, 77, 78, 81, 83, 84, 86, 87, 88, 91, 93, 96, 102, 106, 111, 115, 
      120, 122, 123, 155, 156, 179, 186, 188 ], 
  [ 1, 2, 9, 15, 16, 21, 23, 28, 32, 37, 38, 54, 86, 89, 90, 92, 93, 96, 118, 
      119, 121, 123, 137, 138, 139, 144, 151, 152, 156, 187, 189, 195, 196, 
      199, 210, 212, 216, 219 ], 
  [ 1, 2, 6, 8, 9, 13, 15, 16, 17, 21, 23, 30, 32, 35, 37, 38, 41, 46, 48, 
      54, 69, 70, 77, 79, 80, 83, 84, 86, 89, 90, 93, 94, 96, 110, 118, 119, 
      122, 123, 128, 135, 137, 138, 139, 143, 144, 155, 156, 163, 175, 177, 
      179, 181, 182, 183, 186, 187, 195, 196, 209, 210, 215, 216, 221, 223 ], 
  [ 1, 2, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 35, 36, 37, 38, 
      39, 41, 43, 45, 46, 47, 48, 54, 58, 59, 61, 68, 69, 70, 73, 74, 75, 76, 
      77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 94, 95, 96, 97, 100, 110, 
      118, 119, 121, 122, 123, 127, 128, 135, 137, 138, 139, 143, 144, 145, 
      146, 148, 150, 151, 152, 153, 155, 156, 157, 158, 160, 162, 163, 164, 
      172, 173, 174, 175, 176, 177, 178, 179, 181, 182, 183, 184, 185, 186, 
      187, 189, 195, 196, 198, 199, 209, 210, 211, 212, 213, 215, 216, 218, 
      219, 220, 221, 222, 223, 224 ], 
  [ 1, 2, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 37, 38, 39, 43, 
      46, 47, 48, 54, 58, 68, 69, 70, 74, 75, 77, 79, 80, 82, 83, 84, 86, 89, 
      90, 92, 93, 96, 97, 100, 110, 118, 119, 121, 122, 123, 127, 128, 135, 
      137, 138, 139, 143, 144, 146, 148, 151, 152, 155, 156, 157, 158, 160, 
      163, 164, 173, 174, 175, 176, 177, 178, 179, 181, 182, 183, 184, 185, 
      186, 187, 189, 195, 196, 199, 209, 210, 211, 212, 213, 215, 216, 218, 
      219, 220, 221, 222, 223, 224 ], 
  [ 1, 2, 8, 9, 10, 13, 14, 15, 16, 19, 20, 21, 23, 30, 31, 32, 37, 38, 40, 
      42, 48, 49, 53, 54, 77, 78, 79, 80, 83, 84, 85, 86, 87, 88, 89, 90, 93, 
      96, 98, 99, 102, 103, 104, 106, 110, 111, 112, 113, 115, 118, 119, 122, 
      123, 124, 135, 136, 137, 138, 139, 143, 144, 155, 156, 163, 165, 177, 
      179, 181, 182, 183, 186, 187, 190, 195, 196, 200, 202, 204, 206, 209, 
      210, 215, 216, 221, 223 ], 
  [ 1, 2, 8, 9, 10, 13, 14, 15, 16, 19, 20, 21, 23, 27, 28, 30, 31, 32, 37, 
      38, 40, 42, 44, 48, 49, 53, 54, 57, 58, 62, 77, 78, 79, 80, 81, 82, 83, 
      84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 96, 98, 99, 101, 102, 103, 104, 
      105, 106, 110, 111, 112, 113, 114, 115, 118, 119, 120, 121, 122, 123, 
      124, 125, 132, 133, 134, 135, 136, 137, 138, 139, 142, 143, 144, 148, 
      151, 152, 155, 156, 163, 164, 165, 166, 170, 171, 177, 178, 179, 180, 
      181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 
      195, 196, 197, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 
      210, 211, 212, 215, 216, 218, 219, 221, 222, 223, 224, 225 ], 
  [ 1, 2, 3, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 27, 
      30, 31, 32, 33, 35, 37, 38, 40, 41, 42, 46, 48, 49, 50, 52, 53, 54, 57, 
      59, 62, 67, 69, 70, 77, 78, 79, 80, 81, 83, 84, 85, 86, 87, 88, 89, 90, 
      91, 93, 94, 96, 98, 99, 102, 103, 104, 106, 110, 111, 112, 113, 115, 
      118, 119, 120, 122, 123, 124, 126, 128, 131, 134, 135, 136, 137, 138, 
      139, 141, 142, 143, 144, 155, 156, 159, 163, 165, 171, 175, 177, 179, 
      180, 181, 182, 183, 186, 187, 188, 190, 194, 195, 196, 197, 200, 202, 
      204, 206, 208, 209, 210, 215, 216, 221, 223, 225 ], 
  [ 1, 2, 3, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 28, 
      30, 31, 32, 33, 35, 37, 38, 40, 41, 42, 46, 48, 49, 50, 52, 53, 54, 58, 
      59, 62, 68, 69, 70, 77, 78, 79, 80, 82, 83, 84, 85, 86, 87, 88, 89, 90, 
      92, 93, 94, 96, 98, 99, 102, 103, 104, 105, 106, 109, 110, 111, 112, 
      113, 114, 115, 118, 119, 121, 122, 123, 124, 127, 128, 130, 131, 132, 
      133, 135, 136, 137, 138, 139, 140, 141, 143, 144, 148, 149, 150, 151, 
      152, 153, 155, 156, 160, 163, 164, 165, 166, 168, 169, 170, 172, 173, 
      174, 175, 177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 190, 
      192, 193, 195, 196, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 
      209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 
      223, 224 ], 
  [ 1, 2, 3, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 27, 
      28, 30, 31, 32, 33, 35, 37, 38, 40, 41, 42, 44, 46, 48, 49, 50, 52, 53, 
      54, 57, 58, 59, 62, 63, 64, 65, 67, 68, 69, 70, 71, 77, 78, 79, 80, 81, 
      82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 96, 98, 99, 101, 
      102, 103, 104, 105, 106, 109, 110, 111, 112, 113, 114, 115, 118, 119, 
      120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 
      134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 148, 149, 150, 
      151, 152, 153, 155, 156, 159, 160, 161, 163, 164, 165, 166, 168, 169, 
      170, 171, 172, 173, 174, 175, 177, 178, 179, 180, 181, 182, 183, 184, 
      185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 
      199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 
      213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225 ], 
  [ 1, 6, 8, 10, 11, 13, 15, 16, 18, 19, 20, 21, 23, 27, 31, 32, 35, 38, 40, 
      42, 70, 77, 78, 79, 80, 81, 84, 85, 102, 103, 104, 106, 110, 118, 119, 
      120, 124, 131, 134, 136, 137, 139, 142, 177, 180, 182, 200, 202, 208 ], 
  [ 1, 6, 8, 13, 15, 16, 21, 23, 28, 32, 77, 79, 80, 82, 110, 118, 119, 121, 
      137, 177, 178 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 30, 32, 37, 77, 79, 80, 83, 86, 89, 
      90, 93, 110, 118, 119, 122, 123, 135, 137, 138, 143, 144, 177, 179, 
      181, 183, 187, 195, 209, 210, 221 ], 
  [ 1, 6, 8, 13, 15, 16, 21, 23, 32, 38, 77, 79, 80, 84, 110, 118, 119, 137, 
      139, 177, 182 ], 
  [ 1, 6, 8, 10, 11, 13, 15, 16, 18, 19, 20, 21, 23, 27, 28, 31, 32, 35, 38, 
      40, 42, 44, 67, 68, 70, 77, 78, 79, 80, 81, 82, 84, 85, 102, 103, 104, 
      105, 106, 109, 110, 118, 119, 120, 121, 124, 125, 130, 131, 132, 133, 
      134, 136, 137, 139, 142, 150, 152, 174, 177, 178, 180, 182, 185, 200, 
      201, 202, 203, 208, 214 ], 
  [ 1, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 
      25, 26, 28, 29, 30, 31, 32, 33, 35, 37, 38, 40, 41, 42, 68, 69, 70, 73, 
      74, 75, 76, 77, 78, 79, 80, 82, 83, 84, 85, 86, 87, 88, 89, 90, 92, 93, 
      94, 96, 98, 99, 102, 103, 104, 105, 106, 109, 110, 111, 112, 113, 114, 
      115, 118, 119, 121, 122, 123, 124, 127, 128, 130, 131, 132, 133, 135, 
      136, 137, 138, 139, 140, 141, 143, 144, 145, 146, 147, 148, 149, 150, 
      151, 152, 153, 154, 155, 156, 173, 174, 175, 176, 177, 178, 179, 181, 
      182, 183, 184, 185, 186, 187, 189, 190, 192, 193, 195, 196, 198, 199, 
      200, 201, 202, 203, 204, 205, 206, 207, 209, 210, 211, 212, 213, 214, 
      215, 216, 217, 218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 6, 7, 8, 13, 15, 16, 21, 23, 28, 32, 35, 38, 68, 70, 75, 77, 79, 80, 
      82, 84, 110, 118, 119, 121, 137, 139, 150, 152, 174, 177, 178, 182, 185 
     ], [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 37, 68, 69, 
      77, 79, 80, 82, 83, 86, 89, 90, 92, 93, 110, 118, 119, 121, 122, 123, 
      127, 135, 137, 138, 143, 144, 148, 151, 173, 177, 178, 179, 181, 183, 
      184, 187, 189, 195, 209, 210, 211, 212, 221, 222 ], 
  [ 1, 6, 7, 8, 13, 15, 16, 21, 23, 28, 32, 38, 68, 70, 77, 79, 80, 82, 84, 
      110, 118, 119, 121, 137, 139, 152, 174, 177, 178, 182, 185 ], 
  [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 35, 37, 38, 41, 
      68, 69, 70, 73, 74, 75, 77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 94, 
      96, 110, 118, 119, 121, 122, 123, 127, 128, 135, 137, 138, 139, 143, 
      144, 145, 146, 148, 150, 151, 152, 153, 155, 156, 173, 174, 175, 176, 
      177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 195, 196, 198, 
      199, 209, 210, 211, 212, 213, 215, 216, 218, 219, 220, 221, 222, 223, 
      224 ], [ 1, 8, 13, 15, 16, 32 ], [ 1, 8, 10, 13, 15, 19, 31, 32 ], 
  [ 1, 8, 13, 15, 21, 32, 110, 118, 137 ], [ 1, 8, 13, 15, 23, 32 ], 
  [ 1, 8, 10, 13, 15, 19, 27, 31, 32, 78 ], [ 1, 8, 13, 15, 23, 28, 32, 80 ], 
  [ 1, 8, 9, 13, 15, 30, 32, 37, 93 ], [ 1, 8, 13, 15, 16, 32, 38, 77 ], 
  [ 1, 8, 10, 13, 15, 19, 21, 31, 32, 40, 78, 79, 103, 110, 118, 136, 137 ], 
  [ 1, 9, 15, 16, 32, 93 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 19, 30, 31, 32, 37, 78, 83, 93 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 19, 20, 30, 31, 32, 37, 38, 77, 78, 83, 84, 
      86, 87, 93, 96, 102, 106, 111, 115, 122, 123, 155, 156, 179, 186 ], 
  [ 1, 9, 15, 21, 118 ], [ 1, 9, 15, 23, 32, 93 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 19, 27, 30, 31, 32, 37, 78, 81, 83, 87, 93 ], 
  [ 1, 9, 15, 23, 28, 32, 90, 93 ], [ 1, 9, 15, 32 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 30, 32, 35, 38, 70, 77, 79, 80, 84, 
      86, 89, 90, 93, 96, 110, 118, 119, 122, 128, 135, 137, 139, 143, 155, 
      177, 182, 187, 195, 196, 209, 215 ], 
  [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 35, 36, 38, 39, 
      43, 68, 70, 73, 75, 77, 79, 80, 82, 84, 86, 89, 90, 92, 93, 94, 96, 97, 
      100, 110, 118, 119, 121, 122, 127, 128, 135, 137, 139, 143, 145, 146, 
      148, 150, 152, 155, 174, 177, 178, 182, 185, 187, 189, 195, 196, 198, 
      199, 209, 211, 213, 215, 218 ], [ 1, 9, 15, 16, 32, 38, 86, 93 ], 
  [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 39, 68, 77, 79, 
      80, 82, 86, 89, 90, 92, 93, 110, 118, 119, 121, 122, 127, 135, 137, 
      143, 148, 177, 178, 187, 189, 195, 209, 211 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 19, 21, 30, 31, 32, 37, 40, 78, 79, 83, 85, 87, 
      89, 93, 103, 110, 112, 118, 135, 136, 137, 138, 181, 195 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 19, 23, 30, 31, 32, 37, 42, 78, 80, 83, 87, 90, 
      93, 104, 113, 143, 144, 183 ], 
  [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 38, 39, 43, 68, 
      70, 75, 77, 79, 80, 82, 84, 86, 89, 90, 92, 93, 96, 97, 110, 118, 119, 
      121, 122, 127, 128, 135, 137, 139, 143, 146, 148, 152, 155, 174, 177, 
      178, 182, 185, 187, 189, 195, 196, 199, 209, 211, 213, 215, 218 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 19, 23, 27, 28, 30, 31, 32, 37, 42, 44, 78, 80, 
      81, 82, 83, 87, 90, 91, 92, 93, 99, 104, 105, 113, 114, 132, 142, 143, 
      144, 148, 151, 183, 184, 192, 197 ], 
  [ 1, 8, 10, 13, 15, 16, 31, 32, 77 ], 
  [ 1, 8, 10, 13, 15, 21, 31, 32, 79, 110, 118, 136, 137 ], 
  [ 1, 8, 10, 13, 15, 23, 31, 32, 80 ], 
  [ 1, 8, 10, 13, 15, 23, 28, 31, 32, 80, 82, 104 ], 
  [ 1, 8, 10, 13, 15, 16, 31, 32, 38, 77, 84, 102 ], 
  [ 1, 6, 7, 8, 10, 13, 15, 16, 18, 21, 23, 25, 28, 31, 32, 39, 68, 77, 79, 
      80, 82, 102, 103, 104, 105, 110, 118, 119, 121, 130, 136, 137, 177, 
      178, 200, 201 ], 
  [ 1, 6, 7, 8, 10, 13, 15, 16, 18, 21, 23, 25, 28, 31, 32, 38, 39, 43, 68, 
      70, 75, 77, 79, 80, 82, 84, 102, 103, 104, 105, 106, 107, 110, 118, 
      119, 121, 130, 131, 136, 137, 139, 147, 152, 174, 177, 178, 182, 185, 
      200, 201, 202, 203, 214 ], 
  [ 1, 6, 8, 10, 11, 13, 15, 16, 18, 19, 20, 21, 23, 28, 31, 32, 35, 38, 40, 
      42, 68, 70, 77, 78, 79, 80, 82, 84, 85, 102, 103, 104, 105, 106, 110, 
      118, 119, 121, 124, 130, 131, 132, 133, 136, 137, 139, 150, 152, 174, 
      177, 178, 182, 185, 200, 201, 202, 203, 214 ], [ 1, 13, 21 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 30, 31, 32, 37, 77, 83, 86, 93, 102, 122, 
      123, 179 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 21, 30, 31, 32, 37, 79, 83, 89, 93, 103, 110, 
      118, 135, 136, 137, 138, 181, 195 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 23, 30, 31, 32, 37, 80, 83, 90, 93, 104, 143, 
      144, 183 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 23, 28, 30, 31, 32, 37, 80, 82, 83, 90, 92, 93, 
      104, 105, 113, 143, 144, 148, 151, 183, 184 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 30, 31, 32, 37, 38, 77, 83, 84, 86, 93, 96, 
      102, 106, 111, 122, 123, 155, 156, 179, 186 ], 
  [ 1, 6, 7, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 24, 25, 28, 29, 
      30, 31, 32, 37, 39, 68, 69, 74, 77, 79, 80, 82, 83, 86, 89, 90, 92, 93, 
      97, 102, 103, 104, 105, 107, 110, 111, 112, 113, 114, 118, 119, 121, 
      122, 123, 127, 130, 135, 136, 137, 138, 140, 143, 144, 148, 151, 157, 
      173, 177, 178, 179, 181, 183, 184, 187, 189, 195, 200, 201, 204, 205, 
      209, 210, 211, 212, 221, 222 ], 
  [ 1, 6, 7, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 24, 25, 28, 29, 
      30, 31, 32, 37, 38, 39, 43, 68, 69, 70, 74, 75, 77, 79, 80, 82, 83, 84, 
      86, 89, 90, 92, 93, 96, 97, 100, 102, 103, 104, 105, 106, 107, 108, 
      110, 111, 112, 113, 114, 115, 116, 118, 119, 121, 122, 123, 127, 128, 
      130, 131, 135, 136, 137, 138, 139, 140, 141, 143, 144, 146, 147, 148, 
      151, 152, 154, 155, 156, 157, 158, 173, 174, 175, 176, 177, 178, 179, 
      181, 182, 183, 184, 185, 186, 187, 189, 195, 196, 199, 200, 201, 202, 
      203, 204, 205, 206, 207, 209, 210, 211, 212, 213, 214, 215, 216, 217, 
      218, 219, 220, 221, 222, 223, 224 ], [ 1, 15, 21 ], 
  [ 1, 15, 16, 21, 23, 32, 118, 137 ], 
  [ 1, 8, 10, 13, 15, 16, 19, 20, 27, 31, 32, 38, 77, 78, 81, 84, 102, 106 ], 
  [ 1, 15, 16, 21, 23, 28, 32, 118, 119, 137 ], 
  [ 1, 8, 9, 13, 15, 16, 30, 32, 77, 86, 93 ], 
  [ 1, 9, 15, 16, 32, 37, 86, 93 ], 
  [ 1, 8, 10, 13, 15, 16, 19, 20, 21, 23, 31, 32, 38, 40, 42, 77, 78, 79, 80, 
      84, 85, 102, 103, 104, 106, 110, 118, 119, 136, 137, 139, 177, 182, 
      200, 202 ], 
  [ 1, 8, 10, 13, 15, 16, 19, 20, 21, 23, 27, 28, 31, 32, 38, 40, 42, 44, 77, 
      78, 79, 80, 81, 82, 84, 85, 102, 103, 104, 105, 106, 110, 118, 119, 
      120, 121, 124, 132, 133, 134, 136, 137, 139, 142, 152, 177, 178, 180, 
      182, 185, 200, 201, 202, 203, 208 ], 
  [ 1, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 27, 30, 
      31, 32, 33, 35, 37, 38, 40, 41, 42, 67, 69, 70, 77, 78, 79, 80, 81, 83, 
      84, 85, 86, 87, 88, 89, 90, 91, 93, 94, 96, 98, 99, 102, 103, 104, 106, 
      110, 111, 112, 113, 115, 118, 119, 120, 122, 123, 124, 128, 131, 134, 
      135, 136, 137, 138, 139, 141, 142, 143, 144, 155, 156, 175, 177, 179, 
      180, 181, 182, 183, 186, 187, 188, 190, 194, 195, 196, 197, 200, 202, 
      204, 206, 208, 209, 210, 215, 216, 221, 223, 225 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 28, 30, 32, 68, 77, 79, 80, 82, 86, 
      89, 90, 92, 93, 110, 118, 119, 121, 122, 135, 137, 143, 148, 177, 178, 
      187, 189, 195, 209, 211 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 30, 32, 38, 70, 77, 79, 80, 84, 86, 
      89, 90, 93, 96, 110, 118, 119, 122, 135, 137, 139, 143, 155, 177, 182, 
      187, 195, 196, 209, 215 ], 
  [ 1, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 27, 28, 
      30, 31, 32, 33, 35, 37, 38, 40, 41, 42, 44, 67, 68, 69, 70, 71, 77, 78, 
      79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 96, 98, 
      99, 101, 102, 103, 104, 105, 106, 109, 110, 111, 112, 113, 114, 115, 
      118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 130, 131, 132, 
      133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 148, 149, 
      150, 151, 152, 153, 155, 156, 173, 174, 175, 177, 178, 179, 180, 181, 
      182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 
      196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 
      210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 
      224, 225 ], 
  [ 1, 6, 8, 10, 13, 15, 16, 18, 21, 23, 28, 31, 32, 68, 77, 79, 80, 82, 102, 
      103, 104, 105, 110, 118, 119, 121, 136, 137, 177, 178, 200, 201 ], 
  [ 1, 6, 8, 10, 13, 15, 16, 18, 21, 23, 31, 32, 38, 70, 77, 79, 80, 84, 102, 
      103, 104, 106, 110, 118, 119, 136, 137, 139, 177, 182, 200, 202 ], 
  [ 1, 8, 10, 13, 15, 19, 23, 28, 31, 32, 42, 78, 80, 82, 104, 105 ], 
  [ 1, 8, 10, 13, 15, 16, 19, 20, 21, 23, 28, 31, 32, 38, 40, 42, 77, 78, 79, 
      80, 82, 84, 85, 102, 103, 104, 105, 106, 110, 118, 119, 121, 124, 132, 
      136, 137, 139, 152, 177, 178, 182, 185, 200, 201, 202, 203 ], 
  [ 1, 13, 19, 21, 27, 31, 40, 110, 136 ], 
  [ 1, 8, 9, 13, 15, 21, 30, 32, 79, 89, 93, 110, 118, 137, 195 ], 
  [ 1, 13, 21, 31, 110 ], [ 1, 15, 21, 32, 118 ], 
  [ 1, 9, 15, 21, 32, 37, 89, 93, 118, 137, 195 ], 
  [ 1, 15, 16, 21, 23, 32, 38, 118, 119, 137 ], 
  [ 1, 6, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 28, 30, 31, 32, 37, 
      68, 69, 77, 79, 80, 82, 83, 86, 89, 90, 92, 93, 102, 103, 104, 105, 
      110, 111, 112, 113, 114, 118, 119, 121, 122, 123, 127, 130, 135, 136, 
      137, 138, 143, 144, 148, 151, 173, 177, 178, 179, 181, 183, 184, 187, 
      189, 195, 200, 201, 204, 205, 209, 210, 211, 212, 221, 222 ], 
  [ 1, 6, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 30, 31, 32, 37, 38, 
      69, 70, 77, 79, 80, 83, 84, 86, 89, 90, 93, 96, 102, 103, 104, 106, 
      110, 111, 112, 113, 115, 118, 119, 122, 123, 128, 131, 135, 136, 137, 
      138, 139, 143, 144, 155, 156, 175, 177, 179, 181, 182, 183, 186, 187, 
      195, 196, 200, 202, 204, 206, 209, 210, 215, 216, 221, 223 ], 
  [ 1, 8, 10, 13, 15, 19, 23, 27, 31, 32, 42, 78, 80, 81, 104 ], 
  [ 1, 8, 9, 13, 15, 23, 30, 32, 80, 90, 93 ], 
  [ 1, 9, 15, 23, 32, 37, 90, 93 ], 
  [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 35, 38, 68, 70, 
      73, 75, 77, 79, 80, 82, 84, 86, 89, 90, 92, 93, 94, 96, 110, 118, 119, 
      121, 122, 127, 128, 135, 137, 139, 143, 146, 148, 150, 152, 155, 174, 
      177, 178, 182, 185, 187, 189, 195, 196, 198, 199, 209, 211, 213, 215, 
      218 ], [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 38, 68, 
      70, 75, 77, 79, 80, 82, 84, 86, 89, 90, 92, 93, 96, 110, 118, 119, 121, 
      122, 127, 128, 135, 137, 139, 143, 148, 152, 155, 174, 177, 178, 182, 
      185, 187, 189, 195, 196, 199, 209, 211, 213, 215, 218 ], 
  [ 1, 6, 7, 8, 10, 13, 15, 16, 18, 21, 23, 25, 28, 31, 32, 38, 68, 70, 75, 
      77, 79, 80, 82, 84, 102, 103, 104, 105, 106, 110, 118, 119, 121, 130, 
      131, 136, 137, 139, 152, 174, 177, 178, 182, 185, 200, 201, 202, 203, 
      214 ], [ 1, 8, 9, 13, 15, 23, 28, 30, 32, 80, 82, 90, 92, 93, 143 ], 
  [ 1, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 28, 30, 
      31, 32, 33, 35, 37, 38, 40, 41, 42, 68, 69, 70, 77, 78, 79, 80, 82, 83, 
      84, 85, 86, 87, 88, 89, 90, 92, 93, 94, 96, 98, 99, 102, 103, 104, 105, 
      106, 109, 110, 111, 112, 113, 114, 115, 118, 119, 121, 122, 123, 124, 
      127, 128, 130, 131, 132, 133, 135, 136, 137, 138, 139, 140, 141, 143, 
      144, 148, 150, 151, 152, 153, 155, 156, 173, 174, 175, 177, 178, 179, 
      181, 182, 183, 184, 185, 186, 187, 189, 190, 192, 193, 195, 196, 198, 
      199, 200, 201, 202, 203, 204, 205, 206, 207, 209, 210, 211, 212, 213, 
      214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 6, 8, 13, 15, 16, 21, 23, 28, 32, 35, 38, 68, 70, 77, 79, 80, 82, 84, 
      110, 118, 119, 121, 137, 139, 152, 174, 177, 178, 182, 185 ], 
  [ 1, 9, 15, 23, 28, 32, 37, 90, 92, 93, 144 ], 
  [ 1, 15, 16, 21, 23, 28, 32, 38, 118, 119, 121, 137, 139 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 28, 30, 32, 35, 37, 38, 41, 68, 69, 
      70, 77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 94, 96, 110, 118, 119, 
      121, 122, 123, 127, 128, 135, 137, 138, 139, 143, 144, 148, 150, 151, 
      152, 155, 156, 173, 174, 175, 177, 178, 179, 181, 182, 183, 184, 185, 
      186, 187, 189, 195, 196, 198, 199, 209, 210, 211, 212, 213, 215, 216, 
      218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 6, 7, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 24, 25, 28, 29, 
      30, 31, 32, 37, 38, 68, 69, 70, 74, 75, 77, 79, 80, 82, 83, 84, 86, 89, 
      90, 92, 93, 96, 102, 103, 104, 105, 106, 110, 111, 112, 113, 114, 115, 
      118, 119, 121, 122, 123, 127, 128, 130, 131, 135, 136, 137, 138, 139, 
      140, 141, 143, 144, 146, 147, 148, 151, 152, 155, 156, 173, 174, 175, 
      176, 177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 195, 196, 
      199, 200, 201, 202, 203, 204, 205, 206, 207, 209, 210, 211, 212, 213, 
      214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 8, 9, 13, 15, 16, 30, 32, 38, 77, 84, 86, 93, 96, 122 ], 
  [ 1, 9, 15, 16, 32, 37, 38, 86, 93, 96, 123 ], 
  [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 37, 39, 68, 69, 
      74, 77, 79, 80, 82, 83, 86, 89, 90, 92, 93, 97, 110, 118, 119, 121, 
      122, 123, 127, 135, 137, 138, 143, 144, 148, 151, 173, 177, 178, 179, 
      181, 183, 184, 187, 189, 195, 209, 210, 211, 212, 221, 222 ], 
  [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 37, 38, 39, 43, 
      68, 69, 70, 74, 75, 77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 96, 97, 
      100, 110, 118, 119, 121, 122, 123, 127, 128, 135, 137, 138, 139, 143, 
      144, 146, 148, 151, 152, 155, 156, 157, 173, 174, 175, 176, 177, 178, 
      179, 181, 182, 183, 184, 185, 186, 187, 189, 195, 196, 199, 209, 210, 
      211, 212, 213, 215, 216, 218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 2, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 27, 
      30, 31, 32, 33, 35, 37, 38, 40, 41, 42, 46, 48, 49, 50, 52, 53, 54, 57, 
      59, 62, 67, 69, 70, 77, 78, 79, 80, 81, 83, 84, 85, 86, 87, 88, 89, 90, 
      91, 93, 94, 96, 98, 99, 102, 103, 104, 106, 110, 111, 112, 113, 115, 
      118, 119, 120, 122, 123, 124, 126, 128, 131, 134, 135, 136, 137, 138, 
      139, 141, 142, 143, 144, 155, 156, 163, 165, 171, 175, 177, 179, 180, 
      181, 182, 183, 186, 187, 188, 190, 194, 195, 196, 197, 200, 202, 204, 
      206, 208, 209, 210, 215, 216, 221, 223, 225 ], 
  [ 1, 2, 6, 8, 9, 13, 15, 16, 17, 21, 23, 28, 30, 32, 37, 38, 46, 48, 54, 
      58, 68, 69, 70, 77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 96, 110, 
      118, 119, 121, 122, 123, 127, 128, 135, 137, 138, 139, 143, 144, 148, 
      151, 152, 155, 156, 163, 164, 173, 174, 175, 177, 178, 179, 181, 182, 
      183, 184, 185, 186, 187, 189, 195, 196, 199, 209, 210, 211, 212, 213, 
      215, 216, 218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 2, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 27, 
      28, 30, 31, 32, 33, 35, 37, 38, 40, 41, 42, 44, 46, 48, 49, 50, 52, 53, 
      54, 57, 58, 59, 62, 63, 67, 68, 69, 70, 71, 77, 78, 79, 80, 81, 82, 83, 
      84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 96, 98, 99, 101, 102, 103, 
      104, 105, 106, 109, 110, 111, 112, 113, 114, 115, 118, 119, 120, 121, 
      122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 
      136, 137, 138, 139, 140, 141, 142, 143, 144, 148, 149, 150, 151, 152, 
      153, 155, 156, 159, 160, 163, 164, 165, 166, 168, 169, 170, 171, 172, 
      173, 174, 175, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 
      188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 
      202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 
      216, 217, 218, 219, 220, 221, 222, 223, 224, 225 ], 
  [ 1, 2, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 35, 37, 38, 41, 
      46, 47, 48, 54, 58, 59, 68, 69, 70, 73, 74, 75, 76, 77, 79, 80, 82, 83, 
      84, 86, 89, 90, 92, 93, 94, 96, 110, 118, 119, 121, 122, 123, 127, 128, 
      135, 137, 138, 139, 143, 144, 145, 146, 148, 150, 151, 152, 153, 155, 
      156, 160, 163, 164, 172, 173, 174, 175, 176, 177, 178, 179, 181, 182, 
      183, 184, 185, 186, 187, 189, 195, 196, 198, 199, 209, 210, 211, 212, 
      213, 215, 216, 218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 2, 8, 9, 13, 15, 16, 21, 23, 30, 32, 37, 38, 48, 54, 77, 79, 80, 83, 
      84, 86, 89, 90, 93, 96, 110, 118, 119, 122, 123, 135, 137, 138, 139, 
      143, 144, 155, 156, 177, 179, 181, 182, 183, 186, 187, 195, 196, 209, 
      210, 215, 216, 221, 223 ], 
  [ 1, 2, 8, 9, 13, 15, 16, 21, 23, 28, 30, 32, 37, 38, 48, 54, 58, 77, 79, 
      80, 82, 83, 84, 86, 89, 90, 92, 93, 96, 110, 118, 119, 121, 122, 123, 
      135, 137, 138, 139, 143, 144, 148, 151, 152, 155, 156, 163, 177, 178, 
      179, 181, 182, 183, 184, 185, 186, 187, 189, 195, 196, 199, 209, 210, 
      211, 212, 215, 216, 218, 219, 221, 222, 223, 224 ], 
  [ 1, 2, 8, 9, 10, 13, 14, 15, 16, 21, 23, 30, 31, 32, 37, 38, 48, 49, 54, 
      77, 79, 80, 83, 84, 86, 89, 90, 93, 96, 102, 103, 104, 106, 110, 111, 
      112, 113, 115, 118, 119, 122, 123, 135, 136, 137, 138, 139, 143, 144, 
      155, 156, 163, 177, 179, 181, 182, 183, 186, 187, 195, 196, 200, 202, 
      204, 206, 209, 210, 215, 216, 221, 223 ], 
  [ 1, 2, 8, 9, 10, 13, 14, 15, 16, 21, 23, 28, 30, 31, 32, 37, 38, 48, 49, 
      54, 58, 77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 96, 102, 103, 104, 
      105, 106, 110, 111, 112, 113, 114, 115, 118, 119, 121, 122, 123, 135, 
      136, 137, 138, 139, 143, 144, 148, 151, 152, 155, 156, 163, 164, 165, 
      177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 195, 196, 199, 
      200, 201, 202, 203, 204, 205, 206, 207, 209, 210, 211, 212, 215, 216, 
      218, 219, 221, 222, 223, 224 ], 
  [ 1, 2, 6, 7, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 24, 25, 28, 29, 
      30, 31, 32, 37, 38, 39, 43, 46, 47, 48, 49, 52, 54, 55, 58, 61, 68, 69, 
      70, 74, 75, 77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 96, 97, 100, 
      102, 103, 104, 105, 106, 107, 108, 110, 111, 112, 113, 114, 115, 116, 
      117, 118, 119, 121, 122, 123, 127, 128, 130, 131, 135, 136, 137, 138, 
      139, 140, 141, 143, 144, 146, 147, 148, 151, 152, 154, 155, 156, 157, 
      158, 160, 163, 164, 165, 166, 169, 173, 174, 175, 176, 177, 178, 179, 
      181, 182, 183, 184, 185, 186, 187, 189, 195, 196, 199, 200, 201, 202, 
      203, 204, 205, 206, 207, 209, 210, 211, 212, 213, 214, 215, 216, 217, 
      218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 2, 6, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 28, 
      30, 31, 32, 33, 35, 37, 38, 40, 41, 42, 46, 48, 49, 50, 52, 53, 54, 58, 
      59, 62, 68, 69, 70, 77, 78, 79, 80, 82, 83, 84, 85, 86, 87, 88, 89, 90, 
      92, 93, 94, 96, 98, 99, 102, 103, 104, 105, 106, 109, 110, 111, 112, 
      113, 114, 115, 118, 119, 121, 122, 123, 124, 127, 128, 130, 131, 132, 
      133, 135, 136, 137, 138, 139, 140, 141, 143, 144, 148, 149, 150, 151, 
      152, 153, 155, 156, 160, 163, 164, 165, 166, 169, 170, 172, 173, 174, 
      175, 177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 190, 192, 
      193, 195, 196, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 209, 
      210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 
      224 ], [ 1, 2, 6, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 28, 30, 
      31, 32, 37, 38, 46, 48, 49, 52, 54, 58, 68, 69, 70, 77, 79, 80, 82, 83, 
      84, 86, 89, 90, 92, 93, 96, 102, 103, 104, 105, 106, 110, 111, 112, 
      113, 114, 115, 118, 119, 121, 122, 123, 127, 128, 130, 131, 135, 136, 
      137, 138, 139, 140, 141, 143, 144, 148, 151, 152, 155, 156, 160, 163, 
      164, 165, 166, 173, 174, 175, 177, 178, 179, 181, 182, 183, 184, 185, 
      186, 187, 189, 195, 196, 199, 200, 201, 202, 203, 204, 205, 206, 207, 
      209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 
      223, 224 ], 
  [ 1, 2, 8, 9, 10, 13, 14, 15, 16, 19, 20, 21, 23, 28, 30, 31, 32, 37, 38, 
      40, 42, 48, 49, 53, 54, 58, 62, 77, 78, 79, 80, 82, 83, 84, 85, 86, 87, 
      88, 89, 90, 92, 93, 96, 98, 99, 102, 103, 104, 105, 106, 110, 111, 112, 
      113, 114, 115, 118, 119, 121, 122, 123, 124, 132, 133, 135, 136, 137, 
      138, 139, 143, 144, 148, 151, 152, 155, 156, 163, 164, 165, 166, 177, 
      178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 190, 192, 193, 195, 
      196, 199, 200, 201, 202, 203, 204, 205, 206, 207, 209, 210, 211, 212, 
      215, 216, 218, 219, 221, 222, 223, 224 ], 
  [ 1, 2, 8, 9, 10, 13, 14, 15, 16, 19, 20, 21, 23, 27, 30, 31, 32, 37, 38, 
      40, 42, 48, 49, 53, 54, 57, 62, 77, 78, 79, 80, 81, 83, 84, 85, 86, 87, 
      88, 89, 90, 91, 93, 96, 98, 99, 102, 103, 104, 106, 110, 111, 112, 113, 
      115, 118, 119, 120, 122, 123, 124, 134, 135, 136, 137, 138, 139, 142, 
      143, 144, 155, 156, 163, 165, 177, 179, 180, 181, 182, 183, 186, 187, 
      188, 190, 194, 195, 196, 197, 200, 202, 204, 206, 208, 209, 210, 215, 
      216, 221, 223, 225 ], 
  [ 1, 2, 6, 8, 9, 13, 15, 16, 17, 21, 23, 28, 30, 32, 35, 37, 38, 41, 46, 
      48, 54, 58, 59, 68, 69, 70, 77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 
      94, 96, 110, 118, 119, 121, 122, 123, 127, 128, 135, 137, 138, 139, 
      143, 144, 148, 150, 151, 152, 153, 155, 156, 160, 163, 164, 173, 174, 
      175, 177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 195, 196, 
      198, 199, 209, 210, 211, 212, 213, 215, 216, 218, 219, 220, 221, 222, 
      223, 224 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 28, 30, 32, 37, 68, 69, 77, 79, 80, 
      82, 83, 86, 89, 90, 92, 93, 110, 118, 119, 121, 122, 123, 127, 135, 
      137, 138, 143, 144, 148, 151, 177, 178, 179, 181, 183, 184, 187, 189, 
      195, 209, 210, 211, 212, 221, 222 ], 
  [ 1, 6, 8, 13, 15, 16, 21, 23, 28, 32, 38, 68, 70, 77, 79, 80, 82, 84, 110, 
      118, 119, 121, 137, 139, 152, 177, 178, 182, 185 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 30, 32, 37, 38, 69, 70, 77, 79, 80, 
      83, 84, 86, 89, 90, 93, 96, 110, 118, 119, 122, 123, 128, 135, 137, 
      138, 139, 143, 144, 155, 156, 177, 179, 181, 182, 183, 186, 187, 195, 
      196, 209, 210, 215, 216, 221, 223 ], 
  [ 1, 6, 7, 8, 9, 13, 15, 16, 17, 21, 23, 24, 28, 30, 32, 37, 38, 68, 69, 
      70, 74, 75, 77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 96, 110, 118, 
      119, 121, 122, 123, 127, 128, 135, 137, 138, 139, 143, 144, 146, 148, 
      151, 152, 155, 156, 173, 174, 175, 177, 178, 179, 181, 182, 183, 184, 
      185, 186, 187, 189, 195, 196, 199, 209, 210, 211, 212, 213, 215, 216, 
      218, 219, 220, 221, 222, 223, 224 ], 
  [ 1, 8, 13, 15, 16, 21, 23, 32, 77, 79, 80, 110, 118, 119, 137 ], 
  [ 1, 8, 13, 15, 16, 21, 23, 28, 32, 77, 79, 80, 82, 110, 118, 119, 121, 
      137, 177 ], [ 1, 8, 9, 13, 15, 16, 30, 32, 37, 77, 83, 86, 93, 122, 123 
     ], [ 1, 8, 10, 13, 15, 19, 21, 27, 31, 32, 40, 78, 79, 81, 85, 103, 110, 
      118, 134, 136, 137 ], 
  [ 1, 8, 9, 13, 15, 21, 30, 32, 37, 79, 83, 89, 93, 110, 118, 135, 137, 138, 
      195 ], 
  [ 1, 8, 13, 15, 16, 21, 23, 32, 38, 77, 79, 80, 84, 110, 118, 119, 137, 
      139, 177 ], [ 1, 8, 9, 13, 15, 23, 30, 32, 37, 80, 83, 90, 93, 143, 144 
     ], [ 1, 8, 9, 13, 15, 23, 28, 30, 32, 37, 80, 82, 83, 90, 92, 93, 143, 
      144, 148, 151, 183 ], 
  [ 1, 8, 13, 15, 16, 21, 23, 28, 32, 38, 77, 79, 80, 82, 84, 110, 118, 119, 
      121, 137, 139, 152, 177, 178, 182 ], 
  [ 1, 8, 9, 13, 15, 16, 30, 32, 37, 38, 77, 83, 84, 86, 93, 96, 122, 123, 
      155, 156, 179 ], 
  [ 1, 9, 15, 16, 21, 23, 32, 86, 89, 90, 93, 118, 119, 137, 195 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 19, 20, 27, 30, 31, 32, 37, 38, 77, 78, 81, 
      83, 84, 86, 87, 88, 91, 93, 96, 102, 106, 111, 115, 120, 122, 123, 155, 
      156, 179, 186 ], 
  [ 1, 9, 15, 16, 21, 23, 28, 32, 86, 89, 90, 92, 93, 118, 119, 121, 137, 
      187, 195 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 19, 20, 21, 23, 30, 31, 32, 37, 38, 40, 42, 
      77, 78, 79, 80, 83, 84, 85, 86, 87, 88, 89, 90, 93, 96, 98, 99, 102, 
      103, 104, 106, 110, 111, 112, 113, 115, 118, 119, 122, 123, 124, 135, 
      136, 137, 138, 139, 143, 144, 155, 156, 177, 179, 181, 182, 183, 186, 
      187, 195, 196, 200, 202, 204, 206, 209, 210, 215, 216, 221, 223 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 19, 20, 21, 23, 27, 28, 30, 31, 32, 37, 38, 
      40, 42, 44, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 
      92, 93, 96, 98, 99, 101, 102, 103, 104, 105, 106, 110, 111, 112, 113, 
      114, 115, 118, 119, 120, 121, 122, 123, 124, 125, 132, 133, 134, 135, 
      136, 137, 138, 139, 142, 143, 144, 148, 151, 152, 155, 156, 177, 178, 
      179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 192, 193, 
      194, 195, 196, 197, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 
      209, 210, 211, 212, 215, 216, 218, 219, 221, 222, 223, 224, 225 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 19, 23, 28, 30, 31, 32, 37, 42, 78, 80, 82, 83, 
      87, 90, 92, 93, 99, 104, 105, 113, 114, 132, 143, 144, 148, 151, 183, 
      184 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 19, 20, 21, 23, 28, 30, 31, 32, 37, 38, 40, 
      42, 77, 78, 79, 80, 82, 83, 84, 85, 86, 87, 88, 89, 90, 92, 93, 96, 98, 
      99, 102, 103, 104, 105, 106, 110, 111, 112, 113, 114, 115, 118, 119, 
      121, 122, 123, 124, 132, 133, 135, 136, 137, 138, 139, 143, 144, 148, 
      151, 152, 155, 156, 177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 
      189, 190, 192, 195, 196, 199, 200, 201, 202, 203, 204, 205, 206, 207, 
      209, 210, 211, 212, 215, 216, 218, 219, 221, 222, 223, 224 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 19, 21, 27, 30, 31, 32, 37, 40, 78, 79, 81, 83, 
      85, 87, 89, 91, 93, 98, 103, 110, 112, 118, 134, 135, 136, 137, 138, 
      180, 181, 195 ], [ 1, 9, 15, 21, 32, 89, 93, 118, 137 ], 
  [ 1, 9, 15, 16, 21, 23, 32, 38, 86, 89, 90, 93, 96, 118, 119, 137, 139, 
      187, 195 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 19, 23, 27, 30, 31, 32, 37, 42, 78, 80, 81, 83, 
      87, 90, 91, 93, 99, 104, 113, 142, 143, 144, 183 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 28, 30, 32, 35, 38, 68, 70, 77, 79, 
      80, 82, 84, 86, 89, 90, 92, 93, 94, 96, 110, 118, 119, 121, 122, 127, 
      128, 135, 137, 139, 143, 148, 150, 152, 155, 174, 177, 178, 182, 185, 
      187, 189, 195, 196, 199, 209, 211, 213, 215, 218 ], 
  [ 1, 9, 15, 16, 21, 23, 28, 32, 38, 86, 89, 90, 92, 93, 96, 118, 119, 121, 
      137, 139, 152, 187, 189, 195, 196 ], 
  [ 1, 8, 10, 13, 15, 16, 21, 23, 31, 32, 77, 79, 80, 102, 103, 104, 110, 
      118, 119, 136, 137, 177 ], 
  [ 1, 8, 10, 13, 15, 16, 21, 23, 28, 31, 32, 77, 79, 80, 82, 102, 103, 104, 
      105, 110, 118, 119, 121, 136, 137, 177, 178, 200 ], 
  [ 1, 8, 10, 13, 15, 16, 21, 23, 31, 32, 38, 77, 79, 80, 84, 102, 103, 104, 
      106, 110, 118, 119, 136, 137, 139, 177, 182, 200 ], 
  [ 1, 8, 10, 13, 15, 16, 21, 23, 28, 31, 32, 38, 77, 79, 80, 82, 84, 102, 
      103, 104, 105, 106, 110, 118, 119, 121, 136, 137, 139, 152, 177, 178, 
      182, 185, 200, 201, 202 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 21, 23, 30, 31, 32, 37, 77, 79, 80, 83, 86, 
      89, 90, 93, 102, 103, 104, 110, 111, 112, 113, 118, 119, 122, 123, 135, 
      136, 137, 138, 143, 144, 177, 179, 181, 183, 187, 195, 200, 209, 210, 
      221 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 21, 23, 28, 30, 31, 32, 37, 77, 79, 80, 82, 
      83, 86, 89, 90, 92, 93, 102, 103, 104, 105, 110, 111, 112, 113, 114, 
      118, 119, 121, 122, 123, 135, 136, 137, 138, 143, 144, 148, 151, 177, 
      178, 179, 181, 183, 184, 187, 189, 195, 200, 201, 204, 209, 210, 211, 
      212, 221, 222 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 21, 23, 30, 31, 32, 37, 38, 77, 79, 80, 83, 
      84, 86, 89, 90, 93, 96, 102, 103, 104, 106, 110, 111, 112, 113, 115, 
      118, 119, 122, 123, 135, 136, 137, 138, 139, 143, 144, 155, 156, 177, 
      179, 181, 182, 183, 186, 187, 195, 196, 200, 202, 204, 209, 210, 215, 
      216, 221, 223 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 21, 23, 28, 30, 31, 32, 37, 38, 77, 79, 80, 
      82, 83, 84, 86, 89, 90, 92, 93, 96, 102, 103, 104, 105, 106, 110, 111, 
      112, 113, 114, 115, 118, 119, 121, 122, 123, 135, 136, 137, 138, 139, 
      143, 144, 148, 151, 152, 155, 156, 177, 178, 179, 181, 182, 183, 184, 
      185, 186, 187, 189, 195, 196, 199, 200, 201, 202, 203, 204, 205, 206, 
      209, 210, 211, 212, 215, 216, 218, 219, 221, 222, 223, 224 ], 
  [ 1, 8, 10, 13, 15, 16, 19, 20, 21, 23, 27, 31, 32, 38, 40, 42, 77, 78, 79, 
      80, 81, 84, 85, 102, 103, 104, 106, 110, 118, 119, 120, 124, 134, 136, 
      137, 139, 142, 177, 180, 182, 200, 202 ], 
  [ 1, 8, 9, 13, 15, 16, 21, 23, 30, 32, 77, 79, 80, 86, 89, 90, 93, 110, 
      118, 119, 122, 135, 137, 143, 177, 187, 195 ], 
  [ 1, 9, 15, 16, 21, 23, 32, 37, 86, 89, 90, 93, 118, 119, 123, 137, 138, 
      144, 187, 195 ], 
  [ 1, 8, 9, 13, 15, 16, 21, 23, 28, 30, 32, 77, 79, 80, 82, 86, 89, 90, 92, 
      93, 110, 118, 119, 121, 122, 135, 137, 143, 148, 177, 178, 187, 189, 
      195, 209 ], 
  [ 1, 9, 15, 16, 21, 23, 28, 32, 37, 86, 89, 90, 92, 93, 118, 119, 121, 123, 
      137, 138, 144, 151, 187, 189, 195, 210 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 28, 30, 32, 38, 68, 70, 77, 79, 80, 
      82, 84, 86, 89, 90, 92, 93, 96, 110, 118, 119, 121, 122, 127, 128, 135, 
      137, 139, 143, 148, 152, 155, 174, 177, 178, 182, 185, 187, 189, 195, 
      196, 199, 209, 211, 215, 218 ], 
  [ 1, 6, 8, 10, 13, 15, 16, 18, 21, 23, 28, 31, 32, 38, 68, 70, 77, 79, 80, 
      82, 84, 102, 103, 104, 105, 106, 110, 118, 119, 121, 130, 131, 136, 
      137, 139, 152, 174, 177, 178, 182, 185, 200, 201, 202, 203 ], 
  [ 1, 8, 9, 13, 15, 16, 21, 23, 30, 32, 38, 77, 79, 80, 84, 86, 89, 90, 93, 
      96, 110, 118, 119, 122, 135, 137, 139, 143, 155, 177, 182, 187, 195, 
      196, 209 ], 
  [ 1, 9, 15, 16, 21, 23, 32, 37, 38, 86, 89, 90, 93, 96, 118, 119, 123, 137, 
      138, 139, 144, 156, 187, 195, 196, 210 ], 
  [ 1, 6, 8, 9, 10, 13, 14, 15, 16, 17, 18, 21, 22, 23, 28, 30, 31, 32, 37, 
      38, 68, 69, 70, 77, 79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 96, 102, 
      103, 104, 105, 106, 110, 111, 112, 113, 114, 115, 118, 119, 121, 122, 
      123, 127, 128, 130, 131, 135, 136, 137, 138, 139, 140, 141, 143, 144, 
      148, 151, 152, 155, 156, 173, 174, 175, 177, 178, 179, 181, 182, 183, 
      184, 185, 186, 187, 189, 195, 196, 199, 200, 201, 202, 203, 204, 205, 
      206, 207, 209, 210, 211, 212, 213, 214, 215, 216, 218, 219, 220, 221, 
      222, 223, 224 ], 
  [ 1, 8, 9, 13, 15, 16, 21, 23, 28, 30, 32, 38, 77, 79, 80, 82, 84, 86, 89, 
      90, 92, 93, 96, 110, 118, 119, 121, 122, 135, 137, 139, 143, 148, 152, 
      155, 177, 178, 182, 185, 187, 189, 195, 196, 199, 209, 211, 215 ], 
  [ 1, 9, 15, 16, 21, 23, 28, 32, 37, 38, 86, 89, 90, 92, 93, 96, 118, 119, 
      121, 123, 137, 138, 139, 144, 151, 152, 156, 187, 189, 195, 196, 199, 
      210, 212, 216 ], 
  [ 1, 6, 8, 9, 13, 15, 16, 17, 21, 23, 28, 30, 32, 37, 38, 68, 69, 70, 77, 
      79, 80, 82, 83, 84, 86, 89, 90, 92, 93, 96, 110, 118, 119, 121, 122, 
      123, 127, 128, 135, 137, 138, 139, 143, 144, 148, 151, 152, 155, 156, 
      173, 174, 175, 177, 178, 179, 181, 182, 183, 184, 185, 186, 187, 189, 
      195, 196, 199, 209, 210, 211, 212, 213, 215, 216, 218, 219, 221, 222, 
      223, 224 ], 
  [ 1, 8, 9, 13, 15, 16, 21, 23, 30, 32, 37, 77, 79, 80, 83, 86, 89, 90, 93, 
      110, 118, 119, 122, 123, 135, 137, 138, 143, 144, 177, 179, 181, 183, 
      187, 195, 209, 210 ], 
  [ 1, 8, 9, 13, 15, 16, 21, 23, 28, 30, 32, 37, 77, 79, 80, 82, 83, 86, 89, 
      90, 92, 93, 110, 118, 119, 121, 122, 123, 135, 137, 138, 143, 144, 148, 
      151, 177, 178, 179, 181, 183, 184, 187, 189, 195, 209, 210, 211, 212, 
      221 ], 
  [ 1, 8, 9, 13, 15, 16, 21, 23, 30, 32, 37, 38, 77, 79, 80, 83, 84, 86, 89, 
      90, 93, 96, 110, 118, 119, 122, 123, 135, 137, 138, 139, 143, 144, 155, 
      156, 177, 179, 181, 182, 183, 186, 187, 195, 196, 209, 210, 215, 216, 
      221 ], 
  [ 1, 8, 9, 13, 15, 16, 21, 23, 28, 30, 32, 37, 38, 77, 79, 80, 82, 83, 84, 
      86, 89, 90, 92, 93, 96, 110, 118, 119, 121, 122, 123, 135, 137, 138, 
      139, 143, 144, 148, 151, 152, 155, 156, 177, 178, 179, 181, 182, 183, 
      184, 185, 186, 187, 189, 195, 196, 199, 209, 210, 211, 212, 215, 216, 
      218, 219, 221, 222, 223 ], 
  [ 1, 8, 9, 10, 13, 14, 15, 16, 19, 20, 21, 23, 27, 30, 31, 32, 37, 38, 40, 
      42, 77, 78, 79, 80, 81, 83, 84, 85, 86, 87, 88, 89, 90, 91, 93, 96, 98, 
      99, 102, 103, 104, 106, 110, 111, 112, 113, 115, 118, 119, 120, 122, 
      123, 124, 134, 135, 136, 137, 138, 139, 142, 143, 144, 155, 156, 177, 
      179, 180, 181, 182, 183, 186, 187, 188, 190, 194, 195, 196, 197, 200, 
      202, 204, 206, 208, 209, 210, 215, 216, 221, 223 ] ]
gap> S := OrderEndomorphisms(2);;
gap> l := LatticeOfCongruences(S);
[ [  ], [ 1, 3 ], [ 1 ] ]
gap> S := OrderEndomorphisms(3);;
gap> l := LatticeOfCongruences(S);
[ [  ], [ 1, 4 ], [ 1, 2, 4 ], [ 1 ] ]
gap> S := OrderEndomorphisms(4);;
gap> l := LatticeOfCongruences(S);
[ [  ], [ 1, 5 ], [ 1, 2, 5 ], [ 1, 2, 3, 5 ], [ 1 ] ]
gap> S := PartitionMonoid(2);;
gap> l := LatticeOfCongruences(S);
[ [  ], [ 1, 3, 7 ], [ 1 ], [ 1, 3, 8 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13 ], [ 1, 2, 3, 4, 7, 8, 9 ], [ 1 ], 
  [ 1 ], [ 1, 7, 8 ], [ 1, 3 ], [ 1, 2, 3, 7, 10 ], [ 1, 3, 4, 8, 10 ], 
  [ 1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12 ] ]

#T# SEMIGROUPS_UnbindVariables
gap> Unbind(P);
gap> Unbind(R);
gap> Unbind(S);
gap> Unbind(c);
gap> Unbind(classes);
gap> Unbind(classx);
gap> Unbind(classy);
gap> Unbind(classz);
gap> Unbind(cong);
gap> Unbind(gens);
gap> Unbind(l);
gap> Unbind(q);
gap> Unbind(s);
gap> Unbind(t);
gap> Unbind(u);
gap> Unbind(v);
gap> Unbind(x);
gap> Unbind(y);
gap> Unbind(z);

#E#
gap> STOP_TEST("Semigroups package: extreme/pairs.tst");
